pokemons = {
    "アイアント": {
        "base_stats": {
            "a": 109,
            "b": 112,
            "c": 48,
            "d": 48,
            "h": 58,
            "s": 109
        },
        "id": 632,
        "types": [
            "むし",
            "はがね"
        ]
    },
    "アオガラス": {
        "base_stats": {
            "a": 67,
            "b": 55,
            "c": 43,
            "d": 55,
            "h": 68,
            "s": 77
        },
        "id": 822,
        "types": [
            "ひこう"
        ]
    },
    "アギルダー": {
        "base_stats": {
            "a": 70,
            "b": 40,
            "c": 100,
            "d": 60,
            "h": 80,
            "s": 145
        },
        "id": 617,
        "types": [
            "むし"
        ]
    },
    "アクジキング": {
        "base_stats": {
            "a": 101,
            "b": 53,
            "c": 97,
            "d": 53,
            "h": 223,
            "s": 43
        },
        "id": 799,
        "types": [
            "あく",
            "ドラゴン"
        ]
    },
    "アグノム": {
        "base_stats": {
            "a": 125,
            "b": 70,
            "c": 125,
            "d": 70,
            "h": 75,
            "s": 115
        },
        "id": 482,
        "types": [
            "エスパー"
        ]
    },
    "アゲハント": {
        "base_stats": {
            "a": 70,
            "b": 50,
            "c": 100,
            "d": 50,
            "h": 60,
            "s": 65
        },
        "id": 267,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "アゴジムシ": {
        "base_stats": {
            "a": 62,
            "b": 45,
            "c": 55,
            "d": 45,
            "h": 47,
            "s": 46
        },
        "id": 736,
        "types": [
            "むし"
        ]
    },
    "アサナン": {
        "base_stats": {
            "a": 40,
            "b": 55,
            "c": 40,
            "d": 55,
            "h": 30,
            "s": 60
        },
        "id": 307,
        "types": [
            "かくとう",
            "エスパー"
        ]
    },
    "アシマリ": {
        "base_stats": {
            "a": 54,
            "b": 54,
            "c": 66,
            "d": 56,
            "h": 50,
            "s": 40
        },
        "id": 728,
        "types": [
            "みず"
        ]
    },
    "アシレーヌ": {
        "base_stats": {
            "a": 74,
            "b": 74,
            "c": 126,
            "d": 116,
            "h": 80,
            "s": 60
        },
        "id": 730,
        "types": [
            "みず",
            "フェアリー"
        ]
    },
    "アズマオウ": {
        "base_stats": {
            "a": 92,
            "b": 65,
            "c": 65,
            "d": 80,
            "h": 80,
            "s": 68
        },
        "id": 119,
        "types": [
            "みず"
        ]
    },
    "アチゲータ": {
        "base_stats": {
            "a": 55,
            "b": 78,
            "c": 90,
            "d": 58,
            "h": 81,
            "s": 49
        },
        "id": 910,
        "types": [
            "ほのお"
        ]
    },
    "アチャモ": {
        "base_stats": {
            "a": 60,
            "b": 40,
            "c": 70,
            "d": 50,
            "h": 45,
            "s": 45
        },
        "id": 255,
        "types": [
            "ほのお"
        ]
    },
    "アップリュー": {
        "base_stats": {
            "a": 110,
            "b": 80,
            "c": 95,
            "d": 60,
            "h": 70,
            "s": 70
        },
        "id": 841,
        "types": [
            "くさ",
            "ドラゴン"
        ]
    },
    "アノクサ": {
        "base_stats": {
            "a": 65,
            "b": 30,
            "c": 45,
            "d": 35,
            "h": 40,
            "s": 60
        },
        "id": 946,
        "types": [
            "くさ",
            "ゴースト"
        ]
    },
    "アノプス": {
        "base_stats": {
            "a": 95,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 45,
            "s": 75
        },
        "id": 347,
        "types": [
            "いわ",
            "むし"
        ]
    },
    "アノホラグサ": {
        "base_stats": {
            "a": 115,
            "b": 70,
            "c": 80,
            "d": 70,
            "h": 55,
            "s": 90
        },
        "id": 947,
        "types": [
            "くさ",
            "ゴースト"
        ]
    },
    "アバゴーラ": {
        "base_stats": {
            "a": 108,
            "b": 133,
            "c": 83,
            "d": 65,
            "h": 74,
            "s": 32
        },
        "id": 565,
        "types": [
            "みず",
            "いわ"
        ]
    },
    "アブソル": {
        "base_stats": {
            "a": 130,
            "b": 60,
            "c": 75,
            "d": 60,
            "h": 65,
            "s": 75
        },
        "id": 359,
        "types": [
            "あく"
        ]
    },
    "アブリボン": {
        "base_stats": {
            "a": 55,
            "b": 60,
            "c": 95,
            "d": 70,
            "h": 60,
            "s": 124
        },
        "id": 743,
        "types": [
            "むし",
            "フェアリー"
        ]
    },
    "アブリー": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 55,
            "d": 40,
            "h": 40,
            "s": 84
        },
        "id": 742,
        "types": [
            "むし",
            "フェアリー"
        ]
    },
    "アマカジ": {
        "base_stats": {
            "a": 30,
            "b": 38,
            "c": 30,
            "d": 38,
            "h": 42,
            "s": 32
        },
        "id": 761,
        "types": [
            "くさ"
        ]
    },
    "アママイコ": {
        "base_stats": {
            "a": 40,
            "b": 48,
            "c": 40,
            "d": 48,
            "h": 52,
            "s": 62
        },
        "id": 762,
        "types": [
            "くさ"
        ]
    },
    "アマルス": {
        "base_stats": {
            "a": 59,
            "b": 50,
            "c": 67,
            "d": 63,
            "h": 77,
            "s": 46
        },
        "id": 698,
        "types": [
            "いわ",
            "こおり"
        ]
    },
    "アマルルガ": {
        "base_stats": {
            "a": 77,
            "b": 72,
            "c": 99,
            "d": 92,
            "h": 123,
            "s": 58
        },
        "id": 699,
        "types": [
            "いわ",
            "こおり"
        ]
    },
    "アマージョ": {
        "base_stats": {
            "a": 120,
            "b": 98,
            "c": 50,
            "d": 98,
            "h": 72,
            "s": 72
        },
        "id": 763,
        "types": [
            "くさ"
        ]
    },
    "アメタマ": {
        "base_stats": {
            "a": 30,
            "b": 32,
            "c": 50,
            "d": 52,
            "h": 40,
            "s": 65
        },
        "id": 283,
        "types": [
            "むし",
            "みず"
        ]
    },
    "アメモース": {
        "base_stats": {
            "a": 60,
            "b": 62,
            "c": 100,
            "d": 82,
            "h": 70,
            "s": 80
        },
        "id": 284,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "アヤシシ": {
        "base_stats": {
            "a": 105,
            "b": 72,
            "c": 105,
            "d": 75,
            "h": 103,
            "s": 65
        },
        "id": 899,
        "types": [
            "ノーマル",
            "エスパー"
        ]
    },
    "アラブルタケ": {
        "base_stats": {
            "a": 127,
            "b": 99,
            "c": 79,
            "d": 99,
            "h": 111,
            "s": 55
        },
        "id": 986,
        "types": [
            "くさ",
            "あく"
        ]
    },
    "アリアドス": {
        "base_stats": {
            "a": 90,
            "b": 70,
            "c": 60,
            "d": 70,
            "h": 70,
            "s": 40
        },
        "id": 168,
        "types": [
            "むし",
            "どく"
        ]
    },
    "アリゲイツ": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 59,
            "d": 63,
            "h": 65,
            "s": 58
        },
        "id": 159,
        "types": [
            "みず"
        ]
    },
    "アルクジラ": {
        "base_stats": {
            "a": 68,
            "b": 45,
            "c": 30,
            "d": 40,
            "h": 108,
            "s": 43
        },
        "id": 974,
        "types": [
            "こおり"
        ]
    },
    "アルセウス": {
        "base_stats": {
            "a": 120,
            "b": 120,
            "c": 120,
            "d": 120,
            "h": 120,
            "s": 120
        },
        "id": 493,
        "types": [
            "ノーマル"
        ]
    },
    "アンノーン": {
        "base_stats": {
            "a": 72,
            "b": 48,
            "c": 72,
            "d": 48,
            "h": 48,
            "s": 48
        },
        "id": 201,
        "types": [
            "エスパー"
        ]
    },
    "アーケオス": {
        "base_stats": {
            "a": 140,
            "b": 65,
            "c": 112,
            "d": 65,
            "h": 75,
            "s": 110
        },
        "id": 567,
        "types": [
            "いわ",
            "ひこう"
        ]
    },
    "アーケン": {
        "base_stats": {
            "a": 112,
            "b": 45,
            "c": 74,
            "d": 45,
            "h": 55,
            "s": 70
        },
        "id": 566,
        "types": [
            "いわ",
            "ひこう"
        ]
    },
    "アーゴヨン": {
        "base_stats": {
            "a": 73,
            "b": 73,
            "c": 127,
            "d": 73,
            "h": 73,
            "s": 121
        },
        "id": 804,
        "types": [
            "どく",
            "ドラゴン"
        ]
    },
    "アーボ": {
        "base_stats": {
            "a": 60,
            "b": 44,
            "c": 40,
            "d": 54,
            "h": 35,
            "s": 55
        },
        "id": 23,
        "types": [
            "どく"
        ]
    },
    "アーボック": {
        "base_stats": {
            "a": 95,
            "b": 69,
            "c": 65,
            "d": 79,
            "h": 60,
            "s": 80
        },
        "id": 24,
        "types": [
            "どく"
        ]
    },
    "アーマルド": {
        "base_stats": {
            "a": 125,
            "b": 100,
            "c": 70,
            "d": 80,
            "h": 75,
            "s": 45
        },
        "id": 348,
        "types": [
            "いわ",
            "むし"
        ]
    },
    "アーマーガア": {
        "base_stats": {
            "a": 87,
            "b": 105,
            "c": 53,
            "d": 85,
            "h": 98,
            "s": 67
        },
        "id": 823,
        "types": [
            "ひこう",
            "はがね"
        ]
    },
    "イエッサン": {
        "base_stats": {
            "a": 65,
            "b": 55,
            "c": 105,
            "d": 95,
            "h": 60,
            "s": 95
        },
        "id": 876,
        "types": [
            "エスパー",
            "ノーマル"
        ]
    },
    "イオルブ": {
        "base_stats": {
            "a": 45,
            "b": 110,
            "c": 80,
            "d": 120,
            "h": 60,
            "s": 90
        },
        "id": 826,
        "types": [
            "むし",
            "エスパー"
        ]
    },
    "イキリンコ": {
        "base_stats": {
            "a": 96,
            "b": 51,
            "c": 45,
            "d": 51,
            "h": 82,
            "s": 92
        },
        "id": 931,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "イシズマイ": {
        "base_stats": {
            "a": 65,
            "b": 85,
            "c": 35,
            "d": 35,
            "h": 50,
            "s": 55
        },
        "id": 557,
        "types": [
            "むし",
            "いわ"
        ]
    },
    "イシツブテ": {
        "base_stats": {
            "a": 80,
            "b": 100,
            "c": 30,
            "d": 30,
            "h": 40,
            "s": 20
        },
        "id": 74,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "イシヘンジン": {
        "base_stats": {
            "a": 125,
            "b": 135,
            "c": 20,
            "d": 20,
            "h": 100,
            "s": 70
        },
        "id": 874,
        "types": [
            "いわ"
        ]
    },
    "イダイトウ": {
        "base_stats": {
            "a": 112,
            "b": 65,
            "c": 80,
            "d": 75,
            "h": 120,
            "s": 78
        },
        "id": 902,
        "types": [
            "みず",
            "ゴースト"
        ]
    },
    "イダイナキバ": {
        "base_stats": {
            "a": 131,
            "b": 131,
            "c": 53,
            "d": 53,
            "h": 115,
            "s": 87
        },
        "id": 984,
        "types": [
            "じめん",
            "かくとう"
        ]
    },
    "イッカネズミ": {
        "base_stats": {
            "a": 75,
            "b": 70,
            "c": 65,
            "d": 75,
            "h": 74,
            "s": 111
        },
        "id": 925,
        "types": [
            "ノーマル"
        ]
    },
    "イトマル": {
        "base_stats": {
            "a": 60,
            "b": 40,
            "c": 40,
            "d": 40,
            "h": 40,
            "s": 30
        },
        "id": 167,
        "types": [
            "むし",
            "どく"
        ]
    },
    "イノムー": {
        "base_stats": {
            "a": 100,
            "b": 80,
            "c": 60,
            "d": 60,
            "h": 100,
            "s": 50
        },
        "id": 221,
        "types": [
            "こおり",
            "じめん"
        ]
    },
    "イベルタル": {
        "base_stats": {
            "a": 131,
            "b": 95,
            "c": 131,
            "d": 98,
            "h": 126,
            "s": 99
        },
        "id": 717,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "イルカマン": {
        "base_stats": {
            "a": 70,
            "b": 72,
            "c": 53,
            "d": 62,
            "h": 100,
            "s": 100
        },
        "id": 964,
        "types": [
            "みず"
        ]
    },
    "イルミーゼ": {
        "base_stats": {
            "a": 47,
            "b": 75,
            "c": 73,
            "d": 85,
            "h": 65,
            "s": 85
        },
        "id": 314,
        "types": [
            "むし"
        ]
    },
    "イワパレス": {
        "base_stats": {
            "a": 105,
            "b": 125,
            "c": 65,
            "d": 75,
            "h": 70,
            "s": 45
        },
        "id": 558,
        "types": [
            "むし",
            "いわ"
        ]
    },
    "イワンコ": {
        "base_stats": {
            "a": 65,
            "b": 40,
            "c": 30,
            "d": 40,
            "h": 45,
            "s": 60
        },
        "id": 744,
        "types": [
            "いわ"
        ]
    },
    "イワーク": {
        "base_stats": {
            "a": 45,
            "b": 160,
            "c": 30,
            "d": 45,
            "h": 35,
            "s": 70
        },
        "id": 95,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "インテレオン": {
        "base_stats": {
            "a": 85,
            "b": 65,
            "c": 125,
            "d": 65,
            "h": 70,
            "s": 120
        },
        "id": 818,
        "types": [
            "みず"
        ]
    },
    "イーブイ": {
        "base_stats": {
            "a": 55,
            "b": 50,
            "c": 45,
            "d": 65,
            "h": 55,
            "s": 55
        },
        "id": 133,
        "types": [
            "ノーマル"
        ]
    },
    "イーユイ": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 135,
            "d": 120,
            "h": 55,
            "s": 100
        },
        "id": 1004,
        "types": [
            "あく",
            "ほのお"
        ]
    },
    "ウインディ": {
        "base_stats": {
            "a": 110,
            "b": 80,
            "c": 100,
            "d": 80,
            "h": 90,
            "s": 95
        },
        "id": 59,
        "types": [
            "ほのお"
        ]
    },
    "ウェルカモ": {
        "base_stats": {
            "a": 85,
            "b": 65,
            "c": 65,
            "d": 60,
            "h": 70,
            "s": 65
        },
        "id": 913,
        "types": [
            "みず"
        ]
    },
    "ウェーニバル": {
        "base_stats": {
            "a": 120,
            "b": 80,
            "c": 85,
            "d": 75,
            "h": 85,
            "s": 85
        },
        "id": 914,
        "types": [
            "みず",
            "かくとう"
        ]
    },
    "ウォーグル": {
        "base_stats": {
            "a": 123,
            "b": 75,
            "c": 57,
            "d": 75,
            "h": 100,
            "s": 80
        },
        "id": 628,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ウオチルドン": {
        "base_stats": {
            "a": 90,
            "b": 100,
            "c": 80,
            "d": 90,
            "h": 90,
            "s": 55
        },
        "id": 883,
        "types": [
            "みず",
            "こおり"
        ]
    },
    "ウオノラゴン": {
        "base_stats": {
            "a": 90,
            "b": 100,
            "c": 70,
            "d": 80,
            "h": 90,
            "s": 75
        },
        "id": 882,
        "types": [
            "みず",
            "ドラゴン"
        ]
    },
    "ウソッキー": {
        "base_stats": {
            "a": 100,
            "b": 115,
            "c": 30,
            "d": 65,
            "h": 70,
            "s": 30
        },
        "id": 185,
        "types": [
            "いわ"
        ]
    },
    "ウソハチ": {
        "base_stats": {
            "a": 80,
            "b": 95,
            "c": 10,
            "d": 45,
            "h": 50,
            "s": 10
        },
        "id": 438,
        "types": [
            "いわ"
        ]
    },
    "ウッウ": {
        "base_stats": {
            "a": 85,
            "b": 55,
            "c": 85,
            "d": 95,
            "h": 70,
            "s": 85
        },
        "id": 845,
        "types": [
            "ひこう",
            "みず"
        ]
    },
    "ウツドン": {
        "base_stats": {
            "a": 90,
            "b": 50,
            "c": 85,
            "d": 45,
            "h": 65,
            "s": 55
        },
        "id": 70,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ウツボット": {
        "base_stats": {
            "a": 105,
            "b": 65,
            "c": 100,
            "d": 70,
            "h": 80,
            "s": 70
        },
        "id": 71,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ウツロイド": {
        "base_stats": {
            "a": 53,
            "b": 47,
            "c": 127,
            "d": 131,
            "h": 109,
            "s": 103
        },
        "id": 793,
        "types": [
            "いわ",
            "どく"
        ]
    },
    "ウデッポウ": {
        "base_stats": {
            "a": 53,
            "b": 62,
            "c": 58,
            "d": 63,
            "h": 50,
            "s": 44
        },
        "id": 692,
        "types": [
            "みず"
        ]
    },
    "ウネルミナモ": {
        "base_stats": {
            "a": 83,
            "b": 91,
            "c": 125,
            "d": 83,
            "h": 99,
            "s": 109
        },
        "id": 1009,
        "types": [
            "みず",
            "ドラゴン"
        ]
    },
    "ウパー": {
        "base_stats": {
            "a": 45,
            "b": 45,
            "c": 25,
            "d": 25,
            "h": 55,
            "s": 15
        },
        "id": 194,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ウミディグダ": {
        "base_stats": {
            "a": 55,
            "b": 25,
            "c": 35,
            "d": 25,
            "h": 10,
            "s": 95
        },
        "id": 960,
        "types": [
            "みず"
        ]
    },
    "ウミトリオ": {
        "base_stats": {
            "a": 100,
            "b": 50,
            "c": 50,
            "d": 70,
            "h": 35,
            "s": 120
        },
        "id": 961,
        "types": [
            "みず"
        ]
    },
    "ウリムー": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 30,
            "d": 30,
            "h": 50,
            "s": 50
        },
        "id": 220,
        "types": [
            "こおり",
            "じめん"
        ]
    },
    "ウルガモス": {
        "base_stats": {
            "a": 60,
            "b": 65,
            "c": 135,
            "d": 105,
            "h": 85,
            "s": 100
        },
        "id": 637,
        "types": [
            "むし",
            "ほのお"
        ]
    },
    "ウーラオス": {
        "base_stats": {
            "a": 130,
            "b": 100,
            "c": 63,
            "d": 60,
            "h": 100,
            "s": 97
        },
        "id": 892,
        "types": [
            "かくとう",
            "あく"
        ]
    },
    "ウールー": {
        "base_stats": {
            "a": 40,
            "b": 55,
            "c": 40,
            "d": 45,
            "h": 42,
            "s": 48
        },
        "id": 831,
        "types": [
            "ノーマル"
        ]
    },
    "エアームド": {
        "base_stats": {
            "a": 80,
            "b": 140,
            "c": 40,
            "d": 70,
            "h": 65,
            "s": 70
        },
        "id": 227,
        "types": [
            "はがね",
            "ひこう"
        ]
    },
    "エイパム": {
        "base_stats": {
            "a": 70,
            "b": 55,
            "c": 40,
            "d": 55,
            "h": 55,
            "s": 85
        },
        "id": 190,
        "types": [
            "ノーマル"
        ]
    },
    "エクスレッグ": {
        "base_stats": {
            "a": 102,
            "b": 78,
            "c": 52,
            "d": 55,
            "h": 71,
            "s": 92
        },
        "id": 920,
        "types": [
            "むし",
            "あく"
        ]
    },
    "エテボース": {
        "base_stats": {
            "a": 100,
            "b": 66,
            "c": 60,
            "d": 66,
            "h": 75,
            "s": 115
        },
        "id": 424,
        "types": [
            "ノーマル"
        ]
    },
    "エネコ": {
        "base_stats": {
            "a": 45,
            "b": 45,
            "c": 35,
            "d": 35,
            "h": 50,
            "s": 50
        },
        "id": 300,
        "types": [
            "ノーマル"
        ]
    },
    "エネコロロ": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 55,
            "d": 55,
            "h": 70,
            "s": 90
        },
        "id": 301,
        "types": [
            "ノーマル"
        ]
    },
    "エビワラー": {
        "base_stats": {
            "a": 105,
            "b": 79,
            "c": 35,
            "d": 110,
            "h": 50,
            "s": 76
        },
        "id": 107,
        "types": [
            "かくとう"
        ]
    },
    "エムリット": {
        "base_stats": {
            "a": 105,
            "b": 105,
            "c": 105,
            "d": 105,
            "h": 80,
            "s": 80
        },
        "id": 481,
        "types": [
            "エスパー"
        ]
    },
    "エモンガ": {
        "base_stats": {
            "a": 75,
            "b": 60,
            "c": 75,
            "d": 60,
            "h": 55,
            "s": 103
        },
        "id": 587,
        "types": [
            "でんき",
            "ひこう"
        ]
    },
    "エリキテル": {
        "base_stats": {
            "a": 38,
            "b": 33,
            "c": 61,
            "d": 43,
            "h": 44,
            "s": 70
        },
        "id": 694,
        "types": [
            "でんき",
            "ノーマル"
        ]
    },
    "エルフーン": {
        "base_stats": {
            "a": 67,
            "b": 85,
            "c": 77,
            "d": 75,
            "h": 60,
            "s": 116
        },
        "id": 547,
        "types": [
            "くさ",
            "フェアリー"
        ]
    },
    "エルレイド": {
        "base_stats": {
            "a": 125,
            "b": 65,
            "c": 65,
            "d": 115,
            "h": 68,
            "s": 80
        },
        "id": 475,
        "types": [
            "エスパー",
            "かくとう"
        ]
    },
    "エレキッド": {
        "base_stats": {
            "a": 63,
            "b": 37,
            "c": 65,
            "d": 55,
            "h": 45,
            "s": 95
        },
        "id": 239,
        "types": [
            "でんき"
        ]
    },
    "エレキブル": {
        "base_stats": {
            "a": 123,
            "b": 67,
            "c": 95,
            "d": 85,
            "h": 75,
            "s": 95
        },
        "id": 466,
        "types": [
            "でんき"
        ]
    },
    "エレザード": {
        "base_stats": {
            "a": 55,
            "b": 52,
            "c": 109,
            "d": 94,
            "h": 62,
            "s": 109
        },
        "id": 695,
        "types": [
            "でんき",
            "ノーマル"
        ]
    },
    "エレズン": {
        "base_stats": {
            "a": 38,
            "b": 35,
            "c": 54,
            "d": 35,
            "h": 40,
            "s": 40
        },
        "id": 848,
        "types": [
            "でんき",
            "どく"
        ]
    },
    "エレブー": {
        "base_stats": {
            "a": 83,
            "b": 57,
            "c": 95,
            "d": 85,
            "h": 65,
            "s": 105
        },
        "id": 125,
        "types": [
            "でんき"
        ]
    },
    "エンテイ": {
        "base_stats": {
            "a": 115,
            "b": 85,
            "c": 90,
            "d": 75,
            "h": 115,
            "s": 100
        },
        "id": 244,
        "types": [
            "ほのお"
        ]
    },
    "エンニュート": {
        "base_stats": {
            "a": 64,
            "b": 60,
            "c": 111,
            "d": 60,
            "h": 68,
            "s": 117
        },
        "id": 758,
        "types": [
            "どく",
            "ほのお"
        ]
    },
    "エンブオー": {
        "base_stats": {
            "a": 123,
            "b": 65,
            "c": 100,
            "d": 65,
            "h": 110,
            "s": 65
        },
        "id": 500,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "エンペルト": {
        "base_stats": {
            "a": 86,
            "b": 88,
            "c": 111,
            "d": 101,
            "h": 84,
            "s": 60
        },
        "id": 395,
        "types": [
            "みず",
            "はがね"
        ]
    },
    "エースバーン": {
        "base_stats": {
            "a": 116,
            "b": 75,
            "c": 65,
            "d": 75,
            "h": 80,
            "s": 119
        },
        "id": 815,
        "types": [
            "ほのお"
        ]
    },
    "エーフィ": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 130,
            "d": 95,
            "h": 65,
            "s": 110
        },
        "id": 196,
        "types": [
            "エスパー"
        ]
    },
    "オオスバメ": {
        "base_stats": {
            "a": 85,
            "b": 60,
            "c": 75,
            "d": 50,
            "h": 60,
            "s": 125
        },
        "id": 277,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "オオタチ": {
        "base_stats": {
            "a": 76,
            "b": 64,
            "c": 45,
            "d": 55,
            "h": 85,
            "s": 90
        },
        "id": 162,
        "types": [
            "ノーマル"
        ]
    },
    "オオニューラ": {
        "base_stats": {
            "a": 130,
            "b": 60,
            "c": 40,
            "d": 80,
            "h": 80,
            "s": 120
        },
        "id": 903,
        "types": [
            "かくとう",
            "どく"
        ]
    },
    "オクタン": {
        "base_stats": {
            "a": 105,
            "b": 75,
            "c": 105,
            "d": 75,
            "h": 75,
            "s": 45
        },
        "id": 224,
        "types": [
            "みず"
        ]
    },
    "オコリザル": {
        "base_stats": {
            "a": 105,
            "b": 60,
            "c": 60,
            "d": 70,
            "h": 65,
            "s": 95
        },
        "id": 57,
        "types": [
            "かくとう"
        ]
    },
    "オシャマリ": {
        "base_stats": {
            "a": 69,
            "b": 69,
            "c": 91,
            "d": 81,
            "h": 60,
            "s": 50
        },
        "id": 729,
        "types": [
            "みず"
        ]
    },
    "オタチ": {
        "base_stats": {
            "a": 46,
            "b": 34,
            "c": 35,
            "d": 45,
            "h": 35,
            "s": 20
        },
        "id": 161,
        "types": [
            "ノーマル"
        ]
    },
    "オタマロ": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 50,
            "d": 40,
            "h": 50,
            "s": 64
        },
        "id": 535,
        "types": [
            "みず"
        ]
    },
    "オトシドリ": {
        "base_stats": {
            "a": 103,
            "b": 85,
            "c": 60,
            "d": 85,
            "h": 70,
            "s": 82
        },
        "id": 962,
        "types": [
            "ひこう",
            "あく"
        ]
    },
    "オトスパス": {
        "base_stats": {
            "a": 118,
            "b": 90,
            "c": 70,
            "d": 80,
            "h": 80,
            "s": 42
        },
        "id": 853,
        "types": [
            "かくとう"
        ]
    },
    "オドシシ": {
        "base_stats": {
            "a": 95,
            "b": 62,
            "c": 85,
            "d": 65,
            "h": 73,
            "s": 85
        },
        "id": 234,
        "types": [
            "ノーマル"
        ]
    },
    "オドリドリ": {
        "base_stats": {
            "a": 70,
            "b": 70,
            "c": 98,
            "d": 70,
            "h": 75,
            "s": 93
        },
        "id": 741,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "オニゴーリ": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 80,
            "d": 80,
            "h": 80,
            "s": 80
        },
        "id": 362,
        "types": [
            "こおり"
        ]
    },
    "オニシズクモ": {
        "base_stats": {
            "a": 70,
            "b": 92,
            "c": 50,
            "d": 132,
            "h": 68,
            "s": 42
        },
        "id": 752,
        "types": [
            "みず",
            "むし"
        ]
    },
    "オニスズメ": {
        "base_stats": {
            "a": 60,
            "b": 30,
            "c": 31,
            "d": 31,
            "h": 40,
            "s": 70
        },
        "id": 21,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "オニドリル": {
        "base_stats": {
            "a": 90,
            "b": 65,
            "c": 61,
            "d": 61,
            "h": 65,
            "s": 100
        },
        "id": 22,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "オノノクス": {
        "base_stats": {
            "a": 147,
            "b": 90,
            "c": 60,
            "d": 70,
            "h": 76,
            "s": 97
        },
        "id": 612,
        "types": [
            "ドラゴン"
        ]
    },
    "オノンド": {
        "base_stats": {
            "a": 117,
            "b": 70,
            "c": 40,
            "d": 50,
            "h": 66,
            "s": 67
        },
        "id": 611,
        "types": [
            "ドラゴン"
        ]
    },
    "オムスター": {
        "base_stats": {
            "a": 60,
            "b": 125,
            "c": 115,
            "d": 70,
            "h": 70,
            "s": 55
        },
        "id": 139,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "オムナイト": {
        "base_stats": {
            "a": 40,
            "b": 100,
            "c": 90,
            "d": 55,
            "h": 35,
            "s": 35
        },
        "id": 138,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "オラチフ": {
        "base_stats": {
            "a": 78,
            "b": 60,
            "c": 40,
            "d": 51,
            "h": 60,
            "s": 51
        },
        "id": 942,
        "types": [
            "あく"
        ]
    },
    "オリーニョ": {
        "base_stats": {
            "a": 53,
            "b": 60,
            "c": 78,
            "d": 78,
            "h": 52,
            "s": 33
        },
        "id": 929,
        "types": [
            "くさ",
            "ノーマル"
        ]
    },
    "オリーヴァ": {
        "base_stats": {
            "a": 69,
            "b": 90,
            "c": 125,
            "d": 109,
            "h": 78,
            "s": 39
        },
        "id": 930,
        "types": [
            "くさ",
            "ノーマル"
        ]
    },
    "オンバット": {
        "base_stats": {
            "a": 30,
            "b": 35,
            "c": 45,
            "d": 40,
            "h": 40,
            "s": 55
        },
        "id": 714,
        "types": [
            "ひこう",
            "ドラゴン"
        ]
    },
    "オンバーン": {
        "base_stats": {
            "a": 70,
            "b": 80,
            "c": 97,
            "d": 80,
            "h": 85,
            "s": 123
        },
        "id": 715,
        "types": [
            "ひこう",
            "ドラゴン"
        ]
    },
    "オーダイル": {
        "base_stats": {
            "a": 105,
            "b": 100,
            "c": 79,
            "d": 83,
            "h": 85,
            "s": 78
        },
        "id": 160,
        "types": [
            "みず"
        ]
    },
    "オーベム": {
        "base_stats": {
            "a": 75,
            "b": 75,
            "c": 125,
            "d": 95,
            "h": 75,
            "s": 40
        },
        "id": 606,
        "types": [
            "エスパー"
        ]
    },
    "オーロット": {
        "base_stats": {
            "a": 110,
            "b": 76,
            "c": 65,
            "d": 82,
            "h": 85,
            "s": 56
        },
        "id": 709,
        "types": [
            "ゴースト",
            "くさ"
        ]
    },
    "オーロンゲ": {
        "base_stats": {
            "a": 120,
            "b": 65,
            "c": 95,
            "d": 75,
            "h": 95,
            "s": 60
        },
        "id": 861,
        "types": [
            "あく",
            "フェアリー"
        ]
    },
    "カイオーガ": {
        "base_stats": {
            "a": 100,
            "b": 90,
            "c": 150,
            "d": 140,
            "h": 100,
            "s": 90
        },
        "id": 382,
        "types": [
            "みず"
        ]
    },
    "カイデン": {
        "base_stats": {
            "a": 40,
            "b": 35,
            "c": 55,
            "d": 40,
            "h": 40,
            "s": 70
        },
        "id": 940,
        "types": [
            "でんき",
            "ひこう"
        ]
    },
    "カイリキー": {
        "base_stats": {
            "a": 130,
            "b": 80,
            "c": 65,
            "d": 85,
            "h": 90,
            "s": 55
        },
        "id": 68,
        "types": [
            "かくとう"
        ]
    },
    "カイリュー": {
        "base_stats": {
            "a": 134,
            "b": 95,
            "c": 100,
            "d": 100,
            "h": 91,
            "s": 80
        },
        "id": 149,
        "types": [
            "ドラゴン",
            "ひこう"
        ]
    },
    "カイロス": {
        "base_stats": {
            "a": 125,
            "b": 100,
            "c": 55,
            "d": 70,
            "h": 65,
            "s": 85
        },
        "id": 127,
        "types": [
            "むし"
        ]
    },
    "カエンジシ": {
        "base_stats": {
            "a": 68,
            "b": 72,
            "c": 109,
            "d": 66,
            "h": 86,
            "s": 106
        },
        "id": 668,
        "types": [
            "ほのお",
            "ノーマル"
        ]
    },
    "カクレオン": {
        "base_stats": {
            "a": 90,
            "b": 70,
            "c": 60,
            "d": 120,
            "h": 60,
            "s": 40
        },
        "id": 352,
        "types": [
            "ノーマル"
        ]
    },
    "カゲボウズ": {
        "base_stats": {
            "a": 75,
            "b": 35,
            "c": 63,
            "d": 33,
            "h": 44,
            "s": 45
        },
        "id": 353,
        "types": [
            "ゴースト"
        ]
    },
    "カジッチュ": {
        "base_stats": {
            "a": 40,
            "b": 80,
            "c": 40,
            "d": 40,
            "h": 40,
            "s": 20
        },
        "id": 840,
        "types": [
            "くさ",
            "ドラゴン"
        ]
    },
    "カジリガメ": {
        "base_stats": {
            "a": 115,
            "b": 90,
            "c": 48,
            "d": 68,
            "h": 90,
            "s": 74
        },
        "id": 834,
        "types": [
            "みず",
            "いわ"
        ]
    },
    "カチコール": {
        "base_stats": {
            "a": 69,
            "b": 85,
            "c": 32,
            "d": 35,
            "h": 55,
            "s": 28
        },
        "id": 712,
        "types": [
            "こおり"
        ]
    },
    "カヌチャン": {
        "base_stats": {
            "a": 45,
            "b": 45,
            "c": 35,
            "d": 64,
            "h": 50,
            "s": 58
        },
        "id": 957,
        "types": [
            "フェアリー",
            "はがね"
        ]
    },
    "カバルドン": {
        "base_stats": {
            "a": 112,
            "b": 118,
            "c": 68,
            "d": 72,
            "h": 108,
            "s": 47
        },
        "id": 450,
        "types": [
            "じめん"
        ]
    },
    "カビゴン": {
        "base_stats": {
            "a": 110,
            "b": 65,
            "c": 65,
            "d": 110,
            "h": 160,
            "s": 30
        },
        "id": 143,
        "types": [
            "ノーマル"
        ]
    },
    "カブト": {
        "base_stats": {
            "a": 80,
            "b": 90,
            "c": 55,
            "d": 45,
            "h": 30,
            "s": 55
        },
        "id": 140,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "カブトプス": {
        "base_stats": {
            "a": 115,
            "b": 105,
            "c": 65,
            "d": 70,
            "h": 60,
            "s": 80
        },
        "id": 141,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "カブルモ": {
        "base_stats": {
            "a": 75,
            "b": 45,
            "c": 40,
            "d": 45,
            "h": 50,
            "s": 60
        },
        "id": 588,
        "types": [
            "むし"
        ]
    },
    "カプサイジ": {
        "base_stats": {
            "a": 62,
            "b": 40,
            "c": 62,
            "d": 40,
            "h": 50,
            "s": 50
        },
        "id": 951,
        "types": [
            "くさ"
        ]
    },
    "カプ・コケコ": {
        "base_stats": {
            "a": 115,
            "b": 85,
            "c": 95,
            "d": 75,
            "h": 70,
            "s": 130
        },
        "id": 785,
        "types": [
            "でんき",
            "フェアリー"
        ]
    },
    "カプ・テテフ": {
        "base_stats": {
            "a": 85,
            "b": 75,
            "c": 130,
            "d": 115,
            "h": 70,
            "s": 95
        },
        "id": 786,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "カプ・ブルル": {
        "base_stats": {
            "a": 130,
            "b": 115,
            "c": 85,
            "d": 95,
            "h": 70,
            "s": 75
        },
        "id": 787,
        "types": [
            "くさ",
            "フェアリー"
        ]
    },
    "カプ・レヒレ": {
        "base_stats": {
            "a": 75,
            "b": 115,
            "c": 95,
            "d": 130,
            "h": 70,
            "s": 85
        },
        "id": 788,
        "types": [
            "みず",
            "フェアリー"
        ]
    },
    "カポエラー": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 35,
            "d": 110,
            "h": 50,
            "s": 70
        },
        "id": 237,
        "types": [
            "かくとう"
        ]
    },
    "カマスジョー": {
        "base_stats": {
            "a": 123,
            "b": 60,
            "c": 60,
            "d": 50,
            "h": 61,
            "s": 136
        },
        "id": 847,
        "types": [
            "みず"
        ]
    },
    "カミツルギ": {
        "base_stats": {
            "a": 181,
            "b": 131,
            "c": 59,
            "d": 31,
            "h": 59,
            "s": 109
        },
        "id": 798,
        "types": [
            "くさ",
            "はがね"
        ]
    },
    "カムカメ": {
        "base_stats": {
            "a": 64,
            "b": 50,
            "c": 38,
            "d": 38,
            "h": 50,
            "s": 44
        },
        "id": 833,
        "types": [
            "みず"
        ]
    },
    "カメックス": {
        "base_stats": {
            "a": 83,
            "b": 100,
            "c": 85,
            "d": 105,
            "h": 79,
            "s": 78
        },
        "id": 9,
        "types": [
            "みず"
        ]
    },
    "カメテテ": {
        "base_stats": {
            "a": 52,
            "b": 67,
            "c": 39,
            "d": 56,
            "h": 42,
            "s": 50
        },
        "id": 688,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "カメール": {
        "base_stats": {
            "a": 63,
            "b": 80,
            "c": 65,
            "d": 80,
            "h": 59,
            "s": 58
        },
        "id": 8,
        "types": [
            "みず"
        ]
    },
    "カモネギ": {
        "base_stats": {
            "a": 90,
            "b": 55,
            "c": 58,
            "d": 62,
            "h": 52,
            "s": 60
        },
        "id": 83,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "カラカラ": {
        "base_stats": {
            "a": 50,
            "b": 95,
            "c": 40,
            "d": 50,
            "h": 50,
            "s": 35
        },
        "id": 104,
        "types": [
            "じめん"
        ]
    },
    "カラサリス": {
        "base_stats": {
            "a": 35,
            "b": 55,
            "c": 25,
            "d": 25,
            "h": 50,
            "s": 15
        },
        "id": 266,
        "types": [
            "むし"
        ]
    },
    "カラナクシ": {
        "base_stats": {
            "a": 48,
            "b": 48,
            "c": 57,
            "d": 62,
            "h": 76,
            "s": 34
        },
        "id": 422,
        "types": [
            "みず"
        ]
    },
    "カラマネロ": {
        "base_stats": {
            "a": 92,
            "b": 88,
            "c": 68,
            "d": 75,
            "h": 86,
            "s": 73
        },
        "id": 687,
        "types": [
            "あく",
            "エスパー"
        ]
    },
    "カラミンゴ": {
        "base_stats": {
            "a": 115,
            "b": 74,
            "c": 75,
            "d": 64,
            "h": 82,
            "s": 90
        },
        "id": 973,
        "types": [
            "ひこう",
            "かくとう"
        ]
    },
    "カリキリ": {
        "base_stats": {
            "a": 55,
            "b": 35,
            "c": 50,
            "d": 35,
            "h": 40,
            "s": 35
        },
        "id": 753,
        "types": [
            "くさ"
        ]
    },
    "カルボウ": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 50,
            "d": 40,
            "h": 40,
            "s": 35
        },
        "id": 935,
        "types": [
            "ほのお"
        ]
    },
    "ガオガエン": {
        "base_stats": {
            "a": 115,
            "b": 90,
            "c": 80,
            "d": 90,
            "h": 95,
            "s": 60
        },
        "id": 727,
        "types": [
            "ほのお",
            "あく"
        ]
    },
    "ガケガニ": {
        "base_stats": {
            "a": 100,
            "b": 115,
            "c": 35,
            "d": 55,
            "h": 70,
            "s": 75
        },
        "id": 950,
        "types": [
            "いわ"
        ]
    },
    "ガチグマ": {
        "base_stats": {
            "a": 140,
            "b": 105,
            "c": 45,
            "d": 80,
            "h": 130,
            "s": 50
        },
        "id": 901,
        "types": [
            "じめん",
            "ノーマル"
        ]
    },
    "ガチゴラス": {
        "base_stats": {
            "a": 121,
            "b": 119,
            "c": 69,
            "d": 59,
            "h": 82,
            "s": 71
        },
        "id": 697,
        "types": [
            "いわ",
            "ドラゴン"
        ]
    },
    "ガバイト": {
        "base_stats": {
            "a": 90,
            "b": 65,
            "c": 50,
            "d": 55,
            "h": 68,
            "s": 82
        },
        "id": 444,
        "types": [
            "ドラゴン",
            "じめん"
        ]
    },
    "ガブリアス": {
        "base_stats": {
            "a": 130,
            "b": 95,
            "c": 80,
            "d": 85,
            "h": 108,
            "s": 102
        },
        "id": 445,
        "types": [
            "ドラゴン",
            "じめん"
        ]
    },
    "ガマガル": {
        "base_stats": {
            "a": 65,
            "b": 55,
            "c": 65,
            "d": 55,
            "h": 75,
            "s": 69
        },
        "id": 536,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ガマゲロゲ": {
        "base_stats": {
            "a": 95,
            "b": 75,
            "c": 85,
            "d": 75,
            "h": 105,
            "s": 74
        },
        "id": 537,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ガメノデス": {
        "base_stats": {
            "a": 105,
            "b": 115,
            "c": 54,
            "d": 86,
            "h": 72,
            "s": 68
        },
        "id": 689,
        "types": [
            "いわ",
            "みず"
        ]
    },
    "ガラガラ": {
        "base_stats": {
            "a": 80,
            "b": 110,
            "c": 50,
            "d": 80,
            "h": 60,
            "s": 45
        },
        "id": 105,
        "types": [
            "じめん"
        ]
    },
    "ガルーラ": {
        "base_stats": {
            "a": 95,
            "b": 80,
            "c": 40,
            "d": 80,
            "h": 105,
            "s": 90
        },
        "id": 115,
        "types": [
            "ノーマル"
        ]
    },
    "ガントル": {
        "base_stats": {
            "a": 105,
            "b": 105,
            "c": 50,
            "d": 40,
            "h": 70,
            "s": 20
        },
        "id": 525,
        "types": [
            "いわ"
        ]
    },
    "ガーディ": {
        "base_stats": {
            "a": 70,
            "b": 45,
            "c": 70,
            "d": 50,
            "h": 55,
            "s": 60
        },
        "id": 58,
        "types": [
            "ほのお"
        ]
    },
    "ガーメイル": {
        "base_stats": {
            "a": 94,
            "b": 50,
            "c": 94,
            "d": 50,
            "h": 70,
            "s": 66
        },
        "id": 414,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "キテルグマ": {
        "base_stats": {
            "a": 125,
            "b": 80,
            "c": 55,
            "d": 60,
            "h": 120,
            "s": 60
        },
        "id": 760,
        "types": [
            "ノーマル",
            "かくとう"
        ]
    },
    "キノガッサ": {
        "base_stats": {
            "a": 130,
            "b": 80,
            "c": 60,
            "d": 60,
            "h": 60,
            "s": 70
        },
        "id": 286,
        "types": [
            "くさ",
            "かくとう"
        ]
    },
    "キノココ": {
        "base_stats": {
            "a": 40,
            "b": 60,
            "c": 40,
            "d": 60,
            "h": 60,
            "s": 35
        },
        "id": 285,
        "types": [
            "くさ"
        ]
    },
    "キバゴ": {
        "base_stats": {
            "a": 87,
            "b": 60,
            "c": 30,
            "d": 40,
            "h": 46,
            "s": 57
        },
        "id": 610,
        "types": [
            "ドラゴン"
        ]
    },
    "キバニア": {
        "base_stats": {
            "a": 90,
            "b": 20,
            "c": 65,
            "d": 20,
            "h": 45,
            "s": 65
        },
        "id": 318,
        "types": [
            "みず",
            "あく"
        ]
    },
    "キマワリ": {
        "base_stats": {
            "a": 75,
            "b": 55,
            "c": 105,
            "d": 85,
            "h": 75,
            "s": 30
        },
        "id": 192,
        "types": [
            "くさ"
        ]
    },
    "キモリ": {
        "base_stats": {
            "a": 45,
            "b": 35,
            "c": 65,
            "d": 55,
            "h": 40,
            "s": 70
        },
        "id": 252,
        "types": [
            "くさ"
        ]
    },
    "キャタピー": {
        "base_stats": {
            "a": 30,
            "b": 35,
            "c": 20,
            "d": 20,
            "h": 45,
            "s": 45
        },
        "id": 10,
        "types": [
            "むし"
        ]
    },
    "キャモメ": {
        "base_stats": {
            "a": 30,
            "b": 30,
            "c": 55,
            "d": 30,
            "h": 40,
            "s": 85
        },
        "id": 278,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "キュウコン": {
        "base_stats": {
            "a": 76,
            "b": 75,
            "c": 81,
            "d": 100,
            "h": 73,
            "s": 100
        },
        "id": 38,
        "types": [
            "ほのお"
        ]
    },
    "キュレム": {
        "base_stats": {
            "a": 130,
            "b": 90,
            "c": 130,
            "d": 90,
            "h": 125,
            "s": 95
        },
        "id": 646,
        "types": [
            "ドラゴン",
            "こおり"
        ]
    },
    "キュワワー": {
        "base_stats": {
            "a": 52,
            "b": 90,
            "c": 82,
            "d": 110,
            "h": 51,
            "s": 100
        },
        "id": 764,
        "types": [
            "フェアリー"
        ]
    },
    "キョジオーン": {
        "base_stats": {
            "a": 100,
            "b": 130,
            "c": 45,
            "d": 90,
            "h": 100,
            "s": 35
        },
        "id": 934,
        "types": [
            "いわ"
        ]
    },
    "キラフロル": {
        "base_stats": {
            "a": 55,
            "b": 90,
            "c": 130,
            "d": 81,
            "h": 83,
            "s": 86
        },
        "id": 970,
        "types": [
            "いわ",
            "どく"
        ]
    },
    "キラーメ": {
        "base_stats": {
            "a": 35,
            "b": 42,
            "c": 105,
            "d": 60,
            "h": 48,
            "s": 60
        },
        "id": 969,
        "types": [
            "いわ",
            "どく"
        ]
    },
    "キリキザン": {
        "base_stats": {
            "a": 125,
            "b": 100,
            "c": 60,
            "d": 70,
            "h": 65,
            "s": 70
        },
        "id": 625,
        "types": [
            "あく",
            "はがね"
        ]
    },
    "キリンリキ": {
        "base_stats": {
            "a": 80,
            "b": 65,
            "c": 90,
            "d": 65,
            "h": 70,
            "s": 85
        },
        "id": 203,
        "types": [
            "ノーマル",
            "エスパー"
        ]
    },
    "キルリア": {
        "base_stats": {
            "a": 35,
            "b": 35,
            "c": 65,
            "d": 55,
            "h": 38,
            "s": 50
        },
        "id": 281,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "キレイハナ": {
        "base_stats": {
            "a": 80,
            "b": 95,
            "c": 90,
            "d": 100,
            "h": 75,
            "s": 50
        },
        "id": 182,
        "types": [
            "くさ"
        ]
    },
    "キングドラ": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 95,
            "d": 95,
            "h": 75,
            "s": 85
        },
        "id": 230,
        "types": [
            "みず",
            "ドラゴン"
        ]
    },
    "キングラー": {
        "base_stats": {
            "a": 130,
            "b": 115,
            "c": 50,
            "d": 50,
            "h": 55,
            "s": 75
        },
        "id": 99,
        "types": [
            "みず"
        ]
    },
    "ギアル": {
        "base_stats": {
            "a": 55,
            "b": 70,
            "c": 45,
            "d": 60,
            "h": 40,
            "s": 30
        },
        "id": 599,
        "types": [
            "はがね"
        ]
    },
    "ギガイアス": {
        "base_stats": {
            "a": 135,
            "b": 130,
            "c": 60,
            "d": 80,
            "h": 85,
            "s": 25
        },
        "id": 526,
        "types": [
            "いわ"
        ]
    },
    "ギギアル": {
        "base_stats": {
            "a": 80,
            "b": 95,
            "c": 70,
            "d": 85,
            "h": 60,
            "s": 50
        },
        "id": 600,
        "types": [
            "はがね"
        ]
    },
    "ギギギアル": {
        "base_stats": {
            "a": 100,
            "b": 115,
            "c": 70,
            "d": 85,
            "h": 60,
            "s": 90
        },
        "id": 601,
        "types": [
            "はがね"
        ]
    },
    "ギモー": {
        "base_stats": {
            "a": 60,
            "b": 45,
            "c": 75,
            "d": 55,
            "h": 65,
            "s": 70
        },
        "id": 860,
        "types": [
            "あく",
            "フェアリー"
        ]
    },
    "ギャラドス": {
        "base_stats": {
            "a": 125,
            "b": 79,
            "c": 60,
            "d": 100,
            "h": 95,
            "s": 81
        },
        "id": 130,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "ギャロップ": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 80,
            "d": 80,
            "h": 65,
            "s": 105
        },
        "id": 78,
        "types": [
            "ほのお"
        ]
    },
    "ギラティナ": {
        "base_stats": {
            "a": 100,
            "b": 120,
            "c": 100,
            "d": 120,
            "h": 150,
            "s": 90
        },
        "id": 487,
        "types": [
            "ゴースト",
            "ドラゴン"
        ]
    },
    "ギルガルド": {
        "base_stats": {
            "a": 50,
            "b": 140,
            "c": 50,
            "d": 140,
            "h": 60,
            "s": 60
        },
        "id": 681,
        "types": [
            "はがね",
            "ゴースト"
        ]
    },
    "クイタラン": {
        "base_stats": {
            "a": 97,
            "b": 66,
            "c": 105,
            "d": 66,
            "h": 85,
            "s": 65
        },
        "id": 631,
        "types": [
            "ほのお"
        ]
    },
    "クエスパトラ": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 101,
            "d": 60,
            "h": 95,
            "s": 105
        },
        "id": 956,
        "types": [
            "エスパー"
        ]
    },
    "クサイハナ": {
        "base_stats": {
            "a": 65,
            "b": 70,
            "c": 85,
            "d": 75,
            "h": 60,
            "s": 40
        },
        "id": 44,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "クスネ": {
        "base_stats": {
            "a": 28,
            "b": 28,
            "c": 47,
            "d": 52,
            "h": 40,
            "s": 50
        },
        "id": 827,
        "types": [
            "あく"
        ]
    },
    "クズモー": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 60,
            "d": 60,
            "h": 50,
            "s": 30
        },
        "id": 690,
        "types": [
            "どく",
            "みず"
        ]
    },
    "クチート": {
        "base_stats": {
            "a": 85,
            "b": 85,
            "c": 55,
            "d": 55,
            "h": 50,
            "s": 50
        },
        "id": 303,
        "types": [
            "はがね",
            "フェアリー"
        ]
    },
    "クヌギダマ": {
        "base_stats": {
            "a": 65,
            "b": 90,
            "c": 35,
            "d": 35,
            "h": 50,
            "s": 15
        },
        "id": 204,
        "types": [
            "むし"
        ]
    },
    "クマシュン": {
        "base_stats": {
            "a": 70,
            "b": 40,
            "c": 60,
            "d": 40,
            "h": 55,
            "s": 40
        },
        "id": 613,
        "types": [
            "こおり"
        ]
    },
    "クラブ": {
        "base_stats": {
            "a": 105,
            "b": 90,
            "c": 25,
            "d": 25,
            "h": 30,
            "s": 50
        },
        "id": 98,
        "types": [
            "みず"
        ]
    },
    "クリムガン": {
        "base_stats": {
            "a": 120,
            "b": 90,
            "c": 60,
            "d": 90,
            "h": 77,
            "s": 48
        },
        "id": 621,
        "types": [
            "ドラゴン"
        ]
    },
    "クルマユ": {
        "base_stats": {
            "a": 63,
            "b": 90,
            "c": 50,
            "d": 80,
            "h": 55,
            "s": 42
        },
        "id": 541,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "クルミル": {
        "base_stats": {
            "a": 53,
            "b": 70,
            "c": 40,
            "d": 60,
            "h": 45,
            "s": 42
        },
        "id": 540,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "クレセリア": {
        "base_stats": {
            "a": 70,
            "b": 110,
            "c": 75,
            "d": 120,
            "h": 120,
            "s": 85
        },
        "id": 488,
        "types": [
            "エスパー"
        ]
    },
    "クレッフィ": {
        "base_stats": {
            "a": 80,
            "b": 91,
            "c": 80,
            "d": 87,
            "h": 57,
            "s": 75
        },
        "id": 707,
        "types": [
            "はがね",
            "フェアリー"
        ]
    },
    "クレベース": {
        "base_stats": {
            "a": 117,
            "b": 184,
            "c": 44,
            "d": 46,
            "h": 95,
            "s": 28
        },
        "id": 713,
        "types": [
            "こおり"
        ]
    },
    "クロバット": {
        "base_stats": {
            "a": 90,
            "b": 80,
            "c": 70,
            "d": 80,
            "h": 85,
            "s": 130
        },
        "id": 169,
        "types": [
            "どく",
            "ひこう"
        ]
    },
    "クワガノン": {
        "base_stats": {
            "a": 70,
            "b": 90,
            "c": 145,
            "d": 75,
            "h": 77,
            "s": 43
        },
        "id": 738,
        "types": [
            "むし",
            "でんき"
        ]
    },
    "クワッス": {
        "base_stats": {
            "a": 65,
            "b": 45,
            "c": 50,
            "d": 45,
            "h": 55,
            "s": 50
        },
        "id": 912,
        "types": [
            "みず"
        ]
    },
    "グソクムシャ": {
        "base_stats": {
            "a": 125,
            "b": 140,
            "c": 60,
            "d": 90,
            "h": 75,
            "s": 40
        },
        "id": 768,
        "types": [
            "むし",
            "みず"
        ]
    },
    "グライオン": {
        "base_stats": {
            "a": 95,
            "b": 125,
            "c": 45,
            "d": 75,
            "h": 75,
            "s": 95
        },
        "id": 472,
        "types": [
            "じめん",
            "ひこう"
        ]
    },
    "グライガー": {
        "base_stats": {
            "a": 75,
            "b": 105,
            "c": 35,
            "d": 65,
            "h": 65,
            "s": 85
        },
        "id": 207,
        "types": [
            "じめん",
            "ひこう"
        ]
    },
    "グラエナ": {
        "base_stats": {
            "a": 90,
            "b": 70,
            "c": 60,
            "d": 60,
            "h": 70,
            "s": 70
        },
        "id": 262,
        "types": [
            "あく"
        ]
    },
    "グランブル": {
        "base_stats": {
            "a": 120,
            "b": 75,
            "c": 60,
            "d": 60,
            "h": 90,
            "s": 45
        },
        "id": 210,
        "types": [
            "フェアリー"
        ]
    },
    "グラードン": {
        "base_stats": {
            "a": 150,
            "b": 140,
            "c": 100,
            "d": 90,
            "h": 100,
            "s": 90
        },
        "id": 383,
        "types": [
            "じめん"
        ]
    },
    "グルトン": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 35,
            "d": 45,
            "h": 54,
            "s": 35
        },
        "id": 915,
        "types": [
            "ノーマル"
        ]
    },
    "グレイシア": {
        "base_stats": {
            "a": 60,
            "b": 110,
            "c": 130,
            "d": 95,
            "h": 65,
            "s": 65
        },
        "id": 471,
        "types": [
            "こおり"
        ]
    },
    "グレッグル": {
        "base_stats": {
            "a": 61,
            "b": 40,
            "c": 61,
            "d": 40,
            "h": 48,
            "s": 50
        },
        "id": 453,
        "types": [
            "どく",
            "かくとう"
        ]
    },
    "グレンアルマ": {
        "base_stats": {
            "a": 60,
            "b": 100,
            "c": 125,
            "d": 80,
            "h": 85,
            "s": 75
        },
        "id": 936,
        "types": [
            "ほのお",
            "エスパー"
        ]
    },
    "ケイコウオ": {
        "base_stats": {
            "a": 49,
            "b": 56,
            "c": 49,
            "d": 61,
            "h": 49,
            "s": 66
        },
        "id": 456,
        "types": [
            "みず"
        ]
    },
    "ケケンカニ": {
        "base_stats": {
            "a": 132,
            "b": 77,
            "c": 62,
            "d": 67,
            "h": 97,
            "s": 43
        },
        "id": 740,
        "types": [
            "かくとう",
            "こおり"
        ]
    },
    "ケッキング": {
        "base_stats": {
            "a": 160,
            "b": 100,
            "c": 95,
            "d": 65,
            "h": 150,
            "s": 100
        },
        "id": 289,
        "types": [
            "ノーマル"
        ]
    },
    "ケムッソ": {
        "base_stats": {
            "a": 45,
            "b": 35,
            "c": 20,
            "d": 30,
            "h": 45,
            "s": 20
        },
        "id": 265,
        "types": [
            "むし"
        ]
    },
    "ケララッパ": {
        "base_stats": {
            "a": 85,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 55,
            "s": 75
        },
        "id": 732,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ケルディオ": {
        "base_stats": {
            "a": 72,
            "b": 90,
            "c": 129,
            "d": 90,
            "h": 91,
            "s": 108
        },
        "id": 647,
        "types": [
            "みず",
            "かくとう"
        ]
    },
    "ケロマツ": {
        "base_stats": {
            "a": 56,
            "b": 40,
            "c": 62,
            "d": 44,
            "h": 41,
            "s": 71
        },
        "id": 656,
        "types": [
            "みず"
        ]
    },
    "ケンタロス": {
        "base_stats": {
            "a": 100,
            "b": 95,
            "c": 40,
            "d": 70,
            "h": 75,
            "s": 110
        },
        "id": 128,
        "types": [
            "ノーマル"
        ]
    },
    "ケンホロウ": {
        "base_stats": {
            "a": 115,
            "b": 80,
            "c": 65,
            "d": 55,
            "h": 80,
            "s": 93
        },
        "id": 521,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ケーシィ": {
        "base_stats": {
            "a": 20,
            "b": 15,
            "c": 105,
            "d": 55,
            "h": 25,
            "s": 90
        },
        "id": 63,
        "types": [
            "エスパー"
        ]
    },
    "ゲコガシラ": {
        "base_stats": {
            "a": 63,
            "b": 52,
            "c": 83,
            "d": 56,
            "h": 54,
            "s": 97
        },
        "id": 657,
        "types": [
            "みず"
        ]
    },
    "ゲッコウガ": {
        "base_stats": {
            "a": 95,
            "b": 67,
            "c": 103,
            "d": 71,
            "h": 72,
            "s": 122
        },
        "id": 658,
        "types": [
            "みず",
            "あく"
        ]
    },
    "ゲノセクト": {
        "base_stats": {
            "a": 120,
            "b": 95,
            "c": 120,
            "d": 95,
            "h": 71,
            "s": 99
        },
        "id": 649,
        "types": [
            "むし",
            "はがね"
        ]
    },
    "ゲンガー": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 130,
            "d": 75,
            "h": 60,
            "s": 110
        },
        "id": 94,
        "types": [
            "ゴースト",
            "どく"
        ]
    },
    "コアルヒー": {
        "base_stats": {
            "a": 44,
            "b": 50,
            "c": 44,
            "d": 50,
            "h": 62,
            "s": 55
        },
        "id": 580,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "コイキング": {
        "base_stats": {
            "a": 10,
            "b": 55,
            "c": 15,
            "d": 20,
            "h": 20,
            "s": 80
        },
        "id": 129,
        "types": [
            "みず"
        ]
    },
    "コイル": {
        "base_stats": {
            "a": 35,
            "b": 70,
            "c": 95,
            "d": 55,
            "h": 25,
            "s": 45
        },
        "id": 81,
        "types": [
            "でんき",
            "はがね"
        ]
    },
    "コオリッポ": {
        "base_stats": {
            "a": 80,
            "b": 110,
            "c": 65,
            "d": 90,
            "h": 75,
            "s": 50
        },
        "id": 875,
        "types": [
            "こおり"
        ]
    },
    "コクーン": {
        "base_stats": {
            "a": 25,
            "b": 50,
            "c": 25,
            "d": 25,
            "h": 45,
            "s": 35
        },
        "id": 14,
        "types": [
            "むし",
            "どく"
        ]
    },
    "ココガラ": {
        "base_stats": {
            "a": 47,
            "b": 35,
            "c": 33,
            "d": 35,
            "h": 38,
            "s": 57
        },
        "id": 821,
        "types": [
            "ひこう"
        ]
    },
    "ココドラ": {
        "base_stats": {
            "a": 70,
            "b": 100,
            "c": 40,
            "d": 40,
            "h": 50,
            "s": 30
        },
        "id": 304,
        "types": [
            "はがね",
            "いわ"
        ]
    },
    "ココロモリ": {
        "base_stats": {
            "a": 57,
            "b": 55,
            "c": 77,
            "d": 55,
            "h": 67,
            "s": 114
        },
        "id": 528,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "コジオ": {
        "base_stats": {
            "a": 55,
            "b": 75,
            "c": 35,
            "d": 35,
            "h": 55,
            "s": 25
        },
        "id": 932,
        "types": [
            "いわ"
        ]
    },
    "コジョフー": {
        "base_stats": {
            "a": 85,
            "b": 50,
            "c": 55,
            "d": 50,
            "h": 45,
            "s": 65
        },
        "id": 619,
        "types": [
            "かくとう"
        ]
    },
    "コジョンド": {
        "base_stats": {
            "a": 125,
            "b": 60,
            "c": 95,
            "d": 60,
            "h": 65,
            "s": 105
        },
        "id": 620,
        "types": [
            "かくとう"
        ]
    },
    "コスモウム": {
        "base_stats": {
            "a": 29,
            "b": 131,
            "c": 29,
            "d": 131,
            "h": 43,
            "s": 37
        },
        "id": 790,
        "types": [
            "エスパー"
        ]
    },
    "コスモッグ": {
        "base_stats": {
            "a": 29,
            "b": 31,
            "c": 29,
            "d": 31,
            "h": 43,
            "s": 37
        },
        "id": 789,
        "types": [
            "エスパー"
        ]
    },
    "コソクムシ": {
        "base_stats": {
            "a": 35,
            "b": 40,
            "c": 20,
            "d": 30,
            "h": 25,
            "s": 80
        },
        "id": 767,
        "types": [
            "むし",
            "みず"
        ]
    },
    "コダック": {
        "base_stats": {
            "a": 52,
            "b": 48,
            "c": 65,
            "d": 50,
            "h": 50,
            "s": 55
        },
        "id": 54,
        "types": [
            "みず"
        ]
    },
    "コドラ": {
        "base_stats": {
            "a": 90,
            "b": 140,
            "c": 50,
            "d": 50,
            "h": 60,
            "s": 40
        },
        "id": 305,
        "types": [
            "はがね",
            "いわ"
        ]
    },
    "コノハナ": {
        "base_stats": {
            "a": 70,
            "b": 40,
            "c": 60,
            "d": 40,
            "h": 70,
            "s": 60
        },
        "id": 274,
        "types": [
            "くさ",
            "あく"
        ]
    },
    "コノヨザル": {
        "base_stats": {
            "a": 115,
            "b": 80,
            "c": 50,
            "d": 90,
            "h": 110,
            "s": 90
        },
        "id": 979,
        "types": [
            "かくとう",
            "ゴースト"
        ]
    },
    "コバルオン": {
        "base_stats": {
            "a": 90,
            "b": 129,
            "c": 90,
            "d": 72,
            "h": 91,
            "s": 108
        },
        "id": 638,
        "types": [
            "はがね",
            "かくとう"
        ]
    },
    "コフキムシ": {
        "base_stats": {
            "a": 35,
            "b": 40,
            "c": 27,
            "d": 25,
            "h": 38,
            "s": 35
        },
        "id": 664,
        "types": [
            "むし"
        ]
    },
    "コフーライ": {
        "base_stats": {
            "a": 22,
            "b": 60,
            "c": 27,
            "d": 30,
            "h": 45,
            "s": 29
        },
        "id": 665,
        "types": [
            "むし"
        ]
    },
    "コマタナ": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 40,
            "d": 40,
            "h": 45,
            "s": 60
        },
        "id": 624,
        "types": [
            "あく",
            "はがね"
        ]
    },
    "コモルー": {
        "base_stats": {
            "a": 95,
            "b": 100,
            "c": 60,
            "d": 50,
            "h": 65,
            "s": 50
        },
        "id": 372,
        "types": [
            "ドラゴン"
        ]
    },
    "コライドン": {
        "base_stats": {
            "a": 135,
            "b": 115,
            "c": 85,
            "d": 100,
            "h": 100,
            "s": 135
        },
        "id": 1007,
        "types": [
            "かくとう",
            "ドラゴン"
        ]
    },
    "コラッタ": {
        "base_stats": {
            "a": 56,
            "b": 35,
            "c": 25,
            "d": 35,
            "h": 30,
            "s": 72
        },
        "id": 19,
        "types": [
            "ノーマル"
        ]
    },
    "コリンク": {
        "base_stats": {
            "a": 65,
            "b": 34,
            "c": 40,
            "d": 34,
            "h": 45,
            "s": 45
        },
        "id": 403,
        "types": [
            "でんき"
        ]
    },
    "コレクレー": {
        "base_stats": {
            "a": 30,
            "b": 70,
            "c": 75,
            "d": 70,
            "h": 45,
            "s": 10
        },
        "id": 999,
        "types": [
            "ゴースト"
        ]
    },
    "コロトック": {
        "base_stats": {
            "a": 85,
            "b": 51,
            "c": 55,
            "d": 51,
            "h": 77,
            "s": 65
        },
        "id": 402,
        "types": [
            "むし"
        ]
    },
    "コロボーシ": {
        "base_stats": {
            "a": 25,
            "b": 41,
            "c": 25,
            "d": 41,
            "h": 37,
            "s": 25
        },
        "id": 401,
        "types": [
            "むし"
        ]
    },
    "コロモリ": {
        "base_stats": {
            "a": 45,
            "b": 43,
            "c": 55,
            "d": 43,
            "h": 65,
            "s": 72
        },
        "id": 527,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "コンパン": {
        "base_stats": {
            "a": 55,
            "b": 50,
            "c": 40,
            "d": 55,
            "h": 60,
            "s": 45
        },
        "id": 48,
        "types": [
            "むし",
            "どく"
        ]
    },
    "コータス": {
        "base_stats": {
            "a": 85,
            "b": 140,
            "c": 85,
            "d": 70,
            "h": 70,
            "s": 20
        },
        "id": 324,
        "types": [
            "ほのお"
        ]
    },
    "ゴウカザル": {
        "base_stats": {
            "a": 104,
            "b": 71,
            "c": 104,
            "d": 71,
            "h": 76,
            "s": 108
        },
        "id": 392,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "ゴクリン": {
        "base_stats": {
            "a": 43,
            "b": 53,
            "c": 43,
            "d": 53,
            "h": 70,
            "s": 40
        },
        "id": 316,
        "types": [
            "どく"
        ]
    },
    "ゴチミル": {
        "base_stats": {
            "a": 45,
            "b": 70,
            "c": 75,
            "d": 85,
            "h": 60,
            "s": 55
        },
        "id": 575,
        "types": [
            "エスパー"
        ]
    },
    "ゴチム": {
        "base_stats": {
            "a": 30,
            "b": 50,
            "c": 55,
            "d": 65,
            "h": 45,
            "s": 45
        },
        "id": 574,
        "types": [
            "エスパー"
        ]
    },
    "ゴチルゼル": {
        "base_stats": {
            "a": 55,
            "b": 95,
            "c": 95,
            "d": 110,
            "h": 70,
            "s": 65
        },
        "id": 576,
        "types": [
            "エスパー"
        ]
    },
    "ゴニョニョ": {
        "base_stats": {
            "a": 51,
            "b": 23,
            "c": 51,
            "d": 23,
            "h": 64,
            "s": 28
        },
        "id": 293,
        "types": [
            "ノーマル"
        ]
    },
    "ゴビット": {
        "base_stats": {
            "a": 74,
            "b": 50,
            "c": 35,
            "d": 50,
            "h": 59,
            "s": 35
        },
        "id": 622,
        "types": [
            "じめん",
            "ゴースト"
        ]
    },
    "ゴマゾウ": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 40,
            "d": 40,
            "h": 90,
            "s": 40
        },
        "id": 231,
        "types": [
            "じめん"
        ]
    },
    "ゴリランダー": {
        "base_stats": {
            "a": 125,
            "b": 90,
            "c": 60,
            "d": 70,
            "h": 100,
            "s": 85
        },
        "id": 812,
        "types": [
            "くさ"
        ]
    },
    "ゴルダック": {
        "base_stats": {
            "a": 82,
            "b": 78,
            "c": 95,
            "d": 80,
            "h": 80,
            "s": 85
        },
        "id": 55,
        "types": [
            "みず"
        ]
    },
    "ゴルバット": {
        "base_stats": {
            "a": 80,
            "b": 70,
            "c": 65,
            "d": 75,
            "h": 75,
            "s": 90
        },
        "id": 42,
        "types": [
            "どく",
            "ひこう"
        ]
    },
    "ゴルーグ": {
        "base_stats": {
            "a": 124,
            "b": 80,
            "c": 55,
            "d": 80,
            "h": 89,
            "s": 55
        },
        "id": 623,
        "types": [
            "じめん",
            "ゴースト"
        ]
    },
    "ゴロンダ": {
        "base_stats": {
            "a": 124,
            "b": 78,
            "c": 69,
            "d": 71,
            "h": 95,
            "s": 58
        },
        "id": 675,
        "types": [
            "かくとう",
            "あく"
        ]
    },
    "ゴローニャ": {
        "base_stats": {
            "a": 120,
            "b": 130,
            "c": 55,
            "d": 65,
            "h": 80,
            "s": 45
        },
        "id": 76,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "ゴローン": {
        "base_stats": {
            "a": 95,
            "b": 115,
            "c": 45,
            "d": 45,
            "h": 55,
            "s": 35
        },
        "id": 75,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "ゴンベ": {
        "base_stats": {
            "a": 85,
            "b": 40,
            "c": 40,
            "d": 85,
            "h": 135,
            "s": 5
        },
        "id": 446,
        "types": [
            "ノーマル"
        ]
    },
    "ゴーゴート": {
        "base_stats": {
            "a": 100,
            "b": 62,
            "c": 97,
            "d": 81,
            "h": 123,
            "s": 68
        },
        "id": 673,
        "types": [
            "くさ"
        ]
    },
    "ゴース": {
        "base_stats": {
            "a": 35,
            "b": 30,
            "c": 100,
            "d": 35,
            "h": 30,
            "s": 80
        },
        "id": 92,
        "types": [
            "ゴースト",
            "どく"
        ]
    },
    "ゴースト": {
        "base_stats": {
            "a": 50,
            "b": 45,
            "c": 115,
            "d": 55,
            "h": 45,
            "s": 95
        },
        "id": 93,
        "types": [
            "ゴースト",
            "どく"
        ]
    },
    "ゴーリキー": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 50,
            "d": 60,
            "h": 80,
            "s": 45
        },
        "id": 67,
        "types": [
            "かくとう"
        ]
    },
    "サイドン": {
        "base_stats": {
            "a": 130,
            "b": 120,
            "c": 45,
            "d": 45,
            "h": 105,
            "s": 40
        },
        "id": 112,
        "types": [
            "じめん",
            "いわ"
        ]
    },
    "サイホーン": {
        "base_stats": {
            "a": 85,
            "b": 95,
            "c": 30,
            "d": 30,
            "h": 80,
            "s": 25
        },
        "id": 111,
        "types": [
            "じめん",
            "いわ"
        ]
    },
    "サクラビス": {
        "base_stats": {
            "a": 84,
            "b": 105,
            "c": 114,
            "d": 75,
            "h": 55,
            "s": 52
        },
        "id": 368,
        "types": [
            "みず"
        ]
    },
    "サケブシッポ": {
        "base_stats": {
            "a": 65,
            "b": 99,
            "c": 65,
            "d": 115,
            "h": 115,
            "s": 111
        },
        "id": 985,
        "types": [
            "フェアリー",
            "エスパー"
        ]
    },
    "サザンドラ": {
        "base_stats": {
            "a": 105,
            "b": 90,
            "c": 125,
            "d": 90,
            "h": 92,
            "s": 98
        },
        "id": 635,
        "types": [
            "あく",
            "ドラゴン"
        ]
    },
    "サシカマス": {
        "base_stats": {
            "a": 63,
            "b": 40,
            "c": 40,
            "d": 30,
            "h": 41,
            "s": 66
        },
        "id": 846,
        "types": [
            "みず"
        ]
    },
    "サダイジャ": {
        "base_stats": {
            "a": 107,
            "b": 125,
            "c": 65,
            "d": 70,
            "h": 72,
            "s": 71
        },
        "id": 844,
        "types": [
            "じめん"
        ]
    },
    "サッチムシ": {
        "base_stats": {
            "a": 20,
            "b": 20,
            "c": 25,
            "d": 45,
            "h": 25,
            "s": 45
        },
        "id": 824,
        "types": [
            "むし"
        ]
    },
    "サナギラス": {
        "base_stats": {
            "a": 84,
            "b": 70,
            "c": 65,
            "d": 70,
            "h": 70,
            "s": 51
        },
        "id": 247,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "サニゴーン": {
        "base_stats": {
            "a": 95,
            "b": 50,
            "c": 145,
            "d": 130,
            "h": 60,
            "s": 30
        },
        "id": 864,
        "types": [
            "ゴースト"
        ]
    },
    "サニーゴ": {
        "base_stats": {
            "a": 55,
            "b": 95,
            "c": 65,
            "d": 95,
            "h": 65,
            "s": 35
        },
        "id": 222,
        "types": [
            "みず",
            "いわ"
        ]
    },
    "サボネア": {
        "base_stats": {
            "a": 85,
            "b": 40,
            "c": 85,
            "d": 40,
            "h": 50,
            "s": 35
        },
        "id": 331,
        "types": [
            "くさ"
        ]
    },
    "サマヨール": {
        "base_stats": {
            "a": 70,
            "b": 130,
            "c": 60,
            "d": 130,
            "h": 40,
            "s": 25
        },
        "id": 356,
        "types": [
            "ゴースト"
        ]
    },
    "サメハダー": {
        "base_stats": {
            "a": 120,
            "b": 40,
            "c": 95,
            "d": 40,
            "h": 70,
            "s": 95
        },
        "id": 319,
        "types": [
            "みず",
            "あく"
        ]
    },
    "サルノリ": {
        "base_stats": {
            "a": 65,
            "b": 50,
            "c": 40,
            "d": 40,
            "h": 50,
            "s": 65
        },
        "id": 810,
        "types": [
            "くさ"
        ]
    },
    "サワムラー": {
        "base_stats": {
            "a": 120,
            "b": 53,
            "c": 35,
            "d": 110,
            "h": 50,
            "s": 87
        },
        "id": 106,
        "types": [
            "かくとう"
        ]
    },
    "サンダー": {
        "base_stats": {
            "a": 90,
            "b": 85,
            "c": 125,
            "d": 90,
            "h": 90,
            "s": 100
        },
        "id": 145,
        "types": [
            "でんき",
            "ひこう"
        ]
    },
    "サンダース": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 110,
            "d": 95,
            "h": 65,
            "s": 130
        },
        "id": 135,
        "types": [
            "でんき"
        ]
    },
    "サンド": {
        "base_stats": {
            "a": 75,
            "b": 85,
            "c": 20,
            "d": 30,
            "h": 50,
            "s": 40
        },
        "id": 27,
        "types": [
            "じめん"
        ]
    },
    "サンドパン": {
        "base_stats": {
            "a": 100,
            "b": 110,
            "c": 45,
            "d": 55,
            "h": 75,
            "s": 65
        },
        "id": 28,
        "types": [
            "じめん"
        ]
    },
    "サーナイト": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 125,
            "d": 115,
            "h": 68,
            "s": 80
        },
        "id": 282,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "サーフゴー": {
        "base_stats": {
            "a": 60,
            "b": 95,
            "c": 133,
            "d": 91,
            "h": 87,
            "s": 84
        },
        "id": 1000,
        "types": [
            "はがね",
            "ゴースト"
        ]
    },
    "ザシアン": {
        "base_stats": {
            "a": 120,
            "b": 115,
            "c": 80,
            "d": 115,
            "h": 92,
            "s": 138
        },
        "id": 888,
        "types": [
            "フェアリー"
        ]
    },
    "ザマゼンタ": {
        "base_stats": {
            "a": 120,
            "b": 115,
            "c": 80,
            "d": 115,
            "h": 92,
            "s": 138
        },
        "id": 889,
        "types": [
            "かくとう"
        ]
    },
    "ザルード": {
        "base_stats": {
            "a": 120,
            "b": 105,
            "c": 70,
            "d": 95,
            "h": 105,
            "s": 105
        },
        "id": 893,
        "types": [
            "あく",
            "くさ"
        ]
    },
    "ザングース": {
        "base_stats": {
            "a": 115,
            "b": 60,
            "c": 60,
            "d": 60,
            "h": 73,
            "s": 90
        },
        "id": 335,
        "types": [
            "ノーマル"
        ]
    },
    "シェイミ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 492,
        "types": [
            "くさ"
        ]
    },
    "シェルダー": {
        "base_stats": {
            "a": 65,
            "b": 100,
            "c": 45,
            "d": 25,
            "h": 30,
            "s": 40
        },
        "id": 90,
        "types": [
            "みず"
        ]
    },
    "シガロコ": {
        "base_stats": {
            "a": 50,
            "b": 60,
            "c": 31,
            "d": 58,
            "h": 41,
            "s": 30
        },
        "id": 953,
        "types": [
            "むし"
        ]
    },
    "シキジカ": {
        "base_stats": {
            "a": 60,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 60,
            "s": 75
        },
        "id": 585,
        "types": [
            "ノーマル",
            "くさ"
        ]
    },
    "シザリガー": {
        "base_stats": {
            "a": 120,
            "b": 85,
            "c": 90,
            "d": 55,
            "h": 63,
            "s": 55
        },
        "id": 342,
        "types": [
            "みず",
            "あく"
        ]
    },
    "シシコ": {
        "base_stats": {
            "a": 50,
            "b": 58,
            "c": 73,
            "d": 54,
            "h": 62,
            "s": 72
        },
        "id": 667,
        "types": [
            "ほのお",
            "ノーマル"
        ]
    },
    "シズクモ": {
        "base_stats": {
            "a": 40,
            "b": 52,
            "c": 40,
            "d": 72,
            "h": 38,
            "s": 27
        },
        "id": 751,
        "types": [
            "みず",
            "むし"
        ]
    },
    "シビシラス": {
        "base_stats": {
            "a": 55,
            "b": 40,
            "c": 45,
            "d": 40,
            "h": 35,
            "s": 60
        },
        "id": 602,
        "types": [
            "でんき"
        ]
    },
    "シビビール": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 75,
            "d": 70,
            "h": 65,
            "s": 40
        },
        "id": 603,
        "types": [
            "でんき"
        ]
    },
    "シビルドン": {
        "base_stats": {
            "a": 115,
            "b": 80,
            "c": 105,
            "d": 80,
            "h": 85,
            "s": 50
        },
        "id": 604,
        "types": [
            "でんき"
        ]
    },
    "シママ": {
        "base_stats": {
            "a": 60,
            "b": 32,
            "c": 50,
            "d": 32,
            "h": 45,
            "s": 76
        },
        "id": 522,
        "types": [
            "でんき"
        ]
    },
    "シャリタツ": {
        "base_stats": {
            "a": 50,
            "b": 60,
            "c": 120,
            "d": 95,
            "h": 68,
            "s": 82
        },
        "id": 978,
        "types": [
            "ドラゴン",
            "みず"
        ]
    },
    "シャワーズ": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 110,
            "d": 95,
            "h": 130,
            "s": 65
        },
        "id": 134,
        "types": [
            "みず"
        ]
    },
    "シャンデラ": {
        "base_stats": {
            "a": 55,
            "b": 90,
            "c": 145,
            "d": 90,
            "h": 60,
            "s": 80
        },
        "id": 609,
        "types": [
            "ゴースト",
            "ほのお"
        ]
    },
    "シュシュプ": {
        "base_stats": {
            "a": 52,
            "b": 60,
            "c": 63,
            "d": 65,
            "h": 78,
            "s": 23
        },
        "id": 682,
        "types": [
            "フェアリー"
        ]
    },
    "シュバルゴ": {
        "base_stats": {
            "a": 135,
            "b": 105,
            "c": 60,
            "d": 105,
            "h": 70,
            "s": 20
        },
        "id": 589,
        "types": [
            "むし",
            "はがね"
        ]
    },
    "シルシュルー": {
        "base_stats": {
            "a": 65,
            "b": 35,
            "c": 40,
            "d": 35,
            "h": 40,
            "s": 75
        },
        "id": 944,
        "types": [
            "どく",
            "ノーマル"
        ]
    },
    "シルヴァディ": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 95,
            "d": 95,
            "h": 95,
            "s": 95
        },
        "id": 773,
        "types": [
            "ノーマル"
        ]
    },
    "シロデスナ": {
        "base_stats": {
            "a": 75,
            "b": 110,
            "c": 100,
            "d": 75,
            "h": 85,
            "s": 35
        },
        "id": 770,
        "types": [
            "ゴースト",
            "じめん"
        ]
    },
    "シンボラー": {
        "base_stats": {
            "a": 58,
            "b": 80,
            "c": 103,
            "d": 80,
            "h": 72,
            "s": 97
        },
        "id": 561,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "シードラ": {
        "base_stats": {
            "a": 65,
            "b": 95,
            "c": 95,
            "d": 45,
            "h": 55,
            "s": 85
        },
        "id": 117,
        "types": [
            "みず"
        ]
    },
    "ジオヅム": {
        "base_stats": {
            "a": 60,
            "b": 100,
            "c": 35,
            "d": 65,
            "h": 60,
            "s": 35
        },
        "id": 933,
        "types": [
            "いわ"
        ]
    },
    "ジガルデ": {
        "base_stats": {
            "a": 100,
            "b": 121,
            "c": 81,
            "d": 95,
            "h": 108,
            "s": 95
        },
        "id": 718,
        "types": [
            "ドラゴン",
            "じめん"
        ]
    },
    "ジグザグマ": {
        "base_stats": {
            "a": 30,
            "b": 41,
            "c": 30,
            "d": 41,
            "h": 38,
            "s": 60
        },
        "id": 263,
        "types": [
            "ノーマル"
        ]
    },
    "ジジーロン": {
        "base_stats": {
            "a": 60,
            "b": 85,
            "c": 135,
            "d": 91,
            "h": 78,
            "s": 36
        },
        "id": 780,
        "types": [
            "ノーマル",
            "ドラゴン"
        ]
    },
    "ジバコイル": {
        "base_stats": {
            "a": 70,
            "b": 115,
            "c": 130,
            "d": 90,
            "h": 70,
            "s": 60
        },
        "id": 462,
        "types": [
            "でんき",
            "はがね"
        ]
    },
    "ジヘッド": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 65,
            "d": 70,
            "h": 72,
            "s": 58
        },
        "id": 634,
        "types": [
            "あく",
            "ドラゴン"
        ]
    },
    "ジメレオン": {
        "base_stats": {
            "a": 60,
            "b": 55,
            "c": 95,
            "d": 55,
            "h": 65,
            "s": 90
        },
        "id": 817,
        "types": [
            "みず"
        ]
    },
    "ジャノビー": {
        "base_stats": {
            "a": 60,
            "b": 75,
            "c": 60,
            "d": 75,
            "h": 60,
            "s": 83
        },
        "id": 496,
        "types": [
            "くさ"
        ]
    },
    "ジャラコ": {
        "base_stats": {
            "a": 55,
            "b": 65,
            "c": 45,
            "d": 45,
            "h": 45,
            "s": 45
        },
        "id": 782,
        "types": [
            "ドラゴン"
        ]
    },
    "ジャラランガ": {
        "base_stats": {
            "a": 110,
            "b": 125,
            "c": 100,
            "d": 105,
            "h": 75,
            "s": 85
        },
        "id": 784,
        "types": [
            "ドラゴン",
            "かくとう"
        ]
    },
    "ジャランゴ": {
        "base_stats": {
            "a": 75,
            "b": 90,
            "c": 65,
            "d": 70,
            "h": 55,
            "s": 65
        },
        "id": 783,
        "types": [
            "ドラゴン",
            "かくとう"
        ]
    },
    "ジャローダ": {
        "base_stats": {
            "a": 75,
            "b": 95,
            "c": 75,
            "d": 95,
            "h": 75,
            "s": 113
        },
        "id": 497,
        "types": [
            "くさ"
        ]
    },
    "ジュカイン": {
        "base_stats": {
            "a": 85,
            "b": 65,
            "c": 105,
            "d": 85,
            "h": 70,
            "s": 120
        },
        "id": 254,
        "types": [
            "くさ"
        ]
    },
    "ジュゴン": {
        "base_stats": {
            "a": 70,
            "b": 80,
            "c": 70,
            "d": 95,
            "h": 90,
            "s": 70
        },
        "id": 87,
        "types": [
            "みず",
            "こおり"
        ]
    },
    "ジュナイパー": {
        "base_stats": {
            "a": 107,
            "b": 75,
            "c": 100,
            "d": 100,
            "h": 78,
            "s": 70
        },
        "id": 724,
        "types": [
            "くさ",
            "ゴースト"
        ]
    },
    "ジュプトル": {
        "base_stats": {
            "a": 65,
            "b": 45,
            "c": 85,
            "d": 65,
            "h": 50,
            "s": 95
        },
        "id": 253,
        "types": [
            "くさ"
        ]
    },
    "ジュペッタ": {
        "base_stats": {
            "a": 115,
            "b": 65,
            "c": 83,
            "d": 63,
            "h": 64,
            "s": 65
        },
        "id": 354,
        "types": [
            "ゴースト"
        ]
    },
    "ジュラルドン": {
        "base_stats": {
            "a": 95,
            "b": 115,
            "c": 120,
            "d": 50,
            "h": 70,
            "s": 85
        },
        "id": 884,
        "types": [
            "はがね",
            "ドラゴン"
        ]
    },
    "ジラーチ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 385,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "ジーランス": {
        "base_stats": {
            "a": 90,
            "b": 130,
            "c": 45,
            "d": 65,
            "h": 100,
            "s": 55
        },
        "id": 369,
        "types": [
            "みず",
            "いわ"
        ]
    },
    "スイクン": {
        "base_stats": {
            "a": 75,
            "b": 115,
            "c": 90,
            "d": 115,
            "h": 100,
            "s": 85
        },
        "id": 245,
        "types": [
            "みず"
        ]
    },
    "スカタンク": {
        "base_stats": {
            "a": 93,
            "b": 67,
            "c": 71,
            "d": 61,
            "h": 103,
            "s": 84
        },
        "id": 435,
        "types": [
            "どく",
            "あく"
        ]
    },
    "スカンプー": {
        "base_stats": {
            "a": 63,
            "b": 47,
            "c": 41,
            "d": 41,
            "h": 63,
            "s": 74
        },
        "id": 434,
        "types": [
            "どく",
            "あく"
        ]
    },
    "スコルピ": {
        "base_stats": {
            "a": 50,
            "b": 90,
            "c": 30,
            "d": 55,
            "h": 40,
            "s": 65
        },
        "id": 451,
        "types": [
            "どく",
            "むし"
        ]
    },
    "スコヴィラン": {
        "base_stats": {
            "a": 108,
            "b": 65,
            "c": 108,
            "d": 65,
            "h": 65,
            "s": 75
        },
        "id": 952,
        "types": [
            "くさ",
            "ほのお"
        ]
    },
    "スターミー": {
        "base_stats": {
            "a": 75,
            "b": 85,
            "c": 100,
            "d": 85,
            "h": 60,
            "s": 115
        },
        "id": 121,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ストライク": {
        "base_stats": {
            "a": 110,
            "b": 80,
            "c": 55,
            "d": 80,
            "h": 70,
            "s": 105
        },
        "id": 123,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "ストリンダー": {
        "base_stats": {
            "a": 98,
            "b": 70,
            "c": 114,
            "d": 70,
            "h": 75,
            "s": 75
        },
        "id": 849,
        "types": [
            "でんき",
            "どく"
        ]
    },
    "スナノケガワ": {
        "base_stats": {
            "a": 81,
            "b": 97,
            "c": 121,
            "d": 85,
            "h": 85,
            "s": 101
        },
        "id": 989,
        "types": [
            "でんき",
            "じめん"
        ]
    },
    "スナバァ": {
        "base_stats": {
            "a": 55,
            "b": 80,
            "c": 70,
            "d": 45,
            "h": 55,
            "s": 15
        },
        "id": 769,
        "types": [
            "ゴースト",
            "じめん"
        ]
    },
    "スナヘビ": {
        "base_stats": {
            "a": 57,
            "b": 75,
            "c": 35,
            "d": 50,
            "h": 52,
            "s": 46
        },
        "id": 843,
        "types": [
            "じめん"
        ]
    },
    "スバメ": {
        "base_stats": {
            "a": 55,
            "b": 30,
            "c": 30,
            "d": 30,
            "h": 40,
            "s": 85
        },
        "id": 276,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "スピアー": {
        "base_stats": {
            "a": 90,
            "b": 40,
            "c": 45,
            "d": 80,
            "h": 65,
            "s": 75
        },
        "id": 15,
        "types": [
            "むし",
            "どく"
        ]
    },
    "スボミー": {
        "base_stats": {
            "a": 30,
            "b": 35,
            "c": 50,
            "d": 70,
            "h": 40,
            "s": 55
        },
        "id": 406,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "スリーパー": {
        "base_stats": {
            "a": 73,
            "b": 70,
            "c": 73,
            "d": 115,
            "h": 85,
            "s": 67
        },
        "id": 97,
        "types": [
            "エスパー"
        ]
    },
    "スリープ": {
        "base_stats": {
            "a": 48,
            "b": 45,
            "c": 43,
            "d": 90,
            "h": 60,
            "s": 42
        },
        "id": 96,
        "types": [
            "エスパー"
        ]
    },
    "スワンナ": {
        "base_stats": {
            "a": 87,
            "b": 63,
            "c": 87,
            "d": 63,
            "h": 75,
            "s": 98
        },
        "id": 581,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "ズガイドス": {
        "base_stats": {
            "a": 125,
            "b": 40,
            "c": 30,
            "d": 30,
            "h": 67,
            "s": 58
        },
        "id": 408,
        "types": [
            "いわ"
        ]
    },
    "ズガドーン": {
        "base_stats": {
            "a": 127,
            "b": 53,
            "c": 151,
            "d": 79,
            "h": 53,
            "s": 107
        },
        "id": 806,
        "types": [
            "ほのお",
            "ゴースト"
        ]
    },
    "ズバット": {
        "base_stats": {
            "a": 45,
            "b": 35,
            "c": 30,
            "d": 40,
            "h": 40,
            "s": 55
        },
        "id": 41,
        "types": [
            "どく",
            "ひこう"
        ]
    },
    "ズピカ": {
        "base_stats": {
            "a": 31,
            "b": 41,
            "c": 59,
            "d": 35,
            "h": 61,
            "s": 45
        },
        "id": 938,
        "types": [
            "でんき"
        ]
    },
    "ズルズキン": {
        "base_stats": {
            "a": 90,
            "b": 115,
            "c": 45,
            "d": 115,
            "h": 65,
            "s": 58
        },
        "id": 560,
        "types": [
            "あく",
            "かくとう"
        ]
    },
    "ズルッグ": {
        "base_stats": {
            "a": 75,
            "b": 70,
            "c": 35,
            "d": 70,
            "h": 50,
            "s": 48
        },
        "id": 559,
        "types": [
            "あく",
            "かくとう"
        ]
    },
    "セキタンザン": {
        "base_stats": {
            "a": 80,
            "b": 120,
            "c": 80,
            "d": 90,
            "h": 110,
            "s": 30
        },
        "id": 839,
        "types": [
            "いわ",
            "ほのお"
        ]
    },
    "セグレイブ": {
        "base_stats": {
            "a": 145,
            "b": 92,
            "c": 75,
            "d": 86,
            "h": 115,
            "s": 87
        },
        "id": 998,
        "types": [
            "ドラゴン",
            "こおり"
        ]
    },
    "セゴール": {
        "base_stats": {
            "a": 95,
            "b": 66,
            "c": 45,
            "d": 65,
            "h": 90,
            "s": 62
        },
        "id": 997,
        "types": [
            "ドラゴン",
            "こおり"
        ]
    },
    "セビエ": {
        "base_stats": {
            "a": 75,
            "b": 45,
            "c": 35,
            "d": 45,
            "h": 65,
            "s": 55
        },
        "id": 996,
        "types": [
            "ドラゴン",
            "こおり"
        ]
    },
    "セレビィ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 251,
        "types": [
            "エスパー",
            "くさ"
        ]
    },
    "ゼクロム": {
        "base_stats": {
            "a": 150,
            "b": 120,
            "c": 120,
            "d": 100,
            "h": 100,
            "s": 90
        },
        "id": 644,
        "types": [
            "ドラゴン",
            "でんき"
        ]
    },
    "ゼニガメ": {
        "base_stats": {
            "a": 48,
            "b": 65,
            "c": 50,
            "d": 64,
            "h": 44,
            "s": 43
        },
        "id": 7,
        "types": [
            "みず"
        ]
    },
    "ゼブライカ": {
        "base_stats": {
            "a": 100,
            "b": 63,
            "c": 80,
            "d": 63,
            "h": 75,
            "s": 116
        },
        "id": 523,
        "types": [
            "でんき"
        ]
    },
    "ゼラオラ": {
        "base_stats": {
            "a": 112,
            "b": 75,
            "c": 102,
            "d": 80,
            "h": 88,
            "s": 143
        },
        "id": 807,
        "types": [
            "でんき"
        ]
    },
    "ゼルネアス": {
        "base_stats": {
            "a": 131,
            "b": 95,
            "c": 131,
            "d": 98,
            "h": 126,
            "s": 99
        },
        "id": 716,
        "types": [
            "フェアリー"
        ]
    },
    "ソウブレイズ": {
        "base_stats": {
            "a": 125,
            "b": 80,
            "c": 60,
            "d": 100,
            "h": 75,
            "s": 85
        },
        "id": 937,
        "types": [
            "ほのお",
            "ゴースト"
        ]
    },
    "ソルガレオ": {
        "base_stats": {
            "a": 137,
            "b": 107,
            "c": 113,
            "d": 89,
            "h": 137,
            "s": 97
        },
        "id": 791,
        "types": [
            "エスパー",
            "はがね"
        ]
    },
    "ソルロック": {
        "base_stats": {
            "a": 95,
            "b": 85,
            "c": 55,
            "d": 65,
            "h": 90,
            "s": 70
        },
        "id": 338,
        "types": [
            "いわ",
            "エスパー"
        ]
    },
    "ソーナノ": {
        "base_stats": {
            "a": 23,
            "b": 48,
            "c": 23,
            "d": 48,
            "h": 95,
            "s": 23
        },
        "id": 360,
        "types": [
            "エスパー"
        ]
    },
    "ソーナンス": {
        "base_stats": {
            "a": 33,
            "b": 58,
            "c": 33,
            "d": 58,
            "h": 190,
            "s": 33
        },
        "id": 202,
        "types": [
            "エスパー"
        ]
    },
    "ゾウドウ": {
        "base_stats": {
            "a": 80,
            "b": 49,
            "c": 40,
            "d": 49,
            "h": 72,
            "s": 40
        },
        "id": 878,
        "types": [
            "はがね"
        ]
    },
    "ゾロア": {
        "base_stats": {
            "a": 65,
            "b": 40,
            "c": 80,
            "d": 40,
            "h": 40,
            "s": 65
        },
        "id": 570,
        "types": [
            "あく"
        ]
    },
    "ゾロアーク": {
        "base_stats": {
            "a": 105,
            "b": 60,
            "c": 120,
            "d": 60,
            "h": 60,
            "s": 105
        },
        "id": 571,
        "types": [
            "あく"
        ]
    },
    "タイカイデン": {
        "base_stats": {
            "a": 70,
            "b": 60,
            "c": 105,
            "d": 60,
            "h": 70,
            "s": 125
        },
        "id": 941,
        "types": [
            "でんき",
            "ひこう"
        ]
    },
    "タイプ：ヌル": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 95,
            "d": 95,
            "h": 95,
            "s": 59
        },
        "id": 772,
        "types": [
            "ノーマル"
        ]
    },
    "タイレーツ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 70,
            "d": 60,
            "h": 65,
            "s": 75
        },
        "id": 870,
        "types": [
            "かくとう"
        ]
    },
    "タギングル": {
        "base_stats": {
            "a": 95,
            "b": 65,
            "c": 80,
            "d": 72,
            "h": 63,
            "s": 110
        },
        "id": 945,
        "types": [
            "どく",
            "ノーマル"
        ]
    },
    "タタッコ": {
        "base_stats": {
            "a": 68,
            "b": 60,
            "c": 50,
            "d": 50,
            "h": 50,
            "s": 32
        },
        "id": 852,
        "types": [
            "かくとう"
        ]
    },
    "タチフサグマ": {
        "base_stats": {
            "a": 90,
            "b": 101,
            "c": 60,
            "d": 81,
            "h": 93,
            "s": 95
        },
        "id": 862,
        "types": [
            "あく",
            "ノーマル"
        ]
    },
    "タッツー": {
        "base_stats": {
            "a": 40,
            "b": 70,
            "c": 70,
            "d": 25,
            "h": 30,
            "s": 60
        },
        "id": 116,
        "types": [
            "みず"
        ]
    },
    "タツベイ": {
        "base_stats": {
            "a": 75,
            "b": 60,
            "c": 40,
            "d": 30,
            "h": 45,
            "s": 50
        },
        "id": 371,
        "types": [
            "ドラゴン"
        ]
    },
    "タテトプス": {
        "base_stats": {
            "a": 42,
            "b": 118,
            "c": 42,
            "d": 88,
            "h": 30,
            "s": 30
        },
        "id": 410,
        "types": [
            "いわ",
            "はがね"
        ]
    },
    "タネボー": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 30,
            "d": 30,
            "h": 40,
            "s": 30
        },
        "id": 273,
        "types": [
            "くさ"
        ]
    },
    "タブンネ": {
        "base_stats": {
            "a": 60,
            "b": 86,
            "c": 60,
            "d": 86,
            "h": 103,
            "s": 50
        },
        "id": 531,
        "types": [
            "ノーマル"
        ]
    },
    "タマゲタケ": {
        "base_stats": {
            "a": 55,
            "b": 45,
            "c": 55,
            "d": 55,
            "h": 69,
            "s": 15
        },
        "id": 590,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "タマザラシ": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 55,
            "d": 50,
            "h": 70,
            "s": 25
        },
        "id": 363,
        "types": [
            "こおり",
            "みず"
        ]
    },
    "タマタマ": {
        "base_stats": {
            "a": 40,
            "b": 80,
            "c": 60,
            "d": 45,
            "h": 60,
            "s": 40
        },
        "id": 102,
        "types": [
            "くさ",
            "エスパー"
        ]
    },
    "タマンタ": {
        "base_stats": {
            "a": 20,
            "b": 50,
            "c": 60,
            "d": 120,
            "h": 45,
            "s": 50
        },
        "id": 458,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "タマンチュラ": {
        "base_stats": {
            "a": 41,
            "b": 45,
            "c": 29,
            "d": 40,
            "h": 35,
            "s": 20
        },
        "id": 917,
        "types": [
            "むし"
        ]
    },
    "タルップル": {
        "base_stats": {
            "a": 85,
            "b": 80,
            "c": 100,
            "d": 80,
            "h": 110,
            "s": 30
        },
        "id": 842,
        "types": [
            "くさ",
            "ドラゴン"
        ]
    },
    "タンドン": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 30,
            "s": 30
        },
        "id": 837,
        "types": [
            "いわ"
        ]
    },
    "ダイオウドウ": {
        "base_stats": {
            "a": 130,
            "b": 69,
            "c": 80,
            "d": 69,
            "h": 122,
            "s": 30
        },
        "id": 879,
        "types": [
            "はがね"
        ]
    },
    "ダイケンキ": {
        "base_stats": {
            "a": 100,
            "b": 85,
            "c": 108,
            "d": 70,
            "h": 95,
            "s": 70
        },
        "id": 503,
        "types": [
            "みず"
        ]
    },
    "ダイノーズ": {
        "base_stats": {
            "a": 55,
            "b": 145,
            "c": 75,
            "d": 150,
            "h": 60,
            "s": 40
        },
        "id": 476,
        "types": [
            "いわ",
            "はがね"
        ]
    },
    "ダクマ": {
        "base_stats": {
            "a": 90,
            "b": 60,
            "c": 53,
            "d": 50,
            "h": 60,
            "s": 72
        },
        "id": 891,
        "types": [
            "かくとう"
        ]
    },
    "ダグトリオ": {
        "base_stats": {
            "a": 100,
            "b": 50,
            "c": 50,
            "d": 70,
            "h": 35,
            "s": 120
        },
        "id": 51,
        "types": [
            "じめん"
        ]
    },
    "ダゲキ": {
        "base_stats": {
            "a": 125,
            "b": 75,
            "c": 30,
            "d": 75,
            "h": 75,
            "s": 85
        },
        "id": 539,
        "types": [
            "かくとう"
        ]
    },
    "ダストダス": {
        "base_stats": {
            "a": 95,
            "b": 82,
            "c": 60,
            "d": 82,
            "h": 80,
            "s": 75
        },
        "id": 569,
        "types": [
            "どく"
        ]
    },
    "ダダリン": {
        "base_stats": {
            "a": 131,
            "b": 100,
            "c": 86,
            "d": 90,
            "h": 70,
            "s": 40
        },
        "id": 781,
        "types": [
            "ゴースト",
            "くさ"
        ]
    },
    "ダブラン": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 125,
            "d": 60,
            "h": 65,
            "s": 30
        },
        "id": 578,
        "types": [
            "エスパー"
        ]
    },
    "ダルマッカ": {
        "base_stats": {
            "a": 90,
            "b": 45,
            "c": 15,
            "d": 45,
            "h": 70,
            "s": 50
        },
        "id": 554,
        "types": [
            "ほのお"
        ]
    },
    "ダンゴロ": {
        "base_stats": {
            "a": 75,
            "b": 85,
            "c": 25,
            "d": 25,
            "h": 55,
            "s": 15
        },
        "id": 524,
        "types": [
            "いわ"
        ]
    },
    "ダンバル": {
        "base_stats": {
            "a": 55,
            "b": 80,
            "c": 35,
            "d": 60,
            "h": 40,
            "s": 30
        },
        "id": 374,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "ダークライ": {
        "base_stats": {
            "a": 90,
            "b": 90,
            "c": 135,
            "d": 90,
            "h": 70,
            "s": 125
        },
        "id": 491,
        "types": [
            "あく"
        ]
    },
    "ダーテング": {
        "base_stats": {
            "a": 100,
            "b": 60,
            "c": 90,
            "d": 60,
            "h": 90,
            "s": 80
        },
        "id": 275,
        "types": [
            "くさ",
            "あく"
        ]
    },
    "チェリム": {
        "base_stats": {
            "a": 60,
            "b": 70,
            "c": 87,
            "d": 78,
            "h": 70,
            "s": 85
        },
        "id": 421,
        "types": [
            "くさ"
        ]
    },
    "チェリンボ": {
        "base_stats": {
            "a": 35,
            "b": 45,
            "c": 62,
            "d": 53,
            "h": 45,
            "s": 35
        },
        "id": 420,
        "types": [
            "くさ"
        ]
    },
    "チオンジェン": {
        "base_stats": {
            "a": 85,
            "b": 100,
            "c": 95,
            "d": 135,
            "h": 85,
            "s": 70
        },
        "id": 1001,
        "types": [
            "あく",
            "くさ"
        ]
    },
    "チコリータ": {
        "base_stats": {
            "a": 49,
            "b": 65,
            "c": 49,
            "d": 65,
            "h": 45,
            "s": 45
        },
        "id": 152,
        "types": [
            "くさ"
        ]
    },
    "チゴラス": {
        "base_stats": {
            "a": 89,
            "b": 77,
            "c": 45,
            "d": 45,
            "h": 58,
            "s": 48
        },
        "id": 696,
        "types": [
            "いわ",
            "ドラゴン"
        ]
    },
    "チャオブー": {
        "base_stats": {
            "a": 93,
            "b": 55,
            "c": 70,
            "d": 55,
            "h": 90,
            "s": 55
        },
        "id": 499,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "チャーレム": {
        "base_stats": {
            "a": 60,
            "b": 75,
            "c": 60,
            "d": 75,
            "h": 60,
            "s": 80
        },
        "id": 308,
        "types": [
            "かくとう",
            "エスパー"
        ]
    },
    "チュリネ": {
        "base_stats": {
            "a": 35,
            "b": 50,
            "c": 70,
            "d": 50,
            "h": 45,
            "s": 30
        },
        "id": 548,
        "types": [
            "くさ"
        ]
    },
    "チョボマキ": {
        "base_stats": {
            "a": 40,
            "b": 85,
            "c": 40,
            "d": 65,
            "h": 50,
            "s": 25
        },
        "id": 616,
        "types": [
            "むし"
        ]
    },
    "チョロネコ": {
        "base_stats": {
            "a": 50,
            "b": 37,
            "c": 50,
            "d": 37,
            "h": 41,
            "s": 66
        },
        "id": 509,
        "types": [
            "あく"
        ]
    },
    "チョンチー": {
        "base_stats": {
            "a": 38,
            "b": 38,
            "c": 56,
            "d": 56,
            "h": 75,
            "s": 67
        },
        "id": 170,
        "types": [
            "みず",
            "でんき"
        ]
    },
    "チラチーノ": {
        "base_stats": {
            "a": 95,
            "b": 60,
            "c": 65,
            "d": 60,
            "h": 75,
            "s": 115
        },
        "id": 573,
        "types": [
            "ノーマル"
        ]
    },
    "チラーミィ": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 40,
            "d": 40,
            "h": 55,
            "s": 75
        },
        "id": 572,
        "types": [
            "ノーマル"
        ]
    },
    "チリーン": {
        "base_stats": {
            "a": 50,
            "b": 80,
            "c": 95,
            "d": 90,
            "h": 75,
            "s": 65
        },
        "id": 358,
        "types": [
            "エスパー"
        ]
    },
    "チルタリス": {
        "base_stats": {
            "a": 70,
            "b": 90,
            "c": 70,
            "d": 105,
            "h": 75,
            "s": 80
        },
        "id": 334,
        "types": [
            "ドラゴン",
            "ひこう"
        ]
    },
    "チルット": {
        "base_stats": {
            "a": 40,
            "b": 60,
            "c": 40,
            "d": 75,
            "h": 45,
            "s": 50
        },
        "id": 333,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "チヲハウハネ": {
        "base_stats": {
            "a": 135,
            "b": 79,
            "c": 85,
            "d": 105,
            "h": 85,
            "s": 81
        },
        "id": 988,
        "types": [
            "むし",
            "かくとう"
        ]
    },
    "ツタージャ": {
        "base_stats": {
            "a": 45,
            "b": 55,
            "c": 45,
            "d": 55,
            "h": 45,
            "s": 63
        },
        "id": 495,
        "types": [
            "くさ"
        ]
    },
    "ツチニン": {
        "base_stats": {
            "a": 45,
            "b": 90,
            "c": 30,
            "d": 30,
            "h": 31,
            "s": 40
        },
        "id": 290,
        "types": [
            "むし",
            "じめん"
        ]
    },
    "ツツケラ": {
        "base_stats": {
            "a": 75,
            "b": 30,
            "c": 30,
            "d": 30,
            "h": 35,
            "s": 65
        },
        "id": 731,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ツボツボ": {
        "base_stats": {
            "a": 10,
            "b": 230,
            "c": 10,
            "d": 230,
            "h": 20,
            "s": 5
        },
        "id": 213,
        "types": [
            "むし",
            "いわ"
        ]
    },
    "ツンデツンデ": {
        "base_stats": {
            "a": 131,
            "b": 211,
            "c": 53,
            "d": 101,
            "h": 61,
            "s": 13
        },
        "id": 805,
        "types": [
            "いわ",
            "はがね"
        ]
    },
    "ツンベアー": {
        "base_stats": {
            "a": 130,
            "b": 80,
            "c": 70,
            "d": 80,
            "h": 95,
            "s": 50
        },
        "id": 614,
        "types": [
            "こおり"
        ]
    },
    "テッカグヤ": {
        "base_stats": {
            "a": 101,
            "b": 103,
            "c": 107,
            "d": 101,
            "h": 97,
            "s": 61
        },
        "id": 797,
        "types": [
            "はがね",
            "ひこう"
        ]
    },
    "テッカニン": {
        "base_stats": {
            "a": 90,
            "b": 45,
            "c": 50,
            "d": 50,
            "h": 61,
            "s": 160
        },
        "id": 291,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "テッシード": {
        "base_stats": {
            "a": 50,
            "b": 91,
            "c": 24,
            "d": 86,
            "h": 44,
            "s": 10
        },
        "id": 597,
        "types": [
            "くさ",
            "はがね"
        ]
    },
    "テッポウオ": {
        "base_stats": {
            "a": 65,
            "b": 35,
            "c": 65,
            "d": 35,
            "h": 35,
            "s": 65
        },
        "id": 223,
        "types": [
            "みず"
        ]
    },
    "テツノイサハ": {
        "base_stats": {
            "a": 130,
            "b": 88,
            "c": 70,
            "d": 108,
            "h": 90,
            "s": 104
        },
        "id": 1010,
        "types": [
            "くさ",
            "エスパー"
        ]
    },
    "テツノイバラ": {
        "base_stats": {
            "a": 134,
            "b": 110,
            "c": 70,
            "d": 84,
            "h": 100,
            "s": 72
        },
        "id": 995,
        "types": [
            "いわ",
            "でんき"
        ]
    },
    "テツノカイナ": {
        "base_stats": {
            "a": 140,
            "b": 108,
            "c": 50,
            "d": 68,
            "h": 154,
            "s": 50
        },
        "id": 992,
        "types": [
            "かくとう",
            "でんき"
        ]
    },
    "テツノコウベ": {
        "base_stats": {
            "a": 80,
            "b": 86,
            "c": 122,
            "d": 80,
            "h": 94,
            "s": 108
        },
        "id": 993,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "テツノツツミ": {
        "base_stats": {
            "a": 80,
            "b": 114,
            "c": 124,
            "d": 60,
            "h": 56,
            "s": 136
        },
        "id": 991,
        "types": [
            "こおり",
            "みず"
        ]
    },
    "テツノドクガ": {
        "base_stats": {
            "a": 70,
            "b": 60,
            "c": 140,
            "d": 110,
            "h": 80,
            "s": 110
        },
        "id": 994,
        "types": [
            "ほのお",
            "どく"
        ]
    },
    "テツノブジン": {
        "base_stats": {
            "a": 130,
            "b": 90,
            "c": 120,
            "d": 60,
            "h": 74,
            "s": 116
        },
        "id": 1006,
        "types": [
            "フェアリー",
            "かくとう"
        ]
    },
    "テツノワダチ": {
        "base_stats": {
            "a": 112,
            "b": 120,
            "c": 72,
            "d": 70,
            "h": 90,
            "s": 106
        },
        "id": 990,
        "types": [
            "じめん",
            "はがね"
        ]
    },
    "テブリム": {
        "base_stats": {
            "a": 40,
            "b": 65,
            "c": 86,
            "d": 73,
            "h": 57,
            "s": 49
        },
        "id": 857,
        "types": [
            "エスパー"
        ]
    },
    "テラキオン": {
        "base_stats": {
            "a": 129,
            "b": 90,
            "c": 72,
            "d": 90,
            "h": 91,
            "s": 108
        },
        "id": 639,
        "types": [
            "いわ",
            "かくとう"
        ]
    },
    "テールナー": {
        "base_stats": {
            "a": 59,
            "b": 58,
            "c": 90,
            "d": 70,
            "h": 59,
            "s": 73
        },
        "id": 654,
        "types": [
            "ほのお"
        ]
    },
    "ディアルガ": {
        "base_stats": {
            "a": 120,
            "b": 120,
            "c": 150,
            "d": 100,
            "h": 100,
            "s": 90
        },
        "id": 483,
        "types": [
            "はがね",
            "ドラゴン"
        ]
    },
    "ディアンシー": {
        "base_stats": {
            "a": 100,
            "b": 150,
            "c": 100,
            "d": 150,
            "h": 50,
            "s": 50
        },
        "id": 719,
        "types": [
            "いわ",
            "フェアリー"
        ]
    },
    "ディグダ": {
        "base_stats": {
            "a": 55,
            "b": 25,
            "c": 35,
            "d": 45,
            "h": 10,
            "s": 95
        },
        "id": 50,
        "types": [
            "じめん"
        ]
    },
    "ディンルー": {
        "base_stats": {
            "a": 110,
            "b": 125,
            "c": 55,
            "d": 80,
            "h": 155,
            "s": 45
        },
        "id": 1003,
        "types": [
            "あく",
            "じめん"
        ]
    },
    "デオキシス": {
        "base_stats": {
            "a": 150,
            "b": 50,
            "c": 150,
            "d": 50,
            "h": 50,
            "s": 150
        },
        "id": 386,
        "types": [
            "エスパー"
        ]
    },
    "デカグース": {
        "base_stats": {
            "a": 110,
            "b": 60,
            "c": 55,
            "d": 60,
            "h": 88,
            "s": 45
        },
        "id": 735,
        "types": [
            "ノーマル"
        ]
    },
    "デカヌチャン": {
        "base_stats": {
            "a": 75,
            "b": 77,
            "c": 70,
            "d": 105,
            "h": 85,
            "s": 94
        },
        "id": 959,
        "types": [
            "フェアリー",
            "はがね"
        ]
    },
    "デスカーン": {
        "base_stats": {
            "a": 50,
            "b": 145,
            "c": 95,
            "d": 105,
            "h": 58,
            "s": 30
        },
        "id": 563,
        "types": [
            "ゴースト"
        ]
    },
    "デスバーン": {
        "base_stats": {
            "a": 95,
            "b": 145,
            "c": 50,
            "d": 105,
            "h": 58,
            "s": 30
        },
        "id": 867,
        "types": [
            "じめん",
            "ゴースト"
        ]
    },
    "デスマス": {
        "base_stats": {
            "a": 30,
            "b": 85,
            "c": 55,
            "d": 65,
            "h": 38,
            "s": 30
        },
        "id": 562,
        "types": [
            "ゴースト"
        ]
    },
    "デデンネ": {
        "base_stats": {
            "a": 58,
            "b": 57,
            "c": 81,
            "d": 67,
            "h": 67,
            "s": 101
        },
        "id": 702,
        "types": [
            "でんき",
            "フェアリー"
        ]
    },
    "デリバード": {
        "base_stats": {
            "a": 55,
            "b": 45,
            "c": 65,
            "d": 45,
            "h": 45,
            "s": 75
        },
        "id": 225,
        "types": [
            "こおり",
            "ひこう"
        ]
    },
    "デルビル": {
        "base_stats": {
            "a": 60,
            "b": 30,
            "c": 80,
            "d": 50,
            "h": 45,
            "s": 65
        },
        "id": 228,
        "types": [
            "あく",
            "ほのお"
        ]
    },
    "デンジュモク": {
        "base_stats": {
            "a": 89,
            "b": 71,
            "c": 173,
            "d": 71,
            "h": 83,
            "s": 83
        },
        "id": 796,
        "types": [
            "でんき"
        ]
    },
    "デンチュラ": {
        "base_stats": {
            "a": 77,
            "b": 60,
            "c": 97,
            "d": 60,
            "h": 70,
            "s": 108
        },
        "id": 596,
        "types": [
            "むし",
            "でんき"
        ]
    },
    "デンヂムシ": {
        "base_stats": {
            "a": 82,
            "b": 95,
            "c": 55,
            "d": 75,
            "h": 57,
            "s": 36
        },
        "id": 737,
        "types": [
            "むし",
            "でんき"
        ]
    },
    "デンリュウ": {
        "base_stats": {
            "a": 75,
            "b": 85,
            "c": 115,
            "d": 90,
            "h": 90,
            "s": 55
        },
        "id": 181,
        "types": [
            "でんき"
        ]
    },
    "トゲキッス": {
        "base_stats": {
            "a": 50,
            "b": 95,
            "c": 120,
            "d": 115,
            "h": 85,
            "s": 80
        },
        "id": 468,
        "types": [
            "フェアリー",
            "ひこう"
        ]
    },
    "トゲチック": {
        "base_stats": {
            "a": 40,
            "b": 85,
            "c": 80,
            "d": 105,
            "h": 55,
            "s": 40
        },
        "id": 176,
        "types": [
            "フェアリー",
            "ひこう"
        ]
    },
    "トゲデマル": {
        "base_stats": {
            "a": 98,
            "b": 63,
            "c": 40,
            "d": 73,
            "h": 65,
            "s": 96
        },
        "id": 777,
        "types": [
            "でんき",
            "はがね"
        ]
    },
    "トゲピー": {
        "base_stats": {
            "a": 20,
            "b": 65,
            "c": 40,
            "d": 65,
            "h": 35,
            "s": 20
        },
        "id": 175,
        "types": [
            "フェアリー"
        ]
    },
    "トサキント": {
        "base_stats": {
            "a": 67,
            "b": 60,
            "c": 35,
            "d": 50,
            "h": 45,
            "s": 63
        },
        "id": 118,
        "types": [
            "みず"
        ]
    },
    "トドグラー": {
        "base_stats": {
            "a": 60,
            "b": 70,
            "c": 75,
            "d": 70,
            "h": 90,
            "s": 45
        },
        "id": 364,
        "types": [
            "こおり",
            "みず"
        ]
    },
    "トドゼルガ": {
        "base_stats": {
            "a": 80,
            "b": 90,
            "c": 95,
            "d": 90,
            "h": 110,
            "s": 65
        },
        "id": 365,
        "types": [
            "こおり",
            "みず"
        ]
    },
    "トドロクツキ": {
        "base_stats": {
            "a": 139,
            "b": 71,
            "c": 55,
            "d": 101,
            "h": 105,
            "s": 119
        },
        "id": 1005,
        "types": [
            "ドラゴン",
            "あく"
        ]
    },
    "トランセル": {
        "base_stats": {
            "a": 20,
            "b": 55,
            "c": 25,
            "d": 25,
            "h": 50,
            "s": 30
        },
        "id": 11,
        "types": [
            "むし"
        ]
    },
    "トリデプス": {
        "base_stats": {
            "a": 52,
            "b": 168,
            "c": 47,
            "d": 138,
            "h": 60,
            "s": 30
        },
        "id": 411,
        "types": [
            "いわ",
            "はがね"
        ]
    },
    "トリトドン": {
        "base_stats": {
            "a": 83,
            "b": 68,
            "c": 92,
            "d": 82,
            "h": 111,
            "s": 39
        },
        "id": 423,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "トリミアン": {
        "base_stats": {
            "a": 80,
            "b": 60,
            "c": 65,
            "d": 90,
            "h": 75,
            "s": 102
        },
        "id": 676,
        "types": [
            "ノーマル"
        ]
    },
    "トルネロス": {
        "base_stats": {
            "a": 115,
            "b": 70,
            "c": 125,
            "d": 80,
            "h": 79,
            "s": 111
        },
        "id": 641,
        "types": [
            "ひこう"
        ]
    },
    "トロッゴン": {
        "base_stats": {
            "a": 60,
            "b": 90,
            "c": 60,
            "d": 70,
            "h": 80,
            "s": 50
        },
        "id": 838,
        "types": [
            "いわ",
            "ほのお"
        ]
    },
    "トロピウス": {
        "base_stats": {
            "a": 68,
            "b": 83,
            "c": 72,
            "d": 87,
            "h": 99,
            "s": 51
        },
        "id": 357,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "ドオー": {
        "base_stats": {
            "a": 75,
            "b": 60,
            "c": 45,
            "d": 100,
            "h": 130,
            "s": 20
        },
        "id": 980,
        "types": [
            "どく",
            "じめん"
        ]
    },
    "ドガース": {
        "base_stats": {
            "a": 65,
            "b": 95,
            "c": 60,
            "d": 45,
            "h": 40,
            "s": 35
        },
        "id": 109,
        "types": [
            "どく"
        ]
    },
    "ドククラゲ": {
        "base_stats": {
            "a": 70,
            "b": 65,
            "c": 80,
            "d": 120,
            "h": 80,
            "s": 100
        },
        "id": 73,
        "types": [
            "みず",
            "どく"
        ]
    },
    "ドクケイル": {
        "base_stats": {
            "a": 50,
            "b": 70,
            "c": 50,
            "d": 90,
            "h": 60,
            "s": 65
        },
        "id": 269,
        "types": [
            "むし",
            "どく"
        ]
    },
    "ドクロッグ": {
        "base_stats": {
            "a": 106,
            "b": 65,
            "c": 86,
            "d": 65,
            "h": 83,
            "s": 85
        },
        "id": 454,
        "types": [
            "どく",
            "かくとう"
        ]
    },
    "ドゴーム": {
        "base_stats": {
            "a": 71,
            "b": 43,
            "c": 71,
            "d": 43,
            "h": 84,
            "s": 48
        },
        "id": 294,
        "types": [
            "ノーマル"
        ]
    },
    "ドサイドン": {
        "base_stats": {
            "a": 140,
            "b": 130,
            "c": 55,
            "d": 55,
            "h": 115,
            "s": 40
        },
        "id": 464,
        "types": [
            "じめん",
            "いわ"
        ]
    },
    "ドジョッチ": {
        "base_stats": {
            "a": 48,
            "b": 43,
            "c": 46,
            "d": 41,
            "h": 50,
            "s": 60
        },
        "id": 339,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ドダイトス": {
        "base_stats": {
            "a": 109,
            "b": 105,
            "c": 75,
            "d": 85,
            "h": 95,
            "s": 56
        },
        "id": 389,
        "types": [
            "くさ",
            "じめん"
        ]
    },
    "ドッコラー": {
        "base_stats": {
            "a": 80,
            "b": 55,
            "c": 25,
            "d": 35,
            "h": 75,
            "s": 35
        },
        "id": 532,
        "types": [
            "かくとう"
        ]
    },
    "ドテッコツ": {
        "base_stats": {
            "a": 105,
            "b": 85,
            "c": 40,
            "d": 50,
            "h": 85,
            "s": 40
        },
        "id": 533,
        "types": [
            "かくとう"
        ]
    },
    "ドデカバシ": {
        "base_stats": {
            "a": 120,
            "b": 75,
            "c": 75,
            "d": 75,
            "h": 80,
            "s": 60
        },
        "id": 733,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ドドゲザン": {
        "base_stats": {
            "a": 135,
            "b": 120,
            "c": 60,
            "d": 85,
            "h": 100,
            "s": 50
        },
        "id": 983,
        "types": [
            "あく",
            "はがね"
        ]
    },
    "ドヒドイデ": {
        "base_stats": {
            "a": 63,
            "b": 152,
            "c": 53,
            "d": 142,
            "h": 50,
            "s": 35
        },
        "id": 748,
        "types": [
            "どく",
            "みず"
        ]
    },
    "ドラパルト": {
        "base_stats": {
            "a": 120,
            "b": 75,
            "c": 100,
            "d": 75,
            "h": 88,
            "s": 142
        },
        "id": 887,
        "types": [
            "ドラゴン",
            "ゴースト"
        ]
    },
    "ドラピオン": {
        "base_stats": {
            "a": 90,
            "b": 110,
            "c": 60,
            "d": 75,
            "h": 70,
            "s": 95
        },
        "id": 452,
        "types": [
            "どく",
            "あく"
        ]
    },
    "ドラミドロ": {
        "base_stats": {
            "a": 75,
            "b": 90,
            "c": 97,
            "d": 123,
            "h": 65,
            "s": 44
        },
        "id": 691,
        "types": [
            "どく",
            "ドラゴン"
        ]
    },
    "ドラメシヤ": {
        "base_stats": {
            "a": 60,
            "b": 30,
            "c": 40,
            "d": 30,
            "h": 28,
            "s": 82
        },
        "id": 885,
        "types": [
            "ドラゴン",
            "ゴースト"
        ]
    },
    "ドリュウズ": {
        "base_stats": {
            "a": 135,
            "b": 60,
            "c": 50,
            "d": 65,
            "h": 110,
            "s": 88
        },
        "id": 530,
        "types": [
            "じめん",
            "はがね"
        ]
    },
    "ドレディア": {
        "base_stats": {
            "a": 60,
            "b": 75,
            "c": 110,
            "d": 75,
            "h": 70,
            "s": 90
        },
        "id": 549,
        "types": [
            "くさ"
        ]
    },
    "ドロバンコ": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 45,
            "d": 55,
            "h": 70,
            "s": 45
        },
        "id": 749,
        "types": [
            "じめん"
        ]
    },
    "ドロンチ": {
        "base_stats": {
            "a": 80,
            "b": 50,
            "c": 60,
            "d": 50,
            "h": 68,
            "s": 102
        },
        "id": 886,
        "types": [
            "ドラゴン",
            "ゴースト"
        ]
    },
    "ドンカラス": {
        "base_stats": {
            "a": 125,
            "b": 52,
            "c": 105,
            "d": 52,
            "h": 100,
            "s": 71
        },
        "id": 430,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "ドンファン": {
        "base_stats": {
            "a": 120,
            "b": 120,
            "c": 60,
            "d": 60,
            "h": 90,
            "s": 50
        },
        "id": 232,
        "types": [
            "じめん"
        ]
    },
    "ドンメル": {
        "base_stats": {
            "a": 60,
            "b": 40,
            "c": 65,
            "d": 45,
            "h": 60,
            "s": 35
        },
        "id": 322,
        "types": [
            "ほのお",
            "じめん"
        ]
    },
    "ドータクン": {
        "base_stats": {
            "a": 89,
            "b": 116,
            "c": 79,
            "d": 116,
            "h": 67,
            "s": 33
        },
        "id": 437,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "ドードリオ": {
        "base_stats": {
            "a": 110,
            "b": 70,
            "c": 60,
            "d": 60,
            "h": 60,
            "s": 110
        },
        "id": 85,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ドードー": {
        "base_stats": {
            "a": 85,
            "b": 45,
            "c": 35,
            "d": 35,
            "h": 35,
            "s": 75
        },
        "id": 84,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ドーブル": {
        "base_stats": {
            "a": 20,
            "b": 35,
            "c": 20,
            "d": 45,
            "h": 55,
            "s": 75
        },
        "id": 235,
        "types": [
            "ノーマル"
        ]
    },
    "ドーミラー": {
        "base_stats": {
            "a": 24,
            "b": 86,
            "c": 24,
            "d": 86,
            "h": 57,
            "s": 23
        },
        "id": 436,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "ナエトル": {
        "base_stats": {
            "a": 68,
            "b": 64,
            "c": 45,
            "d": 55,
            "h": 55,
            "s": 31
        },
        "id": 387,
        "types": [
            "くさ"
        ]
    },
    "ナカヌチャン": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 45,
            "d": 82,
            "h": 65,
            "s": 78
        },
        "id": 958,
        "types": [
            "フェアリー",
            "はがね"
        ]
    },
    "ナゲキ": {
        "base_stats": {
            "a": 100,
            "b": 85,
            "c": 30,
            "d": 85,
            "h": 120,
            "s": 45
        },
        "id": 538,
        "types": [
            "かくとう"
        ]
    },
    "ナゲツケサル": {
        "base_stats": {
            "a": 120,
            "b": 90,
            "c": 40,
            "d": 60,
            "h": 100,
            "s": 80
        },
        "id": 766,
        "types": [
            "かくとう"
        ]
    },
    "ナゾノクサ": {
        "base_stats": {
            "a": 50,
            "b": 55,
            "c": 75,
            "d": 65,
            "h": 45,
            "s": 30
        },
        "id": 43,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ナックラー": {
        "base_stats": {
            "a": 100,
            "b": 45,
            "c": 45,
            "d": 45,
            "h": 45,
            "s": 10
        },
        "id": 328,
        "types": [
            "じめん"
        ]
    },
    "ナッシー": {
        "base_stats": {
            "a": 95,
            "b": 85,
            "c": 125,
            "d": 75,
            "h": 95,
            "s": 55
        },
        "id": 103,
        "types": [
            "くさ",
            "エスパー"
        ]
    },
    "ナットレイ": {
        "base_stats": {
            "a": 94,
            "b": 131,
            "c": 54,
            "d": 116,
            "h": 74,
            "s": 20
        },
        "id": 598,
        "types": [
            "くさ",
            "はがね"
        ]
    },
    "ナマケロ": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 35,
            "d": 35,
            "h": 60,
            "s": 30
        },
        "id": 287,
        "types": [
            "ノーマル"
        ]
    },
    "ナマコブシ": {
        "base_stats": {
            "a": 60,
            "b": 130,
            "c": 30,
            "d": 130,
            "h": 55,
            "s": 5
        },
        "id": 771,
        "types": [
            "みず"
        ]
    },
    "ナマズン": {
        "base_stats": {
            "a": 78,
            "b": 73,
            "c": 76,
            "d": 71,
            "h": 110,
            "s": 60
        },
        "id": 340,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ナミイルカ": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 45,
            "d": 40,
            "h": 70,
            "s": 75
        },
        "id": 963,
        "types": [
            "みず"
        ]
    },
    "ニダンギル": {
        "base_stats": {
            "a": 110,
            "b": 150,
            "c": 45,
            "d": 49,
            "h": 59,
            "s": 35
        },
        "id": 680,
        "types": [
            "はがね",
            "ゴースト"
        ]
    },
    "ニドキング": {
        "base_stats": {
            "a": 102,
            "b": 77,
            "c": 85,
            "d": 75,
            "h": 81,
            "s": 85
        },
        "id": 34,
        "types": [
            "どく",
            "じめん"
        ]
    },
    "ニドクイン": {
        "base_stats": {
            "a": 92,
            "b": 87,
            "c": 75,
            "d": 85,
            "h": 90,
            "s": 76
        },
        "id": 31,
        "types": [
            "どく",
            "じめん"
        ]
    },
    "ニドラン♀": {
        "base_stats": {
            "a": 47,
            "b": 52,
            "c": 40,
            "d": 40,
            "h": 55,
            "s": 41
        },
        "id": 29,
        "types": [
            "どく"
        ]
    },
    "ニドラン♂": {
        "base_stats": {
            "a": 57,
            "b": 40,
            "c": 40,
            "d": 40,
            "h": 46,
            "s": 50
        },
        "id": 32,
        "types": [
            "どく"
        ]
    },
    "ニドリーナ": {
        "base_stats": {
            "a": 62,
            "b": 67,
            "c": 55,
            "d": 55,
            "h": 70,
            "s": 56
        },
        "id": 30,
        "types": [
            "どく"
        ]
    },
    "ニドリーノ": {
        "base_stats": {
            "a": 72,
            "b": 57,
            "c": 55,
            "d": 55,
            "h": 61,
            "s": 65
        },
        "id": 33,
        "types": [
            "どく"
        ]
    },
    "ニャイキング": {
        "base_stats": {
            "a": 110,
            "b": 100,
            "c": 50,
            "d": 60,
            "h": 70,
            "s": 50
        },
        "id": 863,
        "types": [
            "はがね"
        ]
    },
    "ニャオニクス": {
        "base_stats": {
            "a": 48,
            "b": 76,
            "c": 83,
            "d": 81,
            "h": 74,
            "s": 104
        },
        "id": 678,
        "types": [
            "エスパー"
        ]
    },
    "ニャオハ": {
        "base_stats": {
            "a": 61,
            "b": 54,
            "c": 45,
            "d": 45,
            "h": 40,
            "s": 65
        },
        "id": 906,
        "types": [
            "くさ"
        ]
    },
    "ニャスパー": {
        "base_stats": {
            "a": 48,
            "b": 54,
            "c": 63,
            "d": 60,
            "h": 62,
            "s": 68
        },
        "id": 677,
        "types": [
            "エスパー"
        ]
    },
    "ニャヒート": {
        "base_stats": {
            "a": 85,
            "b": 50,
            "c": 80,
            "d": 50,
            "h": 65,
            "s": 90
        },
        "id": 726,
        "types": [
            "ほのお"
        ]
    },
    "ニャビー": {
        "base_stats": {
            "a": 65,
            "b": 40,
            "c": 60,
            "d": 40,
            "h": 45,
            "s": 70
        },
        "id": 725,
        "types": [
            "ほのお"
        ]
    },
    "ニャルマー": {
        "base_stats": {
            "a": 55,
            "b": 42,
            "c": 42,
            "d": 37,
            "h": 49,
            "s": 85
        },
        "id": 431,
        "types": [
            "ノーマル"
        ]
    },
    "ニャローテ": {
        "base_stats": {
            "a": 80,
            "b": 63,
            "c": 60,
            "d": 63,
            "h": 61,
            "s": 83
        },
        "id": 907,
        "types": [
            "くさ"
        ]
    },
    "ニャース": {
        "base_stats": {
            "a": 45,
            "b": 35,
            "c": 40,
            "d": 40,
            "h": 40,
            "s": 90
        },
        "id": 52,
        "types": [
            "ノーマル"
        ]
    },
    "ニューラ": {
        "base_stats": {
            "a": 95,
            "b": 55,
            "c": 35,
            "d": 75,
            "h": 55,
            "s": 115
        },
        "id": 215,
        "types": [
            "あく",
            "こおり"
        ]
    },
    "ニョロゾ": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 50,
            "d": 50,
            "h": 65,
            "s": 90
        },
        "id": 61,
        "types": [
            "みず"
        ]
    },
    "ニョロトノ": {
        "base_stats": {
            "a": 75,
            "b": 75,
            "c": 90,
            "d": 100,
            "h": 90,
            "s": 70
        },
        "id": 186,
        "types": [
            "みず"
        ]
    },
    "ニョロボン": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 70,
            "d": 90,
            "h": 90,
            "s": 70
        },
        "id": 62,
        "types": [
            "みず",
            "かくとう"
        ]
    },
    "ニョロモ": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 40,
            "d": 40,
            "h": 40,
            "s": 90
        },
        "id": 60,
        "types": [
            "みず"
        ]
    },
    "ニンフィア": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 110,
            "d": 130,
            "h": 95,
            "s": 60
        },
        "id": 700,
        "types": [
            "フェアリー"
        ]
    },
    "ヌイコグマ": {
        "base_stats": {
            "a": 75,
            "b": 50,
            "c": 45,
            "d": 50,
            "h": 70,
            "s": 50
        },
        "id": 759,
        "types": [
            "ノーマル",
            "かくとう"
        ]
    },
    "ヌオー": {
        "base_stats": {
            "a": 85,
            "b": 85,
            "c": 65,
            "d": 65,
            "h": 95,
            "s": 35
        },
        "id": 195,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ヌケニン": {
        "base_stats": {
            "a": 90,
            "b": 45,
            "c": 30,
            "d": 30,
            "h": 1,
            "s": 40
        },
        "id": 292,
        "types": [
            "むし",
            "ゴースト"
        ]
    },
    "ヌマクロー": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 60,
            "d": 70,
            "h": 70,
            "s": 50
        },
        "id": 259,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ヌメイル": {
        "base_stats": {
            "a": 75,
            "b": 53,
            "c": 83,
            "d": 113,
            "h": 68,
            "s": 60
        },
        "id": 705,
        "types": [
            "ドラゴン"
        ]
    },
    "ヌメラ": {
        "base_stats": {
            "a": 50,
            "b": 35,
            "c": 55,
            "d": 75,
            "h": 45,
            "s": 40
        },
        "id": 704,
        "types": [
            "ドラゴン"
        ]
    },
    "ヌメルゴン": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 110,
            "d": 150,
            "h": 90,
            "s": 80
        },
        "id": 706,
        "types": [
            "ドラゴン"
        ]
    },
    "ネイティ": {
        "base_stats": {
            "a": 50,
            "b": 45,
            "c": 70,
            "d": 45,
            "h": 40,
            "s": 70
        },
        "id": 177,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "ネイティオ": {
        "base_stats": {
            "a": 75,
            "b": 70,
            "c": 95,
            "d": 70,
            "h": 65,
            "s": 95
        },
        "id": 178,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "ネオラント": {
        "base_stats": {
            "a": 69,
            "b": 76,
            "c": 69,
            "d": 86,
            "h": 69,
            "s": 91
        },
        "id": 457,
        "types": [
            "みず"
        ]
    },
    "ネギガナイト": {
        "base_stats": {
            "a": 135,
            "b": 95,
            "c": 68,
            "d": 82,
            "h": 62,
            "s": 65
        },
        "id": 865,
        "types": [
            "かくとう"
        ]
    },
    "ネクロズマ": {
        "base_stats": {
            "a": 107,
            "b": 101,
            "c": 127,
            "d": 89,
            "h": 97,
            "s": 79
        },
        "id": 800,
        "types": [
            "エスパー"
        ]
    },
    "ネッコアラ": {
        "base_stats": {
            "a": 115,
            "b": 65,
            "c": 75,
            "d": 95,
            "h": 65,
            "s": 65
        },
        "id": 775,
        "types": [
            "ノーマル"
        ]
    },
    "ネマシュ": {
        "base_stats": {
            "a": 35,
            "b": 55,
            "c": 65,
            "d": 75,
            "h": 40,
            "s": 15
        },
        "id": 755,
        "types": [
            "くさ",
            "フェアリー"
        ]
    },
    "ネンドール": {
        "base_stats": {
            "a": 70,
            "b": 105,
            "c": 70,
            "d": 120,
            "h": 60,
            "s": 75
        },
        "id": 344,
        "types": [
            "じめん",
            "エスパー"
        ]
    },
    "ノクタス": {
        "base_stats": {
            "a": 115,
            "b": 60,
            "c": 115,
            "d": 60,
            "h": 70,
            "s": 55
        },
        "id": 332,
        "types": [
            "くさ",
            "あく"
        ]
    },
    "ノココッチ": {
        "base_stats": {
            "a": 100,
            "b": 80,
            "c": 85,
            "d": 75,
            "h": 125,
            "s": 55
        },
        "id": 982,
        "types": [
            "ノーマル"
        ]
    },
    "ノコッチ": {
        "base_stats": {
            "a": 70,
            "b": 70,
            "c": 65,
            "d": 65,
            "h": 100,
            "s": 45
        },
        "id": 206,
        "types": [
            "ノーマル"
        ]
    },
    "ノズパス": {
        "base_stats": {
            "a": 45,
            "b": 135,
            "c": 45,
            "d": 90,
            "h": 30,
            "s": 30
        },
        "id": 299,
        "types": [
            "いわ"
        ]
    },
    "ノノクラゲ": {
        "base_stats": {
            "a": 40,
            "b": 35,
            "c": 50,
            "d": 100,
            "h": 40,
            "s": 70
        },
        "id": 948,
        "types": [
            "じめん",
            "くさ"
        ]
    },
    "ハカドッグ": {
        "base_stats": {
            "a": 101,
            "b": 100,
            "c": 50,
            "d": 97,
            "h": 72,
            "s": 68
        },
        "id": 972,
        "types": [
            "ゴースト"
        ]
    },
    "ハガネール": {
        "base_stats": {
            "a": 85,
            "b": 200,
            "c": 55,
            "d": 65,
            "h": 75,
            "s": 30
        },
        "id": 208,
        "types": [
            "はがね",
            "じめん"
        ]
    },
    "ハギギシリ": {
        "base_stats": {
            "a": 105,
            "b": 70,
            "c": 70,
            "d": 70,
            "h": 68,
            "s": 92
        },
        "id": 779,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ハクリュー": {
        "base_stats": {
            "a": 84,
            "b": 65,
            "c": 70,
            "d": 70,
            "h": 61,
            "s": 70
        },
        "id": 148,
        "types": [
            "ドラゴン"
        ]
    },
    "ハスブレロ": {
        "base_stats": {
            "a": 50,
            "b": 50,
            "c": 60,
            "d": 70,
            "h": 60,
            "s": 50
        },
        "id": 271,
        "types": [
            "みず",
            "くさ"
        ]
    },
    "ハスボー": {
        "base_stats": {
            "a": 30,
            "b": 30,
            "c": 40,
            "d": 50,
            "h": 40,
            "s": 30
        },
        "id": 270,
        "types": [
            "みず",
            "くさ"
        ]
    },
    "ハッサム": {
        "base_stats": {
            "a": 130,
            "b": 100,
            "c": 55,
            "d": 80,
            "h": 70,
            "s": 65
        },
        "id": 212,
        "types": [
            "むし",
            "はがね"
        ]
    },
    "ハトーボー": {
        "base_stats": {
            "a": 77,
            "b": 62,
            "c": 50,
            "d": 42,
            "h": 62,
            "s": 65
        },
        "id": 520,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ハネッコ": {
        "base_stats": {
            "a": 35,
            "b": 40,
            "c": 35,
            "d": 55,
            "h": 35,
            "s": 50
        },
        "id": 187,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "ハハコモリ": {
        "base_stats": {
            "a": 103,
            "b": 80,
            "c": 70,
            "d": 80,
            "h": 75,
            "s": 92
        },
        "id": 542,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "ハバタクカミ": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 135,
            "d": 135,
            "h": 55,
            "s": 135
        },
        "id": 987,
        "types": [
            "ゴースト",
            "フェアリー"
        ]
    },
    "ハピナス": {
        "base_stats": {
            "a": 10,
            "b": 10,
            "c": 75,
            "d": 135,
            "h": 255,
            "s": 55
        },
        "id": 242,
        "types": [
            "ノーマル"
        ]
    },
    "ハブネーク": {
        "base_stats": {
            "a": 100,
            "b": 60,
            "c": 100,
            "d": 60,
            "h": 73,
            "s": 65
        },
        "id": 336,
        "types": [
            "どく"
        ]
    },
    "ハヤシガメ": {
        "base_stats": {
            "a": 89,
            "b": 85,
            "c": 55,
            "d": 65,
            "h": 75,
            "s": 36
        },
        "id": 388,
        "types": [
            "くさ"
        ]
    },
    "ハラバリー": {
        "base_stats": {
            "a": 64,
            "b": 91,
            "c": 103,
            "d": 83,
            "h": 109,
            "s": 45
        },
        "id": 939,
        "types": [
            "でんき"
        ]
    },
    "ハリテヤマ": {
        "base_stats": {
            "a": 120,
            "b": 60,
            "c": 40,
            "d": 60,
            "h": 144,
            "s": 50
        },
        "id": 297,
        "types": [
            "かくとう"
        ]
    },
    "ハリボーグ": {
        "base_stats": {
            "a": 78,
            "b": 95,
            "c": 56,
            "d": 58,
            "h": 61,
            "s": 57
        },
        "id": 651,
        "types": [
            "くさ"
        ]
    },
    "ハリマロン": {
        "base_stats": {
            "a": 61,
            "b": 65,
            "c": 48,
            "d": 45,
            "h": 56,
            "s": 38
        },
        "id": 650,
        "types": [
            "くさ"
        ]
    },
    "ハリーセン": {
        "base_stats": {
            "a": 95,
            "b": 85,
            "c": 55,
            "d": 55,
            "h": 65,
            "s": 85
        },
        "id": 211,
        "types": [
            "みず",
            "どく"
        ]
    },
    "ハリーマン": {
        "base_stats": {
            "a": 115,
            "b": 95,
            "c": 65,
            "d": 65,
            "h": 85,
            "s": 85
        },
        "id": 904,
        "types": [
            "あく",
            "どく"
        ]
    },
    "ハルクジラ": {
        "base_stats": {
            "a": 113,
            "b": 65,
            "c": 45,
            "d": 55,
            "h": 170,
            "s": 73
        },
        "id": 975,
        "types": [
            "こおり"
        ]
    },
    "ハンテール": {
        "base_stats": {
            "a": 104,
            "b": 105,
            "c": 94,
            "d": 75,
            "h": 55,
            "s": 52
        },
        "id": 367,
        "types": [
            "みず"
        ]
    },
    "ハーデリア": {
        "base_stats": {
            "a": 80,
            "b": 65,
            "c": 35,
            "d": 65,
            "h": 65,
            "s": 60
        },
        "id": 507,
        "types": [
            "ノーマル"
        ]
    },
    "バイウールー": {
        "base_stats": {
            "a": 80,
            "b": 100,
            "c": 60,
            "d": 90,
            "h": 72,
            "s": 88
        },
        "id": 832,
        "types": [
            "ノーマル"
        ]
    },
    "バイバニラ": {
        "base_stats": {
            "a": 95,
            "b": 85,
            "c": 110,
            "d": 95,
            "h": 71,
            "s": 79
        },
        "id": 584,
        "types": [
            "こおり"
        ]
    },
    "バウッツェル": {
        "base_stats": {
            "a": 80,
            "b": 115,
            "c": 50,
            "d": 80,
            "h": 57,
            "s": 95
        },
        "id": 927,
        "types": [
            "フェアリー"
        ]
    },
    "バオッキー": {
        "base_stats": {
            "a": 98,
            "b": 63,
            "c": 98,
            "d": 63,
            "h": 75,
            "s": 101
        },
        "id": 514,
        "types": [
            "ほのお"
        ]
    },
    "バオップ": {
        "base_stats": {
            "a": 53,
            "b": 48,
            "c": 53,
            "d": 48,
            "h": 50,
            "s": 64
        },
        "id": 513,
        "types": [
            "ほのお"
        ]
    },
    "バクオング": {
        "base_stats": {
            "a": 91,
            "b": 63,
            "c": 91,
            "d": 73,
            "h": 104,
            "s": 68
        },
        "id": 295,
        "types": [
            "ノーマル"
        ]
    },
    "バクガメス": {
        "base_stats": {
            "a": 78,
            "b": 135,
            "c": 91,
            "d": 85,
            "h": 60,
            "s": 36
        },
        "id": 776,
        "types": [
            "ほのお",
            "ドラゴン"
        ]
    },
    "バクフーン": {
        "base_stats": {
            "a": 84,
            "b": 78,
            "c": 109,
            "d": 85,
            "h": 78,
            "s": 100
        },
        "id": 157,
        "types": [
            "ほのお"
        ]
    },
    "バクーダ": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 105,
            "d": 75,
            "h": 70,
            "s": 40
        },
        "id": 323,
        "types": [
            "ほのお",
            "じめん"
        ]
    },
    "バケッチャ": {
        "base_stats": {
            "a": 66,
            "b": 70,
            "c": 44,
            "d": 55,
            "h": 49,
            "s": 51
        },
        "id": 710,
        "types": [
            "ゴースト",
            "くさ"
        ]
    },
    "バサギリ": {
        "base_stats": {
            "a": 135,
            "b": 95,
            "c": 45,
            "d": 70,
            "h": 70,
            "s": 85
        },
        "id": 900,
        "types": [
            "むし",
            "いわ"
        ]
    },
    "バシャーモ": {
        "base_stats": {
            "a": 120,
            "b": 70,
            "c": 110,
            "d": 70,
            "h": 80,
            "s": 80
        },
        "id": 257,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "バスラオ": {
        "base_stats": {
            "a": 92,
            "b": 65,
            "c": 80,
            "d": 55,
            "h": 70,
            "s": 98
        },
        "id": 550,
        "types": [
            "みず"
        ]
    },
    "バタフリー": {
        "base_stats": {
            "a": 45,
            "b": 50,
            "c": 90,
            "d": 80,
            "h": 60,
            "s": 70
        },
        "id": 12,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "バチュル": {
        "base_stats": {
            "a": 47,
            "b": 50,
            "c": 57,
            "d": 50,
            "h": 50,
            "s": 65
        },
        "id": 595,
        "types": [
            "むし",
            "でんき"
        ]
    },
    "バチンウニ": {
        "base_stats": {
            "a": 101,
            "b": 95,
            "c": 91,
            "d": 85,
            "h": 48,
            "s": 15
        },
        "id": 871,
        "types": [
            "でんき"
        ]
    },
    "バチンキー": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 55,
            "d": 60,
            "h": 70,
            "s": 80
        },
        "id": 811,
        "types": [
            "くさ"
        ]
    },
    "バッフロン": {
        "base_stats": {
            "a": 110,
            "b": 95,
            "c": 40,
            "d": 95,
            "h": 95,
            "s": 55
        },
        "id": 626,
        "types": [
            "ノーマル"
        ]
    },
    "バドレックス": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 80,
            "d": 80,
            "h": 100,
            "s": 80
        },
        "id": 898,
        "types": [
            "エスパー",
            "くさ"
        ]
    },
    "バニプッチ": {
        "base_stats": {
            "a": 50,
            "b": 50,
            "c": 65,
            "d": 60,
            "h": 36,
            "s": 44
        },
        "id": 582,
        "types": [
            "こおり"
        ]
    },
    "バニリッチ": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 80,
            "d": 75,
            "h": 51,
            "s": 59
        },
        "id": 583,
        "types": [
            "こおり"
        ]
    },
    "バネブー": {
        "base_stats": {
            "a": 25,
            "b": 35,
            "c": 70,
            "d": 80,
            "h": 60,
            "s": 60
        },
        "id": 325,
        "types": [
            "エスパー"
        ]
    },
    "バリコオル": {
        "base_stats": {
            "a": 85,
            "b": 75,
            "c": 110,
            "d": 100,
            "h": 80,
            "s": 70
        },
        "id": 866,
        "types": [
            "こおり",
            "エスパー"
        ]
    },
    "バリヤード": {
        "base_stats": {
            "a": 45,
            "b": 65,
            "c": 100,
            "d": 120,
            "h": 40,
            "s": 90
        },
        "id": 122,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "バルキー": {
        "base_stats": {
            "a": 35,
            "b": 35,
            "c": 35,
            "d": 35,
            "h": 35,
            "s": 35
        },
        "id": 236,
        "types": [
            "かくとう"
        ]
    },
    "バルジーナ": {
        "base_stats": {
            "a": 65,
            "b": 105,
            "c": 55,
            "d": 95,
            "h": 110,
            "s": 80
        },
        "id": 630,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "バルチャイ": {
        "base_stats": {
            "a": 55,
            "b": 75,
            "c": 45,
            "d": 65,
            "h": 70,
            "s": 60
        },
        "id": 629,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "バルビート": {
        "base_stats": {
            "a": 73,
            "b": 75,
            "c": 47,
            "d": 85,
            "h": 65,
            "s": 85
        },
        "id": 313,
        "types": [
            "むし"
        ]
    },
    "バンギラス": {
        "base_stats": {
            "a": 134,
            "b": 110,
            "c": 95,
            "d": 100,
            "h": 100,
            "s": 61
        },
        "id": 248,
        "types": [
            "いわ",
            "あく"
        ]
    },
    "バンバドロ": {
        "base_stats": {
            "a": 125,
            "b": 100,
            "c": 55,
            "d": 85,
            "h": 100,
            "s": 35
        },
        "id": 750,
        "types": [
            "じめん"
        ]
    },
    "パウワウ": {
        "base_stats": {
            "a": 45,
            "b": 55,
            "c": 45,
            "d": 70,
            "h": 65,
            "s": 45
        },
        "id": 86,
        "types": [
            "みず"
        ]
    },
    "パオジアン": {
        "base_stats": {
            "a": 120,
            "b": 80,
            "c": 90,
            "d": 65,
            "h": 80,
            "s": 135
        },
        "id": 1002,
        "types": [
            "あく",
            "こおり"
        ]
    },
    "パチリス": {
        "base_stats": {
            "a": 45,
            "b": 70,
            "c": 45,
            "d": 90,
            "h": 60,
            "s": 95
        },
        "id": 417,
        "types": [
            "でんき"
        ]
    },
    "パッチラゴン": {
        "base_stats": {
            "a": 100,
            "b": 90,
            "c": 80,
            "d": 70,
            "h": 90,
            "s": 75
        },
        "id": 880,
        "types": [
            "でんき",
            "ドラゴン"
        ]
    },
    "パッチルドン": {
        "base_stats": {
            "a": 100,
            "b": 90,
            "c": 90,
            "d": 80,
            "h": 90,
            "s": 55
        },
        "id": 881,
        "types": [
            "でんき",
            "こおり"
        ]
    },
    "パッチール": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 60,
            "d": 60,
            "h": 60,
            "s": 60
        },
        "id": 327,
        "types": [
            "ノーマル"
        ]
    },
    "パピモッチ": {
        "base_stats": {
            "a": 55,
            "b": 70,
            "c": 30,
            "d": 55,
            "h": 37,
            "s": 65
        },
        "id": 926,
        "types": [
            "フェアリー"
        ]
    },
    "パフュートン": {
        "base_stats": {
            "a": 100,
            "b": 75,
            "c": 59,
            "d": 80,
            "h": 110,
            "s": 65
        },
        "id": 916,
        "types": [
            "ノーマル"
        ]
    },
    "パモ": {
        "base_stats": {
            "a": 50,
            "b": 20,
            "c": 40,
            "d": 25,
            "h": 45,
            "s": 60
        },
        "id": 921,
        "types": [
            "でんき"
        ]
    },
    "パモット": {
        "base_stats": {
            "a": 75,
            "b": 40,
            "c": 50,
            "d": 40,
            "h": 60,
            "s": 85
        },
        "id": 922,
        "types": [
            "でんき",
            "かくとう"
        ]
    },
    "パラス": {
        "base_stats": {
            "a": 70,
            "b": 55,
            "c": 45,
            "d": 55,
            "h": 35,
            "s": 25
        },
        "id": 46,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "パラセクト": {
        "base_stats": {
            "a": 95,
            "b": 80,
            "c": 60,
            "d": 80,
            "h": 60,
            "s": 30
        },
        "id": 47,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "パルキア": {
        "base_stats": {
            "a": 120,
            "b": 100,
            "c": 150,
            "d": 120,
            "h": 90,
            "s": 100
        },
        "id": 484,
        "types": [
            "みず",
            "ドラゴン"
        ]
    },
    "パルシェン": {
        "base_stats": {
            "a": 95,
            "b": 180,
            "c": 85,
            "d": 45,
            "h": 50,
            "s": 70
        },
        "id": 91,
        "types": [
            "みず",
            "こおり"
        ]
    },
    "パルスワン": {
        "base_stats": {
            "a": 90,
            "b": 60,
            "c": 90,
            "d": 60,
            "h": 69,
            "s": 121
        },
        "id": 836,
        "types": [
            "でんき"
        ]
    },
    "パンプジン": {
        "base_stats": {
            "a": 90,
            "b": 122,
            "c": 58,
            "d": 75,
            "h": 65,
            "s": 84
        },
        "id": 711,
        "types": [
            "ゴースト",
            "くさ"
        ]
    },
    "パーモット": {
        "base_stats": {
            "a": 115,
            "b": 70,
            "c": 70,
            "d": 60,
            "h": 70,
            "s": 105
        },
        "id": 923,
        "types": [
            "でんき",
            "かくとう"
        ]
    },
    "パールル": {
        "base_stats": {
            "a": 64,
            "b": 85,
            "c": 74,
            "d": 55,
            "h": 35,
            "s": 32
        },
        "id": 366,
        "types": [
            "みず"
        ]
    },
    "ヒコザル": {
        "base_stats": {
            "a": 58,
            "b": 44,
            "c": 58,
            "d": 44,
            "h": 44,
            "s": 61
        },
        "id": 390,
        "types": [
            "ほのお"
        ]
    },
    "ヒトカゲ": {
        "base_stats": {
            "a": 52,
            "b": 43,
            "c": 60,
            "d": 50,
            "h": 39,
            "s": 65
        },
        "id": 4,
        "types": [
            "ほのお"
        ]
    },
    "ヒトツキ": {
        "base_stats": {
            "a": 80,
            "b": 100,
            "c": 35,
            "d": 37,
            "h": 45,
            "s": 28
        },
        "id": 679,
        "types": [
            "はがね",
            "ゴースト"
        ]
    },
    "ヒトデマン": {
        "base_stats": {
            "a": 45,
            "b": 55,
            "c": 70,
            "d": 55,
            "h": 30,
            "s": 85
        },
        "id": 120,
        "types": [
            "みず"
        ]
    },
    "ヒトモシ": {
        "base_stats": {
            "a": 30,
            "b": 55,
            "c": 65,
            "d": 55,
            "h": 50,
            "s": 20
        },
        "id": 607,
        "types": [
            "ゴースト",
            "ほのお"
        ]
    },
    "ヒドイデ": {
        "base_stats": {
            "a": 53,
            "b": 62,
            "c": 43,
            "d": 52,
            "h": 50,
            "s": 45
        },
        "id": 747,
        "types": [
            "どく",
            "みず"
        ]
    },
    "ヒノアラシ": {
        "base_stats": {
            "a": 52,
            "b": 43,
            "c": 60,
            "d": 50,
            "h": 39,
            "s": 65
        },
        "id": 155,
        "types": [
            "ほのお"
        ]
    },
    "ヒノヤコマ": {
        "base_stats": {
            "a": 73,
            "b": 55,
            "c": 56,
            "d": 52,
            "h": 62,
            "s": 84
        },
        "id": 662,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "ヒバニー": {
        "base_stats": {
            "a": 71,
            "b": 40,
            "c": 40,
            "d": 40,
            "h": 50,
            "s": 69
        },
        "id": 813,
        "types": [
            "ほのお"
        ]
    },
    "ヒヒダルマ": {
        "base_stats": {
            "a": 140,
            "b": 55,
            "c": 30,
            "d": 55,
            "h": 105,
            "s": 95
        },
        "id": 555,
        "types": [
            "ほのお"
        ]
    },
    "ヒポポタス": {
        "base_stats": {
            "a": 72,
            "b": 78,
            "c": 38,
            "d": 42,
            "h": 68,
            "s": 32
        },
        "id": 449,
        "types": [
            "じめん"
        ]
    },
    "ヒマナッツ": {
        "base_stats": {
            "a": 30,
            "b": 30,
            "c": 30,
            "d": 30,
            "h": 30,
            "s": 30
        },
        "id": 191,
        "types": [
            "くさ"
        ]
    },
    "ヒメグマ": {
        "base_stats": {
            "a": 80,
            "b": 50,
            "c": 50,
            "d": 50,
            "h": 60,
            "s": 40
        },
        "id": 216,
        "types": [
            "ノーマル"
        ]
    },
    "ヒメンカ": {
        "base_stats": {
            "a": 40,
            "b": 60,
            "c": 40,
            "d": 60,
            "h": 40,
            "s": 10
        },
        "id": 829,
        "types": [
            "くさ"
        ]
    },
    "ヒヤッキー": {
        "base_stats": {
            "a": 98,
            "b": 63,
            "c": 98,
            "d": 63,
            "h": 75,
            "s": 101
        },
        "id": 516,
        "types": [
            "みず"
        ]
    },
    "ヒヤップ": {
        "base_stats": {
            "a": 53,
            "b": 48,
            "c": 53,
            "d": 48,
            "h": 50,
            "s": 64
        },
        "id": 515,
        "types": [
            "みず"
        ]
    },
    "ヒラヒナ": {
        "base_stats": {
            "a": 35,
            "b": 30,
            "c": 55,
            "d": 30,
            "h": 30,
            "s": 75
        },
        "id": 955,
        "types": [
            "エスパー"
        ]
    },
    "ヒンバス": {
        "base_stats": {
            "a": 15,
            "b": 20,
            "c": 10,
            "d": 55,
            "h": 20,
            "s": 80
        },
        "id": 349,
        "types": [
            "みず"
        ]
    },
    "ヒードラン": {
        "base_stats": {
            "a": 90,
            "b": 106,
            "c": 130,
            "d": 106,
            "h": 91,
            "s": 77
        },
        "id": 485,
        "types": [
            "ほのお",
            "はがね"
        ]
    },
    "ビクティニ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 494,
        "types": [
            "エスパー",
            "ほのお"
        ]
    },
    "ビッパ": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 35,
            "d": 40,
            "h": 59,
            "s": 31
        },
        "id": 399,
        "types": [
            "ノーマル"
        ]
    },
    "ビビヨン": {
        "base_stats": {
            "a": 52,
            "b": 50,
            "c": 90,
            "d": 50,
            "h": 80,
            "s": 89
        },
        "id": 666,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "ビブラーバ": {
        "base_stats": {
            "a": 70,
            "b": 50,
            "c": 50,
            "d": 50,
            "h": 50,
            "s": 70
        },
        "id": 329,
        "types": [
            "じめん",
            "ドラゴン"
        ]
    },
    "ビリジオン": {
        "base_stats": {
            "a": 90,
            "b": 72,
            "c": 90,
            "d": 129,
            "h": 91,
            "s": 108
        },
        "id": 640,
        "types": [
            "くさ",
            "かくとう"
        ]
    },
    "ビリリダマ": {
        "base_stats": {
            "a": 30,
            "b": 50,
            "c": 55,
            "d": 55,
            "h": 40,
            "s": 100
        },
        "id": 100,
        "types": [
            "でんき"
        ]
    },
    "ビークイン": {
        "base_stats": {
            "a": 80,
            "b": 102,
            "c": 80,
            "d": 102,
            "h": 70,
            "s": 40
        },
        "id": 416,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "ビーダル": {
        "base_stats": {
            "a": 85,
            "b": 60,
            "c": 55,
            "d": 60,
            "h": 79,
            "s": 71
        },
        "id": 400,
        "types": [
            "ノーマル",
            "みず"
        ]
    },
    "ビードル": {
        "base_stats": {
            "a": 35,
            "b": 30,
            "c": 20,
            "d": 20,
            "h": 40,
            "s": 50
        },
        "id": 13,
        "types": [
            "むし",
            "どく"
        ]
    },
    "ピィ": {
        "base_stats": {
            "a": 25,
            "b": 28,
            "c": 45,
            "d": 55,
            "h": 50,
            "s": 15
        },
        "id": 173,
        "types": [
            "フェアリー"
        ]
    },
    "ピカチュウ": {
        "base_stats": {
            "a": 55,
            "b": 40,
            "c": 50,
            "d": 50,
            "h": 35,
            "s": 90
        },
        "id": 25,
        "types": [
            "でんき"
        ]
    },
    "ピクシー": {
        "base_stats": {
            "a": 70,
            "b": 73,
            "c": 95,
            "d": 90,
            "h": 95,
            "s": 60
        },
        "id": 36,
        "types": [
            "フェアリー"
        ]
    },
    "ピジョット": {
        "base_stats": {
            "a": 80,
            "b": 75,
            "c": 70,
            "d": 70,
            "h": 83,
            "s": 101
        },
        "id": 18,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ピジョン": {
        "base_stats": {
            "a": 60,
            "b": 55,
            "c": 50,
            "d": 50,
            "h": 63,
            "s": 71
        },
        "id": 17,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ピチュー": {
        "base_stats": {
            "a": 40,
            "b": 15,
            "c": 35,
            "d": 35,
            "h": 20,
            "s": 60
        },
        "id": 172,
        "types": [
            "でんき"
        ]
    },
    "ピッピ": {
        "base_stats": {
            "a": 45,
            "b": 48,
            "c": 60,
            "d": 65,
            "h": 70,
            "s": 35
        },
        "id": 35,
        "types": [
            "フェアリー"
        ]
    },
    "ピンプク": {
        "base_stats": {
            "a": 5,
            "b": 5,
            "c": 15,
            "d": 65,
            "h": 100,
            "s": 30
        },
        "id": 440,
        "types": [
            "ノーマル"
        ]
    },
    "ファイアロー": {
        "base_stats": {
            "a": 81,
            "b": 71,
            "c": 74,
            "d": 69,
            "h": 78,
            "s": 126
        },
        "id": 663,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "ファイヤー": {
        "base_stats": {
            "a": 100,
            "b": 90,
            "c": 125,
            "d": 85,
            "h": 90,
            "s": 90
        },
        "id": 146,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "フィオネ": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 80,
            "d": 80,
            "h": 80,
            "s": 80
        },
        "id": 489,
        "types": [
            "みず"
        ]
    },
    "フェローチェ": {
        "base_stats": {
            "a": 137,
            "b": 37,
            "c": 137,
            "d": 37,
            "h": 71,
            "s": 151
        },
        "id": 795,
        "types": [
            "むし",
            "かくとう"
        ]
    },
    "フォクスライ": {
        "base_stats": {
            "a": 58,
            "b": 58,
            "c": 87,
            "d": 92,
            "h": 70,
            "s": 90
        },
        "id": 828,
        "types": [
            "あく"
        ]
    },
    "フォッコ": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 62,
            "d": 60,
            "h": 40,
            "s": 60
        },
        "id": 653,
        "types": [
            "ほのお"
        ]
    },
    "フォレトス": {
        "base_stats": {
            "a": 90,
            "b": 140,
            "c": 60,
            "d": 60,
            "h": 75,
            "s": 40
        },
        "id": 205,
        "types": [
            "むし",
            "はがね"
        ]
    },
    "フカマル": {
        "base_stats": {
            "a": 70,
            "b": 45,
            "c": 40,
            "d": 45,
            "h": 58,
            "s": 42
        },
        "id": 443,
        "types": [
            "ドラゴン",
            "じめん"
        ]
    },
    "フクスロー": {
        "base_stats": {
            "a": 75,
            "b": 75,
            "c": 70,
            "d": 70,
            "h": 78,
            "s": 52
        },
        "id": 723,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "フシギソウ": {
        "base_stats": {
            "a": 62,
            "b": 63,
            "c": 80,
            "d": 80,
            "h": 60,
            "s": 60
        },
        "id": 2,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "フシギダネ": {
        "base_stats": {
            "a": 49,
            "b": 49,
            "c": 65,
            "d": 65,
            "h": 45,
            "s": 45
        },
        "id": 1,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "フシギバナ": {
        "base_stats": {
            "a": 82,
            "b": 83,
            "c": 100,
            "d": 100,
            "h": 80,
            "s": 80
        },
        "id": 3,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "フシデ": {
        "base_stats": {
            "a": 45,
            "b": 59,
            "c": 30,
            "d": 39,
            "h": 30,
            "s": 57
        },
        "id": 543,
        "types": [
            "むし",
            "どく"
        ]
    },
    "フタチマル": {
        "base_stats": {
            "a": 75,
            "b": 60,
            "c": 83,
            "d": 60,
            "h": 75,
            "s": 60
        },
        "id": 502,
        "types": [
            "みず"
        ]
    },
    "フライゴン": {
        "base_stats": {
            "a": 100,
            "b": 80,
            "c": 80,
            "d": 80,
            "h": 80,
            "s": 100
        },
        "id": 330,
        "types": [
            "じめん",
            "ドラゴン"
        ]
    },
    "フラエッテ": {
        "base_stats": {
            "a": 45,
            "b": 47,
            "c": 75,
            "d": 98,
            "h": 54,
            "s": 52
        },
        "id": 670,
        "types": [
            "フェアリー"
        ]
    },
    "フラベベ": {
        "base_stats": {
            "a": 38,
            "b": 39,
            "c": 61,
            "d": 79,
            "h": 44,
            "s": 42
        },
        "id": 669,
        "types": [
            "フェアリー"
        ]
    },
    "フラージェス": {
        "base_stats": {
            "a": 65,
            "b": 68,
            "c": 112,
            "d": 154,
            "h": 78,
            "s": 75
        },
        "id": 671,
        "types": [
            "フェアリー"
        ]
    },
    "フリーザー": {
        "base_stats": {
            "a": 85,
            "b": 100,
            "c": 95,
            "d": 125,
            "h": 90,
            "s": 85
        },
        "id": 144,
        "types": [
            "こおり",
            "ひこう"
        ]
    },
    "フリージオ": {
        "base_stats": {
            "a": 50,
            "b": 50,
            "c": 95,
            "d": 135,
            "h": 80,
            "s": 105
        },
        "id": 615,
        "types": [
            "こおり"
        ]
    },
    "フレフワン": {
        "base_stats": {
            "a": 72,
            "b": 72,
            "c": 99,
            "d": 89,
            "h": 101,
            "s": 29
        },
        "id": 683,
        "types": [
            "フェアリー"
        ]
    },
    "フローゼル": {
        "base_stats": {
            "a": 105,
            "b": 55,
            "c": 85,
            "d": 50,
            "h": 85,
            "s": 115
        },
        "id": 419,
        "types": [
            "みず"
        ]
    },
    "フワライド": {
        "base_stats": {
            "a": 80,
            "b": 44,
            "c": 90,
            "d": 54,
            "h": 150,
            "s": 80
        },
        "id": 426,
        "types": [
            "ゴースト",
            "ひこう"
        ]
    },
    "フワンテ": {
        "base_stats": {
            "a": 50,
            "b": 34,
            "c": 60,
            "d": 44,
            "h": 90,
            "s": 70
        },
        "id": 425,
        "types": [
            "ゴースト",
            "ひこう"
        ]
    },
    "フーディン": {
        "base_stats": {
            "a": 50,
            "b": 45,
            "c": 135,
            "d": 95,
            "h": 55,
            "s": 120
        },
        "id": 65,
        "types": [
            "エスパー"
        ]
    },
    "フーパ": {
        "base_stats": {
            "a": 110,
            "b": 60,
            "c": 150,
            "d": 130,
            "h": 80,
            "s": 70
        },
        "id": 720,
        "types": [
            "エスパー",
            "ゴースト"
        ]
    },
    "ブイゼル": {
        "base_stats": {
            "a": 65,
            "b": 35,
            "c": 60,
            "d": 30,
            "h": 55,
            "s": 85
        },
        "id": 418,
        "types": [
            "みず"
        ]
    },
    "ブニャット": {
        "base_stats": {
            "a": 82,
            "b": 64,
            "c": 64,
            "d": 59,
            "h": 71,
            "s": 112
        },
        "id": 432,
        "types": [
            "ノーマル"
        ]
    },
    "ブビィ": {
        "base_stats": {
            "a": 75,
            "b": 37,
            "c": 70,
            "d": 55,
            "h": 45,
            "s": 83
        },
        "id": 240,
        "types": [
            "ほのお"
        ]
    },
    "ブラッキー": {
        "base_stats": {
            "a": 65,
            "b": 110,
            "c": 60,
            "d": 130,
            "h": 95,
            "s": 65
        },
        "id": 197,
        "types": [
            "あく"
        ]
    },
    "ブリガロン": {
        "base_stats": {
            "a": 107,
            "b": 122,
            "c": 74,
            "d": 75,
            "h": 88,
            "s": 64
        },
        "id": 652,
        "types": [
            "くさ",
            "かくとう"
        ]
    },
    "ブリザポス": {
        "base_stats": {
            "a": 145,
            "b": 130,
            "c": 65,
            "d": 110,
            "h": 100,
            "s": 30
        },
        "id": 896,
        "types": [
            "こおり"
        ]
    },
    "ブリムオン": {
        "base_stats": {
            "a": 90,
            "b": 95,
            "c": 136,
            "d": 103,
            "h": 57,
            "s": 29
        },
        "id": 858,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "ブルンゲル": {
        "base_stats": {
            "a": 60,
            "b": 70,
            "c": 85,
            "d": 105,
            "h": 100,
            "s": 60
        },
        "id": 593,
        "types": [
            "みず",
            "ゴースト"
        ]
    },
    "ブルー": {
        "base_stats": {
            "a": 80,
            "b": 50,
            "c": 40,
            "d": 40,
            "h": 60,
            "s": 30
        },
        "id": 209,
        "types": [
            "フェアリー"
        ]
    },
    "ブロスター": {
        "base_stats": {
            "a": 73,
            "b": 88,
            "c": 120,
            "d": 89,
            "h": 71,
            "s": 59
        },
        "id": 693,
        "types": [
            "みず"
        ]
    },
    "ブロロローム": {
        "base_stats": {
            "a": 119,
            "b": 90,
            "c": 54,
            "d": 67,
            "h": 80,
            "s": 90
        },
        "id": 966,
        "types": [
            "はがね",
            "どく"
        ]
    },
    "ブロロン": {
        "base_stats": {
            "a": 70,
            "b": 63,
            "c": 30,
            "d": 45,
            "h": 45,
            "s": 47
        },
        "id": 965,
        "types": [
            "はがね",
            "どく"
        ]
    },
    "ブースター": {
        "base_stats": {
            "a": 130,
            "b": 60,
            "c": 95,
            "d": 110,
            "h": 65,
            "s": 65
        },
        "id": 136,
        "types": [
            "ほのお"
        ]
    },
    "ブーバー": {
        "base_stats": {
            "a": 95,
            "b": 57,
            "c": 100,
            "d": 85,
            "h": 65,
            "s": 93
        },
        "id": 126,
        "types": [
            "ほのお"
        ]
    },
    "ブーバーン": {
        "base_stats": {
            "a": 95,
            "b": 67,
            "c": 125,
            "d": 95,
            "h": 75,
            "s": 83
        },
        "id": 467,
        "types": [
            "ほのお"
        ]
    },
    "ブーピッグ": {
        "base_stats": {
            "a": 45,
            "b": 65,
            "c": 90,
            "d": 110,
            "h": 80,
            "s": 80
        },
        "id": 326,
        "types": [
            "エスパー"
        ]
    },
    "プクリン": {
        "base_stats": {
            "a": 70,
            "b": 45,
            "c": 85,
            "d": 50,
            "h": 140,
            "s": 45
        },
        "id": 40,
        "types": [
            "ノーマル",
            "フェアリー"
        ]
    },
    "プテラ": {
        "base_stats": {
            "a": 105,
            "b": 65,
            "c": 60,
            "d": 75,
            "h": 80,
            "s": 130
        },
        "id": 142,
        "types": [
            "いわ",
            "ひこう"
        ]
    },
    "ププリン": {
        "base_stats": {
            "a": 30,
            "b": 15,
            "c": 40,
            "d": 20,
            "h": 90,
            "s": 15
        },
        "id": 174,
        "types": [
            "ノーマル",
            "フェアリー"
        ]
    },
    "プラスル": {
        "base_stats": {
            "a": 50,
            "b": 40,
            "c": 85,
            "d": 75,
            "h": 60,
            "s": 95
        },
        "id": 311,
        "types": [
            "でんき"
        ]
    },
    "プリン": {
        "base_stats": {
            "a": 45,
            "b": 20,
            "c": 45,
            "d": 25,
            "h": 115,
            "s": 20
        },
        "id": 39,
        "types": [
            "ノーマル",
            "フェアリー"
        ]
    },
    "プルリル": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 65,
            "d": 85,
            "h": 55,
            "s": 40
        },
        "id": 592,
        "types": [
            "みず",
            "ゴースト"
        ]
    },
    "プロトーガ": {
        "base_stats": {
            "a": 78,
            "b": 103,
            "c": 53,
            "d": 45,
            "h": 54,
            "s": 22
        },
        "id": 564,
        "types": [
            "みず",
            "いわ"
        ]
    },
    "ヘイガニ": {
        "base_stats": {
            "a": 80,
            "b": 65,
            "c": 50,
            "d": 35,
            "h": 43,
            "s": 35
        },
        "id": 341,
        "types": [
            "みず"
        ]
    },
    "ヘイラッシャ": {
        "base_stats": {
            "a": 100,
            "b": 115,
            "c": 65,
            "d": 65,
            "h": 150,
            "s": 35
        },
        "id": 977,
        "types": [
            "みず"
        ]
    },
    "ヘラクロス": {
        "base_stats": {
            "a": 125,
            "b": 75,
            "c": 40,
            "d": 95,
            "h": 80,
            "s": 85
        },
        "id": 214,
        "types": [
            "むし",
            "かくとう"
        ]
    },
    "ヘルガー": {
        "base_stats": {
            "a": 90,
            "b": 50,
            "c": 110,
            "d": 80,
            "h": 75,
            "s": 95
        },
        "id": 229,
        "types": [
            "あく",
            "ほのお"
        ]
    },
    "ベイリーフ": {
        "base_stats": {
            "a": 62,
            "b": 80,
            "c": 63,
            "d": 80,
            "h": 60,
            "s": 60
        },
        "id": 153,
        "types": [
            "くさ"
        ]
    },
    "ベトベター": {
        "base_stats": {
            "a": 80,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 80,
            "s": 25
        },
        "id": 88,
        "types": [
            "どく"
        ]
    },
    "ベトベトン": {
        "base_stats": {
            "a": 105,
            "b": 75,
            "c": 65,
            "d": 100,
            "h": 105,
            "s": 50
        },
        "id": 89,
        "types": [
            "どく"
        ]
    },
    "ベベノム": {
        "base_stats": {
            "a": 73,
            "b": 67,
            "c": 73,
            "d": 67,
            "h": 67,
            "s": 73
        },
        "id": 803,
        "types": [
            "どく"
        ]
    },
    "ベラカス": {
        "base_stats": {
            "a": 50,
            "b": 85,
            "c": 115,
            "d": 100,
            "h": 75,
            "s": 45
        },
        "id": 954,
        "types": [
            "むし",
            "エスパー"
        ]
    },
    "ベロバー": {
        "base_stats": {
            "a": 45,
            "b": 30,
            "c": 55,
            "d": 40,
            "h": 45,
            "s": 50
        },
        "id": 859,
        "types": [
            "あく",
            "フェアリー"
        ]
    },
    "ベロベルト": {
        "base_stats": {
            "a": 85,
            "b": 95,
            "c": 80,
            "d": 95,
            "h": 110,
            "s": 50
        },
        "id": 463,
        "types": [
            "ノーマル"
        ]
    },
    "ベロリンガ": {
        "base_stats": {
            "a": 55,
            "b": 75,
            "c": 60,
            "d": 75,
            "h": 90,
            "s": 30
        },
        "id": 108,
        "types": [
            "ノーマル"
        ]
    },
    "ペラップ": {
        "base_stats": {
            "a": 65,
            "b": 45,
            "c": 92,
            "d": 42,
            "h": 76,
            "s": 91
        },
        "id": 441,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ペリッパー": {
        "base_stats": {
            "a": 50,
            "b": 100,
            "c": 95,
            "d": 70,
            "h": 60,
            "s": 65
        },
        "id": 279,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "ペルシアン": {
        "base_stats": {
            "a": 70,
            "b": 60,
            "c": 65,
            "d": 65,
            "h": 65,
            "s": 115
        },
        "id": 53,
        "types": [
            "ノーマル"
        ]
    },
    "ペロッパフ": {
        "base_stats": {
            "a": 48,
            "b": 66,
            "c": 59,
            "d": 57,
            "h": 62,
            "s": 49
        },
        "id": 684,
        "types": [
            "フェアリー"
        ]
    },
    "ペロリーム": {
        "base_stats": {
            "a": 80,
            "b": 86,
            "c": 85,
            "d": 75,
            "h": 82,
            "s": 72
        },
        "id": 685,
        "types": [
            "フェアリー"
        ]
    },
    "ペンドラー": {
        "base_stats": {
            "a": 100,
            "b": 89,
            "c": 55,
            "d": 69,
            "h": 60,
            "s": 112
        },
        "id": 545,
        "types": [
            "むし",
            "どく"
        ]
    },
    "ホイーガ": {
        "base_stats": {
            "a": 55,
            "b": 99,
            "c": 40,
            "d": 79,
            "h": 40,
            "s": 47
        },
        "id": 544,
        "types": [
            "むし",
            "どく"
        ]
    },
    "ホウオウ": {
        "base_stats": {
            "a": 130,
            "b": 90,
            "c": 110,
            "d": 154,
            "h": 106,
            "s": 90
        },
        "id": 250,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "ホエルオー": {
        "base_stats": {
            "a": 90,
            "b": 45,
            "c": 90,
            "d": 45,
            "h": 170,
            "s": 60
        },
        "id": 321,
        "types": [
            "みず"
        ]
    },
    "ホエルコ": {
        "base_stats": {
            "a": 70,
            "b": 35,
            "c": 70,
            "d": 35,
            "h": 130,
            "s": 60
        },
        "id": 320,
        "types": [
            "みず"
        ]
    },
    "ホゲータ": {
        "base_stats": {
            "a": 45,
            "b": 59,
            "c": 63,
            "d": 40,
            "h": 67,
            "s": 36
        },
        "id": 909,
        "types": [
            "ほのお"
        ]
    },
    "ホシガリス": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 35,
            "d": 35,
            "h": 70,
            "s": 25
        },
        "id": 819,
        "types": [
            "ノーマル"
        ]
    },
    "ホルビー": {
        "base_stats": {
            "a": 36,
            "b": 38,
            "c": 32,
            "d": 36,
            "h": 38,
            "s": 57
        },
        "id": 659,
        "types": [
            "ノーマル"
        ]
    },
    "ホルード": {
        "base_stats": {
            "a": 56,
            "b": 77,
            "c": 50,
            "d": 77,
            "h": 85,
            "s": 78
        },
        "id": 660,
        "types": [
            "ノーマル",
            "じめん"
        ]
    },
    "ホーホー": {
        "base_stats": {
            "a": 30,
            "b": 30,
            "c": 36,
            "d": 56,
            "h": 60,
            "s": 50
        },
        "id": 163,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ボクレー": {
        "base_stats": {
            "a": 70,
            "b": 48,
            "c": 50,
            "d": 60,
            "h": 43,
            "s": 38
        },
        "id": 708,
        "types": [
            "ゴースト",
            "くさ"
        ]
    },
    "ボスゴドラ": {
        "base_stats": {
            "a": 110,
            "b": 180,
            "c": 60,
            "d": 60,
            "h": 70,
            "s": 50
        },
        "id": 306,
        "types": [
            "はがね",
            "いわ"
        ]
    },
    "ボチ": {
        "base_stats": {
            "a": 61,
            "b": 60,
            "c": 30,
            "d": 55,
            "h": 50,
            "s": 34
        },
        "id": 971,
        "types": [
            "ゴースト"
        ]
    },
    "ボルケニオン": {
        "base_stats": {
            "a": 110,
            "b": 120,
            "c": 130,
            "d": 90,
            "h": 80,
            "s": 70
        },
        "id": 721,
        "types": [
            "ほのお",
            "みず"
        ]
    },
    "ボルトロス": {
        "base_stats": {
            "a": 115,
            "b": 70,
            "c": 125,
            "d": 80,
            "h": 79,
            "s": 111
        },
        "id": 642,
        "types": [
            "でんき",
            "ひこう"
        ]
    },
    "ボーマンダ": {
        "base_stats": {
            "a": 135,
            "b": 80,
            "c": 110,
            "d": 80,
            "h": 95,
            "s": 100
        },
        "id": 373,
        "types": [
            "ドラゴン",
            "ひこう"
        ]
    },
    "ポカブ": {
        "base_stats": {
            "a": 63,
            "b": 45,
            "c": 45,
            "d": 45,
            "h": 65,
            "s": 45
        },
        "id": 498,
        "types": [
            "ほのお"
        ]
    },
    "ポチエナ": {
        "base_stats": {
            "a": 55,
            "b": 35,
            "c": 30,
            "d": 30,
            "h": 35,
            "s": 35
        },
        "id": 261,
        "types": [
            "あく"
        ]
    },
    "ポッタイシ": {
        "base_stats": {
            "a": 66,
            "b": 68,
            "c": 81,
            "d": 76,
            "h": 64,
            "s": 50
        },
        "id": 394,
        "types": [
            "みず"
        ]
    },
    "ポッチャマ": {
        "base_stats": {
            "a": 51,
            "b": 53,
            "c": 61,
            "d": 56,
            "h": 53,
            "s": 40
        },
        "id": 393,
        "types": [
            "みず"
        ]
    },
    "ポットデス": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 134,
            "d": 114,
            "h": 60,
            "s": 70
        },
        "id": 855,
        "types": [
            "ゴースト"
        ]
    },
    "ポッポ": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 35,
            "d": 35,
            "h": 40,
            "s": 56
        },
        "id": 16,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ポニータ": {
        "base_stats": {
            "a": 85,
            "b": 55,
            "c": 65,
            "d": 65,
            "h": 50,
            "s": 90
        },
        "id": 77,
        "types": [
            "ほのお"
        ]
    },
    "ポポッコ": {
        "base_stats": {
            "a": 45,
            "b": 50,
            "c": 45,
            "d": 65,
            "h": 55,
            "s": 80
        },
        "id": 188,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "ポリゴン": {
        "base_stats": {
            "a": 60,
            "b": 70,
            "c": 85,
            "d": 75,
            "h": 65,
            "s": 40
        },
        "id": 137,
        "types": [
            "ノーマル"
        ]
    },
    "ポリゴン２": {
        "base_stats": {
            "a": 80,
            "b": 90,
            "c": 105,
            "d": 95,
            "h": 85,
            "s": 60
        },
        "id": 233,
        "types": [
            "ノーマル"
        ]
    },
    "ポリゴンＺ": {
        "base_stats": {
            "a": 80,
            "b": 70,
            "c": 135,
            "d": 75,
            "h": 85,
            "s": 90
        },
        "id": 474,
        "types": [
            "ノーマル"
        ]
    },
    "ポワルン": {
        "base_stats": {
            "a": 70,
            "b": 70,
            "c": 70,
            "d": 70,
            "h": 70,
            "s": 70
        },
        "id": 351,
        "types": [
            "ノーマル"
        ]
    },
    "マイナン": {
        "base_stats": {
            "a": 40,
            "b": 50,
            "c": 75,
            "d": 85,
            "h": 60,
            "s": 95
        },
        "id": 312,
        "types": [
            "でんき"
        ]
    },
    "マギアナ": {
        "base_stats": {
            "a": 95,
            "b": 115,
            "c": 130,
            "d": 115,
            "h": 80,
            "s": 65
        },
        "id": 801,
        "types": [
            "はがね",
            "フェアリー"
        ]
    },
    "マクノシタ": {
        "base_stats": {
            "a": 60,
            "b": 30,
            "c": 20,
            "d": 30,
            "h": 72,
            "s": 25
        },
        "id": 296,
        "types": [
            "かくとう"
        ]
    },
    "マグカルゴ": {
        "base_stats": {
            "a": 50,
            "b": 120,
            "c": 90,
            "d": 80,
            "h": 60,
            "s": 30
        },
        "id": 219,
        "types": [
            "ほのお",
            "いわ"
        ]
    },
    "マグマッグ": {
        "base_stats": {
            "a": 40,
            "b": 40,
            "c": 70,
            "d": 40,
            "h": 40,
            "s": 20
        },
        "id": 218,
        "types": [
            "ほのお"
        ]
    },
    "マグマラシ": {
        "base_stats": {
            "a": 64,
            "b": 58,
            "c": 80,
            "d": 65,
            "h": 58,
            "s": 80
        },
        "id": 156,
        "types": [
            "ほのお"
        ]
    },
    "マケンカニ": {
        "base_stats": {
            "a": 82,
            "b": 57,
            "c": 42,
            "d": 47,
            "h": 47,
            "s": 63
        },
        "id": 739,
        "types": [
            "かくとう"
        ]
    },
    "マシェード": {
        "base_stats": {
            "a": 45,
            "b": 80,
            "c": 90,
            "d": 100,
            "h": 60,
            "s": 30
        },
        "id": 756,
        "types": [
            "くさ",
            "フェアリー"
        ]
    },
    "マスカーニャ": {
        "base_stats": {
            "a": 110,
            "b": 70,
            "c": 81,
            "d": 70,
            "h": 76,
            "s": 123
        },
        "id": 908,
        "types": [
            "くさ",
            "あく"
        ]
    },
    "マスキッパ": {
        "base_stats": {
            "a": 100,
            "b": 72,
            "c": 90,
            "d": 72,
            "h": 74,
            "s": 46
        },
        "id": 455,
        "types": [
            "くさ"
        ]
    },
    "マタドガス": {
        "base_stats": {
            "a": 90,
            "b": 120,
            "c": 85,
            "d": 70,
            "h": 65,
            "s": 60
        },
        "id": 110,
        "types": [
            "どく"
        ]
    },
    "マダツボミ": {
        "base_stats": {
            "a": 75,
            "b": 35,
            "c": 70,
            "d": 30,
            "h": 50,
            "s": 40
        },
        "id": 69,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "マッギョ": {
        "base_stats": {
            "a": 66,
            "b": 84,
            "c": 81,
            "d": 99,
            "h": 109,
            "s": 32
        },
        "id": 618,
        "types": [
            "じめん",
            "でんき"
        ]
    },
    "マッシブーン": {
        "base_stats": {
            "a": 139,
            "b": 139,
            "c": 53,
            "d": 53,
            "h": 107,
            "s": 79
        },
        "id": 794,
        "types": [
            "むし",
            "かくとう"
        ]
    },
    "マッスグマ": {
        "base_stats": {
            "a": 70,
            "b": 61,
            "c": 50,
            "d": 61,
            "h": 78,
            "s": 100
        },
        "id": 264,
        "types": [
            "ノーマル"
        ]
    },
    "マナフィ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 490,
        "types": [
            "みず"
        ]
    },
    "マニューラ": {
        "base_stats": {
            "a": 120,
            "b": 65,
            "c": 45,
            "d": 85,
            "h": 70,
            "s": 125
        },
        "id": 461,
        "types": [
            "あく",
            "こおり"
        ]
    },
    "マネネ": {
        "base_stats": {
            "a": 25,
            "b": 45,
            "c": 70,
            "d": 90,
            "h": 20,
            "s": 60
        },
        "id": 439,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "マフィティフ": {
        "base_stats": {
            "a": 120,
            "b": 90,
            "c": 60,
            "d": 70,
            "h": 80,
            "s": 85
        },
        "id": 943,
        "types": [
            "あく"
        ]
    },
    "マフォクシー": {
        "base_stats": {
            "a": 69,
            "b": 72,
            "c": 114,
            "d": 100,
            "h": 75,
            "s": 104
        },
        "id": 655,
        "types": [
            "ほのお",
            "エスパー"
        ]
    },
    "マホイップ": {
        "base_stats": {
            "a": 60,
            "b": 75,
            "c": 110,
            "d": 121,
            "h": 65,
            "s": 64
        },
        "id": 869,
        "types": [
            "フェアリー"
        ]
    },
    "マホミル": {
        "base_stats": {
            "a": 40,
            "b": 40,
            "c": 50,
            "d": 61,
            "h": 45,
            "s": 34
        },
        "id": 868,
        "types": [
            "フェアリー"
        ]
    },
    "ママンボウ": {
        "base_stats": {
            "a": 75,
            "b": 80,
            "c": 40,
            "d": 45,
            "h": 165,
            "s": 65
        },
        "id": 594,
        "types": [
            "みず"
        ]
    },
    "マメバッタ": {
        "base_stats": {
            "a": 46,
            "b": 40,
            "c": 21,
            "d": 25,
            "h": 33,
            "s": 45
        },
        "id": 919,
        "types": [
            "むし"
        ]
    },
    "マメパト": {
        "base_stats": {
            "a": 55,
            "b": 50,
            "c": 36,
            "d": 30,
            "h": 50,
            "s": 43
        },
        "id": 519,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "マユルド": {
        "base_stats": {
            "a": 35,
            "b": 55,
            "c": 25,
            "d": 25,
            "h": 50,
            "s": 15
        },
        "id": 268,
        "types": [
            "むし"
        ]
    },
    "マラカッチ": {
        "base_stats": {
            "a": 86,
            "b": 67,
            "c": 106,
            "d": 67,
            "h": 75,
            "s": 60
        },
        "id": 556,
        "types": [
            "くさ"
        ]
    },
    "マリル": {
        "base_stats": {
            "a": 20,
            "b": 50,
            "c": 20,
            "d": 50,
            "h": 70,
            "s": 40
        },
        "id": 183,
        "types": [
            "みず",
            "フェアリー"
        ]
    },
    "マリルリ": {
        "base_stats": {
            "a": 50,
            "b": 80,
            "c": 60,
            "d": 80,
            "h": 100,
            "s": 50
        },
        "id": 184,
        "types": [
            "みず",
            "フェアリー"
        ]
    },
    "マルノーム": {
        "base_stats": {
            "a": 73,
            "b": 83,
            "c": 73,
            "d": 83,
            "h": 100,
            "s": 55
        },
        "id": 317,
        "types": [
            "どく"
        ]
    },
    "マルマイン": {
        "base_stats": {
            "a": 50,
            "b": 70,
            "c": 80,
            "d": 80,
            "h": 60,
            "s": 150
        },
        "id": 101,
        "types": [
            "でんき"
        ]
    },
    "マルヤクデ": {
        "base_stats": {
            "a": 115,
            "b": 65,
            "c": 90,
            "d": 90,
            "h": 100,
            "s": 65
        },
        "id": 851,
        "types": [
            "ほのお",
            "むし"
        ]
    },
    "マンキー": {
        "base_stats": {
            "a": 80,
            "b": 35,
            "c": 35,
            "d": 45,
            "h": 40,
            "s": 70
        },
        "id": 56,
        "types": [
            "かくとう"
        ]
    },
    "マンタイン": {
        "base_stats": {
            "a": 40,
            "b": 70,
            "c": 80,
            "d": 140,
            "h": 85,
            "s": 70
        },
        "id": 226,
        "types": [
            "みず",
            "ひこう"
        ]
    },
    "マンムー": {
        "base_stats": {
            "a": 130,
            "b": 80,
            "c": 70,
            "d": 60,
            "h": 110,
            "s": 80
        },
        "id": 473,
        "types": [
            "こおり",
            "じめん"
        ]
    },
    "マーイーカ": {
        "base_stats": {
            "a": 54,
            "b": 53,
            "c": 37,
            "d": 46,
            "h": 53,
            "s": 45
        },
        "id": 686,
        "types": [
            "あく",
            "エスパー"
        ]
    },
    "マーシャドー": {
        "base_stats": {
            "a": 125,
            "b": 80,
            "c": 90,
            "d": 90,
            "h": 90,
            "s": 125
        },
        "id": 802,
        "types": [
            "かくとう",
            "ゴースト"
        ]
    },
    "ミカルゲ": {
        "base_stats": {
            "a": 92,
            "b": 108,
            "c": 92,
            "d": 108,
            "h": 50,
            "s": 35
        },
        "id": 442,
        "types": [
            "ゴースト",
            "あく"
        ]
    },
    "ミガルーサ": {
        "base_stats": {
            "a": 102,
            "b": 73,
            "c": 78,
            "d": 65,
            "h": 90,
            "s": 70
        },
        "id": 976,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ミジュマル": {
        "base_stats": {
            "a": 55,
            "b": 45,
            "c": 63,
            "d": 45,
            "h": 55,
            "s": 45
        },
        "id": 501,
        "types": [
            "みず"
        ]
    },
    "ミズゴロウ": {
        "base_stats": {
            "a": 70,
            "b": 50,
            "c": 50,
            "d": 50,
            "h": 50,
            "s": 40
        },
        "id": 258,
        "types": [
            "みず"
        ]
    },
    "ミツハニー": {
        "base_stats": {
            "a": 30,
            "b": 42,
            "c": 30,
            "d": 42,
            "h": 30,
            "s": 70
        },
        "id": 415,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "ミニリュウ": {
        "base_stats": {
            "a": 64,
            "b": 45,
            "c": 50,
            "d": 50,
            "h": 41,
            "s": 50
        },
        "id": 147,
        "types": [
            "ドラゴン"
        ]
    },
    "ミニーブ": {
        "base_stats": {
            "a": 35,
            "b": 45,
            "c": 58,
            "d": 51,
            "h": 41,
            "s": 30
        },
        "id": 928,
        "types": [
            "くさ",
            "ノーマル"
        ]
    },
    "ミネズミ": {
        "base_stats": {
            "a": 55,
            "b": 39,
            "c": 35,
            "d": 39,
            "h": 45,
            "s": 42
        },
        "id": 504,
        "types": [
            "ノーマル"
        ]
    },
    "ミノマダム": {
        "base_stats": {
            "a": 59,
            "b": 85,
            "c": 79,
            "d": 105,
            "h": 60,
            "s": 36
        },
        "id": 413,
        "types": [
            "むし",
            "くさ"
        ]
    },
    "ミノムッチ": {
        "base_stats": {
            "a": 29,
            "b": 45,
            "c": 29,
            "d": 45,
            "h": 40,
            "s": 36
        },
        "id": 412,
        "types": [
            "むし"
        ]
    },
    "ミブリム": {
        "base_stats": {
            "a": 30,
            "b": 45,
            "c": 56,
            "d": 53,
            "h": 42,
            "s": 39
        },
        "id": 856,
        "types": [
            "エスパー"
        ]
    },
    "ミミズズ": {
        "base_stats": {
            "a": 85,
            "b": 145,
            "c": 60,
            "d": 55,
            "h": 70,
            "s": 65
        },
        "id": 968,
        "types": [
            "はがね"
        ]
    },
    "ミミッキュ": {
        "base_stats": {
            "a": 90,
            "b": 80,
            "c": 50,
            "d": 105,
            "h": 55,
            "s": 96
        },
        "id": 778,
        "types": [
            "ゴースト",
            "フェアリー"
        ]
    },
    "ミミロップ": {
        "base_stats": {
            "a": 76,
            "b": 84,
            "c": 54,
            "d": 96,
            "h": 65,
            "s": 105
        },
        "id": 428,
        "types": [
            "ノーマル"
        ]
    },
    "ミミロル": {
        "base_stats": {
            "a": 66,
            "b": 44,
            "c": 44,
            "d": 56,
            "h": 55,
            "s": 85
        },
        "id": 427,
        "types": [
            "ノーマル"
        ]
    },
    "ミュウ": {
        "base_stats": {
            "a": 100,
            "b": 100,
            "c": 100,
            "d": 100,
            "h": 100,
            "s": 100
        },
        "id": 151,
        "types": [
            "エスパー"
        ]
    },
    "ミュウツー": {
        "base_stats": {
            "a": 110,
            "b": 90,
            "c": 154,
            "d": 90,
            "h": 106,
            "s": 130
        },
        "id": 150,
        "types": [
            "エスパー"
        ]
    },
    "ミライドン": {
        "base_stats": {
            "a": 85,
            "b": 100,
            "c": 135,
            "d": 115,
            "h": 100,
            "s": 135
        },
        "id": 1008,
        "types": [
            "でんき",
            "ドラゴン"
        ]
    },
    "ミルタンク": {
        "base_stats": {
            "a": 80,
            "b": 105,
            "c": 40,
            "d": 70,
            "h": 95,
            "s": 100
        },
        "id": 241,
        "types": [
            "ノーマル"
        ]
    },
    "ミルホッグ": {
        "base_stats": {
            "a": 85,
            "b": 69,
            "c": 60,
            "d": 69,
            "h": 60,
            "s": 77
        },
        "id": 505,
        "types": [
            "ノーマル"
        ]
    },
    "ミロカロス": {
        "base_stats": {
            "a": 60,
            "b": 79,
            "c": 100,
            "d": 125,
            "h": 95,
            "s": 81
        },
        "id": 350,
        "types": [
            "みず"
        ]
    },
    "ムウマ": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 85,
            "d": 85,
            "h": 60,
            "s": 85
        },
        "id": 200,
        "types": [
            "ゴースト"
        ]
    },
    "ムウマージ": {
        "base_stats": {
            "a": 60,
            "b": 60,
            "c": 105,
            "d": 105,
            "h": 60,
            "s": 105
        },
        "id": 429,
        "types": [
            "ゴースト"
        ]
    },
    "ムクバード": {
        "base_stats": {
            "a": 75,
            "b": 50,
            "c": 40,
            "d": 40,
            "h": 55,
            "s": 80
        },
        "id": 397,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ムクホーク": {
        "base_stats": {
            "a": 120,
            "b": 70,
            "c": 50,
            "d": 60,
            "h": 85,
            "s": 100
        },
        "id": 398,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ムゲンダイナ": {
        "base_stats": {
            "a": 85,
            "b": 95,
            "c": 145,
            "d": 95,
            "h": 140,
            "s": 130
        },
        "id": 890,
        "types": [
            "どく",
            "ドラゴン"
        ]
    },
    "ムシャーナ": {
        "base_stats": {
            "a": 55,
            "b": 85,
            "c": 107,
            "d": 95,
            "h": 116,
            "s": 29
        },
        "id": 518,
        "types": [
            "エスパー"
        ]
    },
    "ムチュール": {
        "base_stats": {
            "a": 30,
            "b": 15,
            "c": 85,
            "d": 65,
            "h": 45,
            "s": 65
        },
        "id": 238,
        "types": [
            "こおり",
            "エスパー"
        ]
    },
    "ムックル": {
        "base_stats": {
            "a": 55,
            "b": 30,
            "c": 30,
            "d": 30,
            "h": 40,
            "s": 60
        },
        "id": 396,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ムンナ": {
        "base_stats": {
            "a": 25,
            "b": 45,
            "c": 67,
            "d": 55,
            "h": 76,
            "s": 24
        },
        "id": 517,
        "types": [
            "エスパー"
        ]
    },
    "ムーランド": {
        "base_stats": {
            "a": 110,
            "b": 90,
            "c": 45,
            "d": 90,
            "h": 85,
            "s": 80
        },
        "id": 508,
        "types": [
            "ノーマル"
        ]
    },
    "メェークル": {
        "base_stats": {
            "a": 65,
            "b": 48,
            "c": 62,
            "d": 57,
            "h": 66,
            "s": 52
        },
        "id": 672,
        "types": [
            "くさ"
        ]
    },
    "メガニウム": {
        "base_stats": {
            "a": 82,
            "b": 100,
            "c": 83,
            "d": 100,
            "h": 80,
            "s": 80
        },
        "id": 154,
        "types": [
            "くさ"
        ]
    },
    "メガヤンマ": {
        "base_stats": {
            "a": 76,
            "b": 86,
            "c": 116,
            "d": 56,
            "h": 86,
            "s": 95
        },
        "id": 469,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "メグロコ": {
        "base_stats": {
            "a": 72,
            "b": 35,
            "c": 35,
            "d": 35,
            "h": 50,
            "s": 65
        },
        "id": 551,
        "types": [
            "じめん",
            "あく"
        ]
    },
    "メタグロス": {
        "base_stats": {
            "a": 135,
            "b": 130,
            "c": 95,
            "d": 90,
            "h": 80,
            "s": 70
        },
        "id": 376,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "メタモン": {
        "base_stats": {
            "a": 48,
            "b": 48,
            "c": 48,
            "d": 48,
            "h": 48,
            "s": 48
        },
        "id": 132,
        "types": [
            "ノーマル"
        ]
    },
    "メタング": {
        "base_stats": {
            "a": 75,
            "b": 100,
            "c": 55,
            "d": 80,
            "h": 60,
            "s": 50
        },
        "id": 375,
        "types": [
            "はがね",
            "エスパー"
        ]
    },
    "メッソン": {
        "base_stats": {
            "a": 40,
            "b": 40,
            "c": 70,
            "d": 40,
            "h": 50,
            "s": 70
        },
        "id": 816,
        "types": [
            "みず"
        ]
    },
    "メテノ": {
        "base_stats": {
            "a": 60,
            "b": 100,
            "c": 60,
            "d": 100,
            "h": 60,
            "s": 60
        },
        "id": 774,
        "types": [
            "いわ",
            "ひこう"
        ]
    },
    "メノクラゲ": {
        "base_stats": {
            "a": 40,
            "b": 35,
            "c": 50,
            "d": 100,
            "h": 40,
            "s": 70
        },
        "id": 72,
        "types": [
            "みず",
            "どく"
        ]
    },
    "メブキジカ": {
        "base_stats": {
            "a": 100,
            "b": 70,
            "c": 60,
            "d": 70,
            "h": 80,
            "s": 95
        },
        "id": 586,
        "types": [
            "ノーマル",
            "くさ"
        ]
    },
    "メラルバ": {
        "base_stats": {
            "a": 85,
            "b": 55,
            "c": 50,
            "d": 55,
            "h": 55,
            "s": 60
        },
        "id": 636,
        "types": [
            "むし",
            "ほのお"
        ]
    },
    "メリープ": {
        "base_stats": {
            "a": 40,
            "b": 40,
            "c": 65,
            "d": 45,
            "h": 55,
            "s": 35
        },
        "id": 179,
        "types": [
            "でんき"
        ]
    },
    "メルタン": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 55,
            "d": 35,
            "h": 46,
            "s": 34
        },
        "id": 808,
        "types": [
            "はがね"
        ]
    },
    "メルメタル": {
        "base_stats": {
            "a": 143,
            "b": 143,
            "c": 80,
            "d": 65,
            "h": 135,
            "s": 34
        },
        "id": 809,
        "types": [
            "はがね"
        ]
    },
    "メレシー": {
        "base_stats": {
            "a": 50,
            "b": 150,
            "c": 50,
            "d": 150,
            "h": 50,
            "s": 50
        },
        "id": 703,
        "types": [
            "いわ",
            "フェアリー"
        ]
    },
    "メロエッタ": {
        "base_stats": {
            "a": 77,
            "b": 77,
            "c": 128,
            "d": 128,
            "h": 100,
            "s": 90
        },
        "id": 648,
        "types": [
            "ノーマル",
            "エスパー"
        ]
    },
    "モウカザル": {
        "base_stats": {
            "a": 78,
            "b": 52,
            "c": 78,
            "d": 52,
            "h": 64,
            "s": 81
        },
        "id": 391,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "モクロー": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 50,
            "d": 50,
            "h": 68,
            "s": 42
        },
        "id": 722,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "モグリュー": {
        "base_stats": {
            "a": 85,
            "b": 40,
            "c": 30,
            "d": 45,
            "h": 60,
            "s": 68
        },
        "id": 529,
        "types": [
            "じめん"
        ]
    },
    "モココ": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 80,
            "d": 60,
            "h": 70,
            "s": 45
        },
        "id": 180,
        "types": [
            "でんき"
        ]
    },
    "モジャンボ": {
        "base_stats": {
            "a": 100,
            "b": 125,
            "c": 110,
            "d": 50,
            "h": 100,
            "s": 50
        },
        "id": 465,
        "types": [
            "くさ"
        ]
    },
    "モスノウ": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 125,
            "d": 90,
            "h": 70,
            "s": 65
        },
        "id": 873,
        "types": [
            "こおり",
            "むし"
        ]
    },
    "モトトカゲ": {
        "base_stats": {
            "a": 95,
            "b": 65,
            "c": 85,
            "d": 65,
            "h": 70,
            "s": 121
        },
        "id": 967,
        "types": [
            "ドラゴン",
            "ノーマル"
        ]
    },
    "モノズ": {
        "base_stats": {
            "a": 65,
            "b": 50,
            "c": 45,
            "d": 50,
            "h": 52,
            "s": 38
        },
        "id": 633,
        "types": [
            "あく",
            "ドラゴン"
        ]
    },
    "モルフォン": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 90,
            "d": 75,
            "h": 70,
            "s": 90
        },
        "id": 49,
        "types": [
            "むし",
            "どく"
        ]
    },
    "モルペコ": {
        "base_stats": {
            "a": 95,
            "b": 58,
            "c": 70,
            "d": 58,
            "h": 58,
            "s": 97
        },
        "id": 877,
        "types": [
            "でんき",
            "あく"
        ]
    },
    "モロバレル": {
        "base_stats": {
            "a": 85,
            "b": 70,
            "c": 85,
            "d": 80,
            "h": 114,
            "s": 30
        },
        "id": 591,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "モンジャラ": {
        "base_stats": {
            "a": 55,
            "b": 115,
            "c": 100,
            "d": 40,
            "h": 65,
            "s": 60
        },
        "id": 114,
        "types": [
            "くさ"
        ]
    },
    "モンメン": {
        "base_stats": {
            "a": 27,
            "b": 60,
            "c": 37,
            "d": 50,
            "h": 40,
            "s": 66
        },
        "id": 546,
        "types": [
            "くさ",
            "フェアリー"
        ]
    },
    "ヤクデ": {
        "base_stats": {
            "a": 65,
            "b": 45,
            "c": 50,
            "d": 50,
            "h": 50,
            "s": 45
        },
        "id": 850,
        "types": [
            "ほのお",
            "むし"
        ]
    },
    "ヤジロン": {
        "base_stats": {
            "a": 40,
            "b": 55,
            "c": 40,
            "d": 70,
            "h": 40,
            "s": 55
        },
        "id": 343,
        "types": [
            "じめん",
            "エスパー"
        ]
    },
    "ヤトウモリ": {
        "base_stats": {
            "a": 44,
            "b": 40,
            "c": 71,
            "d": 40,
            "h": 48,
            "s": 77
        },
        "id": 757,
        "types": [
            "どく",
            "ほのお"
        ]
    },
    "ヤドキング": {
        "base_stats": {
            "a": 75,
            "b": 80,
            "c": 100,
            "d": 110,
            "h": 95,
            "s": 30
        },
        "id": 199,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ヤドラン": {
        "base_stats": {
            "a": 75,
            "b": 110,
            "c": 100,
            "d": 80,
            "h": 95,
            "s": 30
        },
        "id": 80,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ヤドン": {
        "base_stats": {
            "a": 65,
            "b": 65,
            "c": 40,
            "d": 40,
            "h": 90,
            "s": 15
        },
        "id": 79,
        "types": [
            "みず",
            "エスパー"
        ]
    },
    "ヤナッキー": {
        "base_stats": {
            "a": 98,
            "b": 63,
            "c": 98,
            "d": 63,
            "h": 75,
            "s": 101
        },
        "id": 512,
        "types": [
            "くさ"
        ]
    },
    "ヤナップ": {
        "base_stats": {
            "a": 53,
            "b": 48,
            "c": 53,
            "d": 48,
            "h": 50,
            "s": 64
        },
        "id": 511,
        "types": [
            "くさ"
        ]
    },
    "ヤバチャ": {
        "base_stats": {
            "a": 45,
            "b": 45,
            "c": 74,
            "d": 54,
            "h": 40,
            "s": 50
        },
        "id": 854,
        "types": [
            "ゴースト"
        ]
    },
    "ヤブクロン": {
        "base_stats": {
            "a": 50,
            "b": 62,
            "c": 40,
            "d": 62,
            "h": 50,
            "s": 65
        },
        "id": 568,
        "types": [
            "どく"
        ]
    },
    "ヤミカラス": {
        "base_stats": {
            "a": 85,
            "b": 42,
            "c": 85,
            "d": 42,
            "h": 60,
            "s": 91
        },
        "id": 198,
        "types": [
            "あく",
            "ひこう"
        ]
    },
    "ヤミラミ": {
        "base_stats": {
            "a": 75,
            "b": 75,
            "c": 65,
            "d": 65,
            "h": 50,
            "s": 50
        },
        "id": 302,
        "types": [
            "あく",
            "ゴースト"
        ]
    },
    "ヤヤコマ": {
        "base_stats": {
            "a": 50,
            "b": 43,
            "c": 40,
            "d": 38,
            "h": 45,
            "s": 62
        },
        "id": 661,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ヤルキモノ": {
        "base_stats": {
            "a": 80,
            "b": 80,
            "c": 55,
            "d": 55,
            "h": 80,
            "s": 90
        },
        "id": 288,
        "types": [
            "ノーマル"
        ]
    },
    "ヤレユータン": {
        "base_stats": {
            "a": 60,
            "b": 80,
            "c": 90,
            "d": 110,
            "h": 90,
            "s": 60
        },
        "id": 765,
        "types": [
            "ノーマル",
            "エスパー"
        ]
    },
    "ヤングース": {
        "base_stats": {
            "a": 70,
            "b": 30,
            "c": 30,
            "d": 30,
            "h": 48,
            "s": 45
        },
        "id": 734,
        "types": [
            "ノーマル"
        ]
    },
    "ヤンチャム": {
        "base_stats": {
            "a": 82,
            "b": 62,
            "c": 46,
            "d": 48,
            "h": 67,
            "s": 43
        },
        "id": 674,
        "types": [
            "かくとう"
        ]
    },
    "ヤンヤンマ": {
        "base_stats": {
            "a": 65,
            "b": 45,
            "c": 75,
            "d": 45,
            "h": 65,
            "s": 95
        },
        "id": 193,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "ユキカブリ": {
        "base_stats": {
            "a": 62,
            "b": 50,
            "c": 62,
            "d": 60,
            "h": 60,
            "s": 40
        },
        "id": 459,
        "types": [
            "くさ",
            "こおり"
        ]
    },
    "ユキノオー": {
        "base_stats": {
            "a": 92,
            "b": 75,
            "c": 92,
            "d": 85,
            "h": 90,
            "s": 60
        },
        "id": 460,
        "types": [
            "くさ",
            "こおり"
        ]
    },
    "ユキハミ": {
        "base_stats": {
            "a": 25,
            "b": 35,
            "c": 45,
            "d": 30,
            "h": 30,
            "s": 20
        },
        "id": 872,
        "types": [
            "こおり",
            "むし"
        ]
    },
    "ユキメノコ": {
        "base_stats": {
            "a": 80,
            "b": 70,
            "c": 80,
            "d": 70,
            "h": 70,
            "s": 110
        },
        "id": 478,
        "types": [
            "こおり",
            "ゴースト"
        ]
    },
    "ユキワラシ": {
        "base_stats": {
            "a": 50,
            "b": 50,
            "c": 50,
            "d": 50,
            "h": 50,
            "s": 50
        },
        "id": 361,
        "types": [
            "こおり"
        ]
    },
    "ユクシー": {
        "base_stats": {
            "a": 75,
            "b": 130,
            "c": 75,
            "d": 130,
            "h": 75,
            "s": 95
        },
        "id": 480,
        "types": [
            "エスパー"
        ]
    },
    "ユニラン": {
        "base_stats": {
            "a": 30,
            "b": 40,
            "c": 105,
            "d": 50,
            "h": 45,
            "s": 20
        },
        "id": 577,
        "types": [
            "エスパー"
        ]
    },
    "ユレイドル": {
        "base_stats": {
            "a": 81,
            "b": 97,
            "c": 81,
            "d": 107,
            "h": 86,
            "s": 43
        },
        "id": 346,
        "types": [
            "いわ",
            "くさ"
        ]
    },
    "ユンゲラー": {
        "base_stats": {
            "a": 35,
            "b": 30,
            "c": 120,
            "d": 70,
            "h": 40,
            "s": 105
        },
        "id": 64,
        "types": [
            "エスパー"
        ]
    },
    "ヨクバリス": {
        "base_stats": {
            "a": 95,
            "b": 95,
            "c": 55,
            "d": 75,
            "h": 120,
            "s": 20
        },
        "id": 820,
        "types": [
            "ノーマル"
        ]
    },
    "ヨノワール": {
        "base_stats": {
            "a": 100,
            "b": 135,
            "c": 65,
            "d": 135,
            "h": 45,
            "s": 45
        },
        "id": 477,
        "types": [
            "ゴースト"
        ]
    },
    "ヨマワル": {
        "base_stats": {
            "a": 40,
            "b": 90,
            "c": 30,
            "d": 90,
            "h": 20,
            "s": 25
        },
        "id": 355,
        "types": [
            "ゴースト"
        ]
    },
    "ヨルノズク": {
        "base_stats": {
            "a": 50,
            "b": 50,
            "c": 86,
            "d": 96,
            "h": 100,
            "s": 70
        },
        "id": 164,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ヨワシ": {
        "base_stats": {
            "a": 20,
            "b": 20,
            "c": 25,
            "d": 25,
            "h": 45,
            "s": 40
        },
        "id": 746,
        "types": [
            "みず"
        ]
    },
    "ヨーギラス": {
        "base_stats": {
            "a": 64,
            "b": 50,
            "c": 45,
            "d": 50,
            "h": 50,
            "s": 41
        },
        "id": 246,
        "types": [
            "いわ",
            "じめん"
        ]
    },
    "ヨーテリー": {
        "base_stats": {
            "a": 60,
            "b": 45,
            "c": 25,
            "d": 45,
            "h": 45,
            "s": 55
        },
        "id": 506,
        "types": [
            "ノーマル"
        ]
    },
    "ライコウ": {
        "base_stats": {
            "a": 85,
            "b": 75,
            "c": 115,
            "d": 100,
            "h": 90,
            "s": 115
        },
        "id": 243,
        "types": [
            "でんき"
        ]
    },
    "ライチュウ": {
        "base_stats": {
            "a": 90,
            "b": 55,
            "c": 90,
            "d": 80,
            "h": 60,
            "s": 110
        },
        "id": 26,
        "types": [
            "でんき"
        ]
    },
    "ライボルト": {
        "base_stats": {
            "a": 75,
            "b": 60,
            "c": 105,
            "d": 60,
            "h": 70,
            "s": 105
        },
        "id": 310,
        "types": [
            "でんき"
        ]
    },
    "ラウドボーン": {
        "base_stats": {
            "a": 75,
            "b": 100,
            "c": 110,
            "d": 75,
            "h": 104,
            "s": 66
        },
        "id": 911,
        "types": [
            "ほのお",
            "ゴースト"
        ]
    },
    "ラクライ": {
        "base_stats": {
            "a": 45,
            "b": 40,
            "c": 65,
            "d": 40,
            "h": 40,
            "s": 65
        },
        "id": 309,
        "types": [
            "でんき"
        ]
    },
    "ラグラージ": {
        "base_stats": {
            "a": 110,
            "b": 90,
            "c": 85,
            "d": 90,
            "h": 100,
            "s": 60
        },
        "id": 260,
        "types": [
            "みず",
            "じめん"
        ]
    },
    "ラッキー": {
        "base_stats": {
            "a": 5,
            "b": 5,
            "c": 35,
            "d": 105,
            "h": 250,
            "s": 50
        },
        "id": 113,
        "types": [
            "ノーマル"
        ]
    },
    "ラッタ": {
        "base_stats": {
            "a": 81,
            "b": 60,
            "c": 50,
            "d": 70,
            "h": 55,
            "s": 97
        },
        "id": 20,
        "types": [
            "ノーマル"
        ]
    },
    "ラティアス": {
        "base_stats": {
            "a": 80,
            "b": 90,
            "c": 110,
            "d": 130,
            "h": 80,
            "s": 110
        },
        "id": 380,
        "types": [
            "ドラゴン",
            "エスパー"
        ]
    },
    "ラティオス": {
        "base_stats": {
            "a": 90,
            "b": 80,
            "c": 130,
            "d": 110,
            "h": 80,
            "s": 110
        },
        "id": 381,
        "types": [
            "ドラゴン",
            "エスパー"
        ]
    },
    "ラビフット": {
        "base_stats": {
            "a": 86,
            "b": 60,
            "c": 55,
            "d": 60,
            "h": 65,
            "s": 94
        },
        "id": 814,
        "types": [
            "ほのお"
        ]
    },
    "ラフレシア": {
        "base_stats": {
            "a": 80,
            "b": 85,
            "c": 110,
            "d": 90,
            "h": 75,
            "s": 50
        },
        "id": 45,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ラブカス": {
        "base_stats": {
            "a": 30,
            "b": 55,
            "c": 40,
            "d": 65,
            "h": 43,
            "s": 97
        },
        "id": 370,
        "types": [
            "みず"
        ]
    },
    "ラブトロス": {
        "base_stats": {
            "a": 115,
            "b": 70,
            "c": 135,
            "d": 80,
            "h": 74,
            "s": 106
        },
        "id": 905,
        "types": [
            "フェアリー",
            "ひこう"
        ]
    },
    "ラプラス": {
        "base_stats": {
            "a": 85,
            "b": 80,
            "c": 85,
            "d": 95,
            "h": 130,
            "s": 60
        },
        "id": 131,
        "types": [
            "みず",
            "こおり"
        ]
    },
    "ラムパルド": {
        "base_stats": {
            "a": 165,
            "b": 60,
            "c": 65,
            "d": 50,
            "h": 97,
            "s": 58
        },
        "id": 409,
        "types": [
            "いわ"
        ]
    },
    "ラランテス": {
        "base_stats": {
            "a": 105,
            "b": 90,
            "c": 80,
            "d": 90,
            "h": 70,
            "s": 45
        },
        "id": 754,
        "types": [
            "くさ"
        ]
    },
    "ラルトス": {
        "base_stats": {
            "a": 25,
            "b": 25,
            "c": 45,
            "d": 35,
            "h": 28,
            "s": 40
        },
        "id": 280,
        "types": [
            "エスパー",
            "フェアリー"
        ]
    },
    "ランクルス": {
        "base_stats": {
            "a": 65,
            "b": 75,
            "c": 125,
            "d": 85,
            "h": 110,
            "s": 30
        },
        "id": 579,
        "types": [
            "エスパー"
        ]
    },
    "ランターン": {
        "base_stats": {
            "a": 58,
            "b": 58,
            "c": 76,
            "d": 76,
            "h": 125,
            "s": 67
        },
        "id": 171,
        "types": [
            "みず",
            "でんき"
        ]
    },
    "ランドロス": {
        "base_stats": {
            "a": 125,
            "b": 90,
            "c": 115,
            "d": 80,
            "h": 89,
            "s": 101
        },
        "id": 645,
        "types": [
            "じめん",
            "ひこう"
        ]
    },
    "ランプラー": {
        "base_stats": {
            "a": 40,
            "b": 60,
            "c": 95,
            "d": 60,
            "h": 60,
            "s": 55
        },
        "id": 608,
        "types": [
            "ゴースト",
            "ほのお"
        ]
    },
    "リオル": {
        "base_stats": {
            "a": 70,
            "b": 40,
            "c": 35,
            "d": 40,
            "h": 40,
            "s": 60
        },
        "id": 447,
        "types": [
            "かくとう"
        ]
    },
    "リキキリン": {
        "base_stats": {
            "a": 90,
            "b": 70,
            "c": 110,
            "d": 70,
            "h": 120,
            "s": 60
        },
        "id": 981,
        "types": [
            "ノーマル",
            "エスパー"
        ]
    },
    "リククラゲ": {
        "base_stats": {
            "a": 70,
            "b": 65,
            "c": 80,
            "d": 120,
            "h": 80,
            "s": 100
        },
        "id": 949,
        "types": [
            "じめん",
            "くさ"
        ]
    },
    "リグレー": {
        "base_stats": {
            "a": 55,
            "b": 55,
            "c": 85,
            "d": 55,
            "h": 55,
            "s": 30
        },
        "id": 605,
        "types": [
            "エスパー"
        ]
    },
    "リザード": {
        "base_stats": {
            "a": 64,
            "b": 58,
            "c": 80,
            "d": 65,
            "h": 58,
            "s": 80
        },
        "id": 5,
        "types": [
            "ほのお"
        ]
    },
    "リザードン": {
        "base_stats": {
            "a": 84,
            "b": 78,
            "c": 109,
            "d": 85,
            "h": 78,
            "s": 100
        },
        "id": 6,
        "types": [
            "ほのお",
            "ひこう"
        ]
    },
    "リリーラ": {
        "base_stats": {
            "a": 41,
            "b": 77,
            "c": 61,
            "d": 87,
            "h": 66,
            "s": 23
        },
        "id": 345,
        "types": [
            "いわ",
            "くさ"
        ]
    },
    "リングマ": {
        "base_stats": {
            "a": 130,
            "b": 75,
            "c": 75,
            "d": 75,
            "h": 90,
            "s": 55
        },
        "id": 217,
        "types": [
            "ノーマル"
        ]
    },
    "リーシャン": {
        "base_stats": {
            "a": 30,
            "b": 50,
            "c": 65,
            "d": 50,
            "h": 45,
            "s": 45
        },
        "id": 433,
        "types": [
            "エスパー"
        ]
    },
    "リーフィア": {
        "base_stats": {
            "a": 110,
            "b": 130,
            "c": 60,
            "d": 65,
            "h": 65,
            "s": 95
        },
        "id": 470,
        "types": [
            "くさ"
        ]
    },
    "ルカリオ": {
        "base_stats": {
            "a": 110,
            "b": 70,
            "c": 115,
            "d": 70,
            "h": 70,
            "s": 90
        },
        "id": 448,
        "types": [
            "かくとう",
            "はがね"
        ]
    },
    "ルガルガン": {
        "base_stats": {
            "a": 115,
            "b": 65,
            "c": 55,
            "d": 65,
            "h": 75,
            "s": 112
        },
        "id": 745,
        "types": [
            "いわ"
        ]
    },
    "ルギア": {
        "base_stats": {
            "a": 90,
            "b": 130,
            "c": 90,
            "d": 154,
            "h": 106,
            "s": 110
        },
        "id": 249,
        "types": [
            "エスパー",
            "ひこう"
        ]
    },
    "ルクシオ": {
        "base_stats": {
            "a": 85,
            "b": 49,
            "c": 60,
            "d": 49,
            "h": 60,
            "s": 60
        },
        "id": 404,
        "types": [
            "でんき"
        ]
    },
    "ルチャブル": {
        "base_stats": {
            "a": 92,
            "b": 75,
            "c": 74,
            "d": 63,
            "h": 78,
            "s": 118
        },
        "id": 701,
        "types": [
            "かくとう",
            "ひこう"
        ]
    },
    "ルナアーラ": {
        "base_stats": {
            "a": 113,
            "b": 89,
            "c": 137,
            "d": 107,
            "h": 137,
            "s": 97
        },
        "id": 792,
        "types": [
            "エスパー",
            "ゴースト"
        ]
    },
    "ルナトーン": {
        "base_stats": {
            "a": 55,
            "b": 65,
            "c": 95,
            "d": 85,
            "h": 90,
            "s": 70
        },
        "id": 337,
        "types": [
            "いわ",
            "エスパー"
        ]
    },
    "ルリリ": {
        "base_stats": {
            "a": 20,
            "b": 40,
            "c": 20,
            "d": 40,
            "h": 50,
            "s": 20
        },
        "id": 298,
        "types": [
            "ノーマル",
            "フェアリー"
        ]
    },
    "ルンパッパ": {
        "base_stats": {
            "a": 70,
            "b": 70,
            "c": 90,
            "d": 100,
            "h": 80,
            "s": 70
        },
        "id": 272,
        "types": [
            "みず",
            "くさ"
        ]
    },
    "ルージュラ": {
        "base_stats": {
            "a": 50,
            "b": 35,
            "c": 115,
            "d": 95,
            "h": 65,
            "s": 95
        },
        "id": 124,
        "types": [
            "こおり",
            "エスパー"
        ]
    },
    "レアコイル": {
        "base_stats": {
            "a": 60,
            "b": 95,
            "c": 120,
            "d": 70,
            "h": 50,
            "s": 70
        },
        "id": 82,
        "types": [
            "でんき",
            "はがね"
        ]
    },
    "レイスポス": {
        "base_stats": {
            "a": 65,
            "b": 60,
            "c": 145,
            "d": 80,
            "h": 100,
            "s": 130
        },
        "id": 897,
        "types": [
            "ゴースト"
        ]
    },
    "レシラム": {
        "base_stats": {
            "a": 120,
            "b": 100,
            "c": 150,
            "d": 120,
            "h": 100,
            "s": 90
        },
        "id": 643,
        "types": [
            "ドラゴン",
            "ほのお"
        ]
    },
    "レジアイス": {
        "base_stats": {
            "a": 50,
            "b": 100,
            "c": 100,
            "d": 200,
            "h": 80,
            "s": 50
        },
        "id": 378,
        "types": [
            "こおり"
        ]
    },
    "レジエレキ": {
        "base_stats": {
            "a": 100,
            "b": 50,
            "c": 100,
            "d": 50,
            "h": 80,
            "s": 200
        },
        "id": 894,
        "types": [
            "でんき"
        ]
    },
    "レジギガス": {
        "base_stats": {
            "a": 160,
            "b": 110,
            "c": 80,
            "d": 110,
            "h": 110,
            "s": 100
        },
        "id": 486,
        "types": [
            "ノーマル"
        ]
    },
    "レジスチル": {
        "base_stats": {
            "a": 75,
            "b": 150,
            "c": 75,
            "d": 150,
            "h": 80,
            "s": 50
        },
        "id": 379,
        "types": [
            "はがね"
        ]
    },
    "レジドラゴ": {
        "base_stats": {
            "a": 100,
            "b": 50,
            "c": 100,
            "d": 50,
            "h": 200,
            "s": 80
        },
        "id": 895,
        "types": [
            "ドラゴン"
        ]
    },
    "レジロック": {
        "base_stats": {
            "a": 100,
            "b": 200,
            "c": 50,
            "d": 100,
            "h": 80,
            "s": 50
        },
        "id": 377,
        "types": [
            "いわ"
        ]
    },
    "レックウザ": {
        "base_stats": {
            "a": 150,
            "b": 90,
            "c": 150,
            "d": 90,
            "h": 105,
            "s": 95
        },
        "id": 384,
        "types": [
            "ドラゴン",
            "ひこう"
        ]
    },
    "レディアン": {
        "base_stats": {
            "a": 35,
            "b": 50,
            "c": 55,
            "d": 110,
            "h": 55,
            "s": 85
        },
        "id": 166,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "レディバ": {
        "base_stats": {
            "a": 20,
            "b": 30,
            "c": 40,
            "d": 80,
            "h": 40,
            "s": 55
        },
        "id": 165,
        "types": [
            "むし",
            "ひこう"
        ]
    },
    "レドームシ": {
        "base_stats": {
            "a": 35,
            "b": 80,
            "c": 50,
            "d": 90,
            "h": 50,
            "s": 30
        },
        "id": 825,
        "types": [
            "むし",
            "エスパー"
        ]
    },
    "レパルダス": {
        "base_stats": {
            "a": 88,
            "b": 50,
            "c": 88,
            "d": 50,
            "h": 64,
            "s": 106
        },
        "id": 510,
        "types": [
            "あく"
        ]
    },
    "レントラー": {
        "base_stats": {
            "a": 120,
            "b": 79,
            "c": 95,
            "d": 79,
            "h": 80,
            "s": 70
        },
        "id": 405,
        "types": [
            "でんき"
        ]
    },
    "ロコン": {
        "base_stats": {
            "a": 41,
            "b": 40,
            "c": 50,
            "d": 65,
            "h": 38,
            "s": 65
        },
        "id": 37,
        "types": [
            "ほのお"
        ]
    },
    "ロズレイド": {
        "base_stats": {
            "a": 70,
            "b": 65,
            "c": 125,
            "d": 105,
            "h": 60,
            "s": 90
        },
        "id": 407,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ロゼリア": {
        "base_stats": {
            "a": 60,
            "b": 45,
            "c": 100,
            "d": 80,
            "h": 50,
            "s": 65
        },
        "id": 315,
        "types": [
            "くさ",
            "どく"
        ]
    },
    "ロトム": {
        "base_stats": {
            "a": 50,
            "b": 77,
            "c": 95,
            "d": 77,
            "h": 50,
            "s": 91
        },
        "id": 479,
        "types": [
            "でんき",
            "ゴースト"
        ]
    },
    "ローブシン": {
        "base_stats": {
            "a": 140,
            "b": 95,
            "c": 55,
            "d": 65,
            "h": 105,
            "s": 45
        },
        "id": 534,
        "types": [
            "かくとう"
        ]
    },
    "ワカシャモ": {
        "base_stats": {
            "a": 85,
            "b": 60,
            "c": 85,
            "d": 60,
            "h": 60,
            "s": 55
        },
        "id": 256,
        "types": [
            "ほのお",
            "かくとう"
        ]
    },
    "ワシボン": {
        "base_stats": {
            "a": 83,
            "b": 50,
            "c": 37,
            "d": 50,
            "h": 70,
            "s": 60
        },
        "id": 627,
        "types": [
            "ノーマル",
            "ひこう"
        ]
    },
    "ワタシラガ": {
        "base_stats": {
            "a": 50,
            "b": 90,
            "c": 80,
            "d": 120,
            "h": 60,
            "s": 60
        },
        "id": 830,
        "types": [
            "くさ"
        ]
    },
    "ワタッコ": {
        "base_stats": {
            "a": 55,
            "b": 70,
            "c": 55,
            "d": 95,
            "h": 75,
            "s": 110
        },
        "id": 189,
        "types": [
            "くさ",
            "ひこう"
        ]
    },
    "ワッカネズミ": {
        "base_stats": {
            "a": 50,
            "b": 45,
            "c": 40,
            "d": 45,
            "h": 50,
            "s": 75
        },
        "id": 924,
        "types": [
            "ノーマル"
        ]
    },
    "ワナイダー": {
        "base_stats": {
            "a": 79,
            "b": 92,
            "c": 52,
            "d": 86,
            "h": 60,
            "s": 35
        },
        "id": 918,
        "types": [
            "むし"
        ]
    },
    "ワニノコ": {
        "base_stats": {
            "a": 65,
            "b": 64,
            "c": 44,
            "d": 48,
            "h": 50,
            "s": 43
        },
        "id": 158,
        "types": [
            "みず"
        ]
    },
    "ワルビアル": {
        "base_stats": {
            "a": 117,
            "b": 80,
            "c": 65,
            "d": 70,
            "h": 95,
            "s": 92
        },
        "id": 553,
        "types": [
            "じめん",
            "あく"
        ]
    },
    "ワルビル": {
        "base_stats": {
            "a": 82,
            "b": 45,
            "c": 45,
            "d": 45,
            "h": 60,
            "s": 74
        },
        "id": 552,
        "types": [
            "じめん",
            "あく"
        ]
    },
    "ワンパチ": {
        "base_stats": {
            "a": 45,
            "b": 50,
            "c": 40,
            "d": 50,
            "h": 59,
            "s": 26
        },
        "id": 835,
        "types": [
            "でんき"
        ]
    },
    "ワンリキー": {
        "base_stats": {
            "a": 80,
            "b": 50,
            "c": 35,
            "d": 35,
            "h": 70,
            "s": 35
        },
        "id": 66,
        "types": [
            "かくとう"
        ]
    },
    "メガフシギバナ": {
        "id": 10033,
        "types": [
            "くさ",
            "どく"
        ],
        "base_stats": {
            "h": 80,
            "a": 100,
            "b": 123,
            "c": 122,
            "d": 120,
            "s": 80
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/003_1.png"
    },
    "メガリザードンX": {
        "id": 10034,
        "types": [
            "ほのお",
            "ドラゴン"
        ],
        "base_stats": {
            "h": 78,
            "a": 130,
            "b": 111,
            "c": 130,
            "d": 85,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/006_1.png"
    },
    "メガリザードンY": {
        "id": 10035,
        "types": [
            "ほのお",
            "ひこう"
        ],
        "base_stats": {
            "h": 78,
            "a": 104,
            "b": 78,
            "c": 159,
            "d": 115,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/006_2.png"
    },
    "メガカメックス": {
        "id": 10036,
        "types": [
            "みず"
        ],
        "base_stats": {
            "h": 79,
            "a": 103,
            "b": 120,
            "c": 135,
            "d": 115,
            "s": 78
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/009_1.png"
    },
    "メガフーディン": {
        "id": 10037,
        "types": [
            "エスパー"
        ],
        "base_stats": {
            "h": 55,
            "a": 50,
            "b": 65,
            "c": 175,
            "d": 105,
            "s": 150
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/065_1.png"
    },
    "メガゲンガー": {
        "id": 10038,
        "types": [
            "ゴースト",
            "どく"
        ],
        "base_stats": {
            "h": 60,
            "a": 65,
            "b": 80,
            "c": 170,
            "d": 95,
            "s": 130
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/094_1.png"
    },
    "メガガルーラ": {
        "id": 10039,
        "types": [
            "ノーマル"
        ],
        "base_stats": {
            "h": 105,
            "a": 125,
            "b": 100,
            "c": 60,
            "d": 100,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/115_1.png"
    },
    "メガカイロス": {
        "id": 10040,
        "types": [
            "むし",
            "ひこう"
        ],
        "base_stats": {
            "h": 65,
            "a": 155,
            "b": 120,
            "c": 65,
            "d": 90,
            "s": 105
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/127_1.png"
    },
    "メガギャラドス": {
        "id": 10041,
        "types": [
            "みず",
            "あく"
        ],
        "base_stats": {
            "h": 95,
            "a": 155,
            "b": 109,
            "c": 70,
            "d": 130,
            "s": 81
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/130_1.png"
    },
    "メガプテラ": {
        "id": 10042,
        "types": [
            "いわ",
            "ひこう"
        ],
        "base_stats": {
            "h": 80,
            "a": 135,
            "b": 85,
            "c": 70,
            "d": 95,
            "s": 150
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/142_1.png"
    },
    "メガミュウツーX": {
        "id": 10043,
        "types": [
            "エスパー",
            "かくとう"
        ],
        "base_stats": {
            "h": 106,
            "a": 190,
            "b": 100,
            "c": 154,
            "d": 100,
            "s": 130
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/150_1.png"
    },
    "メガミュウツーY": {
        "id": 10044,
        "types": [
            "エスパー"
        ],
        "base_stats": {
            "h": 106,
            "a": 150,
            "b": 70,
            "c": 194,
            "d": 120,
            "s": 140
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/150_2.png"
    },
    "メガデンリュウ": {
        "id": 10045,
        "types": [
            "でんき",
            "ドラゴン"
        ],
        "base_stats": {
            "h": 90,
            "a": 95,
            "b": 105,
            "c": 165,
            "d": 110,
            "s": 45
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/181_1.png"
    },
    "メガハッサム": {
        "id": 10046,
        "types": [
            "むし",
            "はがね"
        ],
        "base_stats": {
            "h": 70,
            "a": 150,
            "b": 140,
            "c": 65,
            "d": 100,
            "s": 75
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/212_1.png"
    },
    "メガヘラクロス": {
        "id": 10047,
        "types": [
            "むし",
            "かくとう"
        ],
        "base_stats": {
            "h": 80,
            "a": 185,
            "b": 115,
            "c": 40,
            "d": 105,
            "s": 75
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/214_1.png"
    },
    "メガヘルガー": {
        "id": 10048,
        "types": [
            "あく",
            "ほのお"
        ],
        "base_stats": {
            "h": 75,
            "a": 90,
            "b": 90,
            "c": 140,
            "d": 90,
            "s": 115
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/229_1.png"
    },
    "メガバンギラス": {
        "id": 10049,
        "types": [
            "いわ",
            "あく"
        ],
        "base_stats": {
            "h": 100,
            "a": 164,
            "b": 150,
            "c": 95,
            "d": 120,
            "s": 71
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/248_1.png"
    },
    "メガバシャーモ": {
        "id": 10050,
        "types": [
            "ほのお",
            "かくとう"
        ],
        "base_stats": {
            "h": 80,
            "a": 160,
            "b": 80,
            "c": 130,
            "d": 80,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/257_1.png"
    },
    "メガサーナイト": {
        "id": 10051,
        "types": [
            "エスパー",
            "フェアリー"
        ],
        "base_stats": {
            "h": 68,
            "a": 85,
            "b": 65,
            "c": 165,
            "d": 135,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/282_1.png"
    },
    "メガクチート": {
        "id": 10052,
        "types": [
            "はがね",
            "フェアリー"
        ],
        "base_stats": {
            "h": 50,
            "a": 147,
            "b": 125,
            "c": 55,
            "d": 95,
            "s": 50
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/303_1.png"
    },
    "メガボスゴドラ": {
        "id": 10053,
        "types": [
            "はがね"
        ],
        "base_stats": {
            "h": 70,
            "a": 140,
            "b": 230,
            "c": 60,
            "d": 80,
            "s": 50
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/306_1.png"
    },
    "メガチャーレム": {
        "id": 10054,
        "types": [
            "かくとう",
            "エスパー"
        ],
        "base_stats": {
            "h": 60,
            "a": 140,
            "b": 85,
            "c": 80,
            "d": 85,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/308_1.png"
    },
    "メガライボルト": {
        "id": 10055,
        "types": [
            "でんき"
        ],
        "base_stats": {
            "h": 70,
            "a": 75,
            "b": 80,
            "c": 135,
            "d": 80,
            "s": 135
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/310_1.png"
    },
    "メガジュペッタ": {
        "id": 10056,
        "types": [
            "ゴースト"
        ],
        "base_stats": {
            "h": 64,
            "a": 165,
            "b": 75,
            "c": 93,
            "d": 83,
            "s": 75
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/354_1.png"
    },
    "メガアブソル": {
        "id": 10057,
        "types": [
            "あく"
        ],
        "base_stats": {
            "h": 65,
            "a": 150,
            "b": 60,
            "c": 115,
            "d": 60,
            "s": 115
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/359_1.png"
    },
    "メガガブリアス": {
        "id": 10058,
        "types": [
            "ドラゴン",
            "じめん"
        ],
        "base_stats": {
            "h": 108,
            "a": 170,
            "b": 115,
            "c": 120,
            "d": 95,
            "s": 92
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/445_1.png"
    },
    "メガルカリオ": {
        "id": 10059,
        "types": [
            "かくとう",
            "はがね"
        ],
        "base_stats": {
            "h": 70,
            "a": 145,
            "b": 88,
            "c": 140,
            "d": 70,
            "s": 112
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/448_1.png"
    },
    "メガユキノオー": {
        "id": 10060,
        "types": [
            "くさ",
            "こおり"
        ],
        "base_stats": {
            "h": 90,
            "a": 132,
            "b": 105,
            "c": 132,
            "d": 105,
            "s": 30
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/460_1.png"
    },
    "メガラティアス": {
        "id": 10062,
        "types": [
            "ドラゴン",
            "エスパー"
        ],
        "base_stats": {
            "h": 80,
            "a": 100,
            "b": 120,
            "c": 140,
            "d": 150,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/380_1.png"
    },
    "メガラティオス": {
        "id": 10063,
        "types": [
            "ドラゴン",
            "エスパー"
        ],
        "base_stats": {
            "h": 80,
            "a": 130,
            "b": 100,
            "c": 160,
            "d": 120,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/381_1.png"
    },
    "メガラグラージ": {
        "id": 10064,
        "types": [
            "みず",
            "じめん"
        ],
        "base_stats": {
            "h": 100,
            "a": 150,
            "b": 110,
            "c": 95,
            "d": 110,
            "s": 70
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/260_1.png"
    },
    "メガジュカイン": {
        "id": 10065,
        "types": [
            "くさ",
            "ドラゴン"
        ],
        "base_stats": {
            "h": 70,
            "a": 110,
            "b": 75,
            "c": 145,
            "d": 85,
            "s": 145
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/254_1.png"
    },
    "メガヤミラミ": {
        "id": 10066,
        "types": [
            "あく",
            "ゴースト"
        ],
        "base_stats": {
            "h": 50,
            "a": 85,
            "b": 125,
            "c": 85,
            "d": 115,
            "s": 20
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/302_1.png"
    },
    "メガチルタリス": {
        "id": 10067,
        "types": [
            "ドラゴン",
            "フェアリー"
        ],
        "base_stats": {
            "h": 75,
            "a": 110,
            "b": 110,
            "c": 110,
            "d": 105,
            "s": 80
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/334_1.png"
    },
    "メガエルレイド": {
        "id": 10093,
        "types": [
            "エスパー",
            "かくとう"
        ],
        "base_stats": {
            "h": 68,
            "a": 165,
            "b": 95,
            "c": 65,
            "d": 115,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/475_1.png"
    },
    "メガタブンネ": {
        "id": 10091,
        "types": [
            "ノーマル",
            "フェアリー"
        ],
        "base_stats": {
            "h": 103,
            "a": 60,
            "b": 126,
            "c": 80,
            "d": 126,
            "s": 50
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/531_1.png"
    },
    "メガサメハダー": {
        "id": 10070,
        "types": [
            "みず",
            "あく"
        ],
        "base_stats": {
            "h": 70,
            "a": 140,
            "b": 70,
            "c": 110,
            "d": 65,
            "s": 105
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/319_1.png"
    },
    "メガヤドラン": {
        "id": 10071,
        "types": [
            "みず",
            "エスパー"
        ],
        "base_stats": {
            "h": 95,
            "a": 75,
            "b": 180,
            "c": 130,
            "d": 80,
            "s": 30
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/080_1.png"
    },
    "メガハガネール": {
        "id": 10072,
        "types": [
            "はがね",
            "じめん"
        ],
        "base_stats": {
            "h": 75,
            "a": 125,
            "b": 230,
            "c": 55,
            "d": 95,
            "s": 30
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/208_1.png"
    },
    "メガピジョット": {
        "id": 10073,
        "types": [
            "ノーマル",
            "ひこう"
        ],
        "base_stats": {
            "h": 83,
            "a": 80,
            "b": 80,
            "c": 135,
            "d": 80,
            "s": 121
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/018_1.png"
    },
    "メガオニゴーリ": {
        "id": 10074,
        "types": [
            "こおり"
        ],
        "base_stats": {
            "h": 80,
            "a": 120,
            "b": 80,
            "c": 120,
            "d": 80,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/362_1.png"
    },
    "メガディアンシー": {
        "id": 10075,
        "types": [
            "いわ",
            "フェアリー"
        ],
        "base_stats": {
            "h": 50,
            "a": 160,
            "b": 110,
            "c": 160,
            "d": 110,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/719_1.png"
    },
    "メガメタグロス": {
        "id": 10076,
        "types": [
            "はがね",
            "エスパー"
        ],
        "base_stats": {
            "h": 80,
            "a": 145,
            "b": 150,
            "c": 105,
            "d": 110,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/376_1.png"
    },
    "メガレックウザ": {
        "id": 10079,
        "types": [
            "ドラゴン",
            "ひこう"
        ],
        "base_stats": {
            "h": 105,
            "a": 180,
            "b": 100,
            "c": 180,
            "d": 100,
            "s": 115
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/384_1.png"
    },
    "メガバクーダ": {
        "id": 10087,
        "types": [
            "ほのお",
            "じめん"
        ],
        "base_stats": {
            "h": 70,
            "a": 120,
            "b": 100,
            "c": 145,
            "d": 105,
            "s": 20
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/323_1.png"
    },
    "メガミミロップ": {
        "id": 10088,
        "types": [
            "ノーマル",
            "かくとう"
        ],
        "base_stats": {
            "h": 65,
            "a": 136,
            "b": 94,
            "c": 54,
            "d": 96,
            "s": 135
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/428_1.png"
    },
    "メガボーマンダ": {
        "id": 10089,
        "types": [
            "ドラゴン",
            "ひこう"
        ],
        "base_stats": {
            "h": 95,
            "a": 145,
            "b": 130,
            "c": 120,
            "d": 90,
            "s": 120
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/373_1.png"
    },
    "メガスピアー": {
        "id": 10090,
        "types": [
            "むし",
            "どく"
        ],
        "base_stats": {
            "h": 65,
            "a": 150,
            "b": 40,
            "c": 15,
            "d": 80,
            "s": 145
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/015_1.png"
    },
    "メガフラエッテ": {
        "id": 10061,
        "types": [
            "フェアリー"
        ],
        "base_stats": {
            "h": 74,
            "a": 85,
            "b": 87,
            "c": 155,
            "d": 148,
            "s": 102
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/670_1.png"
    },
    "メガマフォクシー": {
        "id": 655,
        "types": [
            "ほのお",
            "エスパー"
        ],
        "base_stats": {
            "h": 75,
            "a": 69,
            "b": 72,
            "c": 159,
            "d": 125,
            "s": 134
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/655_1.png"
    },
    "メガゲッコウガ": {
        "id": 10116,
        "types": [
            "みず",
            "あく"
        ],
        "base_stats": {
            "h": 72,
            "a": 125,
            "b": 77,
            "c": 133,
            "d": 81,
            "s": 142
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/658_1.png"
    },
    "メガブリガロン": {
        "id": 652,
        "types": [
            "くさ",
            "かくとう"
        ],
        "base_stats": {
            "h": 88,
            "a": 137,
            "b": 172,
            "c": 74,
            "d": 115,
            "s": 44
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/652_1.png"
    },
    "メガメガニウム": {
        "id": 154,
        "types": [
            "くさ",
            "フェアリー"
        ],
        "base_stats": {
            "h": 80,
            "a": 92,
            "b": 115,
            "c": 143,
            "d": 115,
            "s": 80
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/154_1.png"
    },
    "メガオーダイル": {
        "id": 160,
        "types": [
            "みず",
            "あく"
        ],
        "base_stats": {
            "h": 85,
            "a": 160,
            "b": 125,
            "c": 89,
            "d": 93,
            "s": 78
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/160_1.png"
    },
    "メガエンブオー": {
        "id": 500,
        "types": [
            "ほのお",
            "かくとう"
        ],
        "base_stats": {
            "h": 110,
            "a": 148,
            "b": 75,
            "c": 110,
            "d": 110,
            "s": 75
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/500_1.png"
    },
    "メガスターミー": {
        "id": 121,
        "types": [
            "みず",
            "エスパー"
        ],
        "base_stats": {
            "h": 60,
            "a": 140,
            "b": 105,
            "c": 130,
            "d": 105,
            "s": 120
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/121_1.png"
    },
    "メガピクシー": {
        "id": 36,
        "types": [
            "フェアリー"
        ],
        "base_stats": {
            "h": 95,
            "a": 80,
            "b": 93,
            "c": 135,
            "d": 110,
            "s": 70
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/036_1.png"
    },
    "メガカイリュー": {
        "id": 149,
        "types": [
            "ドラゴン",
            "ひこう"
        ],
        "base_stats": {
            "h": 91,
            "a": 124,
            "b": 115,
            "c": 145,
            "d": 125,
            "s": 100
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/149_1.png"
    },
    "メガケケンカニ": {
        "id": 740,
        "types": [
            "かくとう",
            "こおり"
        ],
        "base_stats": {
            "h": 97,
            "a": 157,
            "b": 122,
            "c": 62,
            "d": 107,
            "s": 33
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/740_1.png"
    },
    "メガキラフロル": {
        "id": 970,
        "types": [
            "いわ",
            "どく"
        ],
        "base_stats": {
            "h": 83,
            "a": 90,
            "b": 105,
            "c": 150,
            "d": 96,
            "s": 101
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/970_1.png"
    },
    "メガユキメノコ": {
        "id": 478,
        "types": [
            "こおり",
            "ゴースト"
        ],
        "base_stats": {
            "h": 70,
            "a": 80,
            "b": 70,
            "c": 140,
            "d": 100,
            "s": 120
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/478_1.png"
    },
    "メガルチャブル": {
        "id": 701,
        "types": [
            "かくとう",
            "ひこう"
        ],
        "base_stats": {
            "h": 78,
            "a": 137,
            "b": 100,
            "c": 74,
            "d": 93,
            "s": 118
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/701_1.png"
    },
    "メガエアームド": {
        "id": 227,
        "types": [
            "はがね",
            "ひこう"
        ],
        "base_stats": {
            "h": 65,
            "a": 140,
            "b": 110,
            "c": 40,
            "d": 100,
            "s": 110
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/227_1.png"
    },
    "メガチリーン": {
        "id": 358,
        "types": [
            "エスパー",
            "フェアリー"
        ],
        "base_stats": {
            "h": 75,
            "a": 50,
            "b": 110,
            "c": 135,
            "d": 120,
            "s": 65
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/358_1.png"
    },
    "メガゴルーグ": {
        "id": 623,
        "types": [
            "じめん",
            "ゴースト"
        ],
        "base_stats": {
            "h": 89,
            "a": 159,
            "b": 105,
            "c": 70,
            "d": 105,
            "s": 55
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/623_1.png"
    },
    "メガスコヴィラン": {
        "id": 952,
        "types": [
            "くさ",
            "ほのお"
        ],
        "base_stats": {
            "h": 65,
            "a": 138,
            "b": 85,
            "c": 138,
            "d": 85,
            "s": 75
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/939_1.png"
    },
    "メガウツボット": {
        "id": 71,
        "types": [
            "くさ",
            "どく"
        ],
        "base_stats": {
            "h": 80,
            "a": 125,
            "b": 85,
            "c": 135,
            "d": 95,
            "s": 70
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/071_1.png"
    },
    "メガシャンデラ": {
        "id": 609,
        "types": [
            "ゴースト",
            "ほのお"
        ],
        "base_stats": {
            "h": 60,
            "a": 75,
            "b": 110,
            "c": 175,
            "d": 110,
            "s": 90
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/609_1.png"
    },
    "メガドリュウズ": {
        "id": 530,
        "types": [
            "じめん",
            "はがね"
        ],
        "base_stats": {
            "h": 110,
            "a": 165,
            "b": 100,
            "c": 65,
            "d": 65,
            "s": 103
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/530_1.png"
    },
    "メガニャオニクス": {
        "id": 678,
        "types": [
            "エスパー"
        ],
        "base_stats": {
            "h": 74,
            "a": 48,
            "b": 116,
            "c": 123,
            "d": 121,
            "s": 84
        },
        "img_url": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/79ed8b43461eacf1874a3c985ede0ca74abd6a32.jpg"
    },
    "メガジジーロン": {
        "id": 780,
        "types": [
            "ノーマル",
            "ドラゴン"
        ],
        "base_stats": {
            "h": 78,
            "a": 85,
            "b": 110,
            "c": 160,
            "d": 116,
            "s": 36
        },
        "img_url": "https://img.gamewith.jp/article_tools/pokemon-za/gacha/780_1.png"
    },
    "カミッチュ": {
        "h": 80,
        "a": 80,
        "b": 110,
        "c": 95,
        "d": 80,
        "s": 40,
        "base_stats": {
            "h": 80,
            "a": 80,
            "b": 110,
            "c": 95,
            "d": 80,
            "s": 40
        },
        "types": [
            "くさ",
            "ドラゴン"
        ],
        "id": 1011
    },
    "チャデス": {
        "h": 40,
        "a": 45,
        "b": 45,
        "c": 74,
        "d": 54,
        "s": 50,
        "base_stats": {
            "h": 40,
            "a": 45,
            "b": 45,
            "c": 74,
            "d": 54,
            "s": 50
        },
        "types": [
            "くさ",
            "ゴースト"
        ],
        "id": 1012
    },
    "ヤバソチャ": {
        "h": 71,
        "a": 60,
        "b": 106,
        "c": 121,
        "d": 80,
        "s": 70,
        "base_stats": {
            "h": 71,
            "a": 60,
            "b": 106,
            "c": 121,
            "d": 80,
            "s": 70
        },
        "types": [
            "くさ",
            "ゴースト"
        ],
        "id": 1013
    },
    "イイネイヌ": {
        "h": 88,
        "a": 128,
        "b": 115,
        "c": 58,
        "d": 86,
        "s": 80,
        "base_stats": {
            "h": 88,
            "a": 128,
            "b": 115,
            "c": 58,
            "d": 86,
            "s": 80
        },
        "types": [
            "どく",
            "かくとう"
        ],
        "id": 1014
    },
    "マシマシラ": {
        "h": 88,
        "a": 75,
        "b": 66,
        "c": 130,
        "d": 90,
        "s": 106,
        "base_stats": {
            "h": 88,
            "a": 75,
            "b": 66,
            "c": 130,
            "d": 90,
            "s": 106
        },
        "types": [
            "どく",
            "エスパー"
        ],
        "id": 1015
    },
    "キチキギス": {
        "h": 88,
        "a": 91,
        "b": 82,
        "c": 70,
        "d": 125,
        "s": 99,
        "base_stats": {
            "h": 88,
            "a": 91,
            "b": 82,
            "c": 70,
            "d": 125,
            "s": 99
        },
        "types": [
            "どく",
            "フェアリー"
        ],
        "id": 1016
    },
    "オーガポン": {
        "h": 80,
        "a": 120,
        "b": 84,
        "c": 60,
        "d": 96,
        "s": 110,
        "base_stats": {
            "h": 80,
            "a": 120,
            "b": 84,
            "c": 60,
            "d": 96,
            "s": 110
        },
        "types": [
            "くさ"
        ],
        "id": 1017
    },
    "ブリジュラス": {
        "h": 90,
        "a": 105,
        "b": 130,
        "c": 125,
        "d": 65,
        "s": 85,
        "base_stats": {
            "h": 90,
            "a": 105,
            "b": 130,
            "c": 125,
            "d": 65,
            "s": 85
        },
        "types": [
            "はがね",
            "ドラゴン"
        ],
        "id": 1018
    },
    "カミツオロチ": {
        "h": 106,
        "a": 80,
        "b": 110,
        "c": 120,
        "d": 80,
        "s": 44,
        "base_stats": {
            "h": 106,
            "a": 80,
            "b": 110,
            "c": 120,
            "d": 80,
            "s": 44
        },
        "types": [
            "くさ",
            "ドラゴン"
        ],
        "id": 1019
    },
    "ウガツホムラ": {
        "h": 105,
        "a": 115,
        "b": 121,
        "c": 65,
        "d": 93,
        "s": 91,
        "base_stats": {
            "h": 105,
            "a": 115,
            "b": 121,
            "c": 65,
            "d": 93,
            "s": 91
        },
        "types": [
            "ほのお",
            "ドラゴン"
        ],
        "id": 1020
    },
    "タケルライコ": {
        "h": 125,
        "a": 73,
        "b": 91,
        "c": 137,
        "d": 89,
        "s": 75,
        "base_stats": {
            "h": 125,
            "a": 73,
            "b": 91,
            "c": 137,
            "d": 89,
            "s": 75
        },
        "types": [
            "でんき",
            "ドラゴン"
        ],
        "id": 1021
    },
    "テツノイワオ": {
        "h": 90,
        "a": 120,
        "b": 80,
        "c": 68,
        "d": 108,
        "s": 124,
        "base_stats": {
            "h": 90,
            "a": 120,
            "b": 80,
            "c": 68,
            "d": 108,
            "s": 124
        },
        "types": [
            "いわ",
            "エスパー"
        ],
        "id": 1022
    },
    "テツノカシラ": {
        "h": 90,
        "a": 72,
        "b": 100,
        "c": 122,
        "d": 108,
        "s": 98,
        "base_stats": {
            "h": 90,
            "a": 72,
            "b": 100,
            "c": 122,
            "d": 108,
            "s": 98
        },
        "types": [
            "はがね",
            "エスパー"
        ],
        "id": 1023
    },
    "テラパゴス": {
        "h": 90,
        "a": 65,
        "b": 85,
        "c": 65,
        "d": 85,
        "s": 60,
        "base_stats": {
            "h": 90,
            "a": 65,
            "b": 85,
            "c": 65,
            "d": 85,
            "s": 60
        },
        "types": [
            "ノーマル"
        ],
        "id": 1024
    },
    "モモワロウ": {
        "h": 88,
        "a": 88,
        "b": 160,
        "c": 88,
        "d": 88,
        "s": 88,
        "base_stats": {
            "h": 88,
            "a": 88,
            "b": 160,
            "c": 88,
            "d": 88,
            "s": 88
        },
        "types": [
            "どく",
            "ゴースト"
        ],
        "id": 1025
    },
    "オーガポン(水)": {
        "h": 80,
        "a": 120,
        "b": 84,
        "c": 60,
        "d": 96,
        "s": 110,
        "base_stats": {
            "h": 80,
            "a": 120,
            "b": 84,
            "c": 60,
            "d": 96,
            "s": 110
        },
        "types": [
            "くさ",
            "みず"
        ],
        "id": 10273
    },
    "オーガポン(炎)": {
        "h": 80,
        "a": 120,
        "b": 84,
        "c": 60,
        "d": 96,
        "s": 110,
        "base_stats": {
            "h": 80,
            "a": 120,
            "b": 84,
            "c": 60,
            "d": 96,
            "s": 110
        },
        "types": [
            "くさ",
            "ほのお"
        ],
        "id": 10274
    },
    "オーガポン(岩)": {
        "h": 80,
        "a": 120,
        "b": 84,
        "c": 60,
        "d": 96,
        "s": 110,
        "base_stats": {
            "h": 80,
            "a": 120,
            "b": 84,
            "c": 60,
            "d": 96,
            "s": 110
        },
        "types": [
            "くさ",
            "いわ"
        ],
        "id": 10275
    },
    "ガチグマ(アカツキ)": {
        "h": 113,
        "a": 70,
        "b": 120,
        "c": 135,
        "d": 65,
        "s": 52,
        "base_stats": {
            "h": 113,
            "a": 70,
            "b": 120,
            "c": 135,
            "d": 65,
            "s": 52
        },
        "types": [
            "じめん",
            "ノーマル"
        ],
        "id": 10272
    },
    "テラパゴス(テラスタル)": {
        "h": 95,
        "a": 95,
        "b": 110,
        "c": 105,
        "d": 110,
        "s": 85,
        "base_stats": {
            "h": 95,
            "a": 95,
            "b": 110,
            "c": 105,
            "d": 110,
            "s": 85
        },
        "types": [
            "ノーマル"
        ],
        "id": 1024
    },
    "テラパゴス(ステラ)": {
        "h": 160,
        "a": 105,
        "b": 110,
        "c": 130,
        "d": 110,
        "s": 85,
        "base_stats": {
            "h": 160,
            "a": 105,
            "b": 110,
            "c": 130,
            "d": 110,
            "s": 85
        },
        "types": [
            "ノーマル"
        ],
        "id": 1024
    }
}

moves = {
    "あおいほのお": {
        "accuracy": 85,
        "category": "特殊",
        "power": 130,
        "type": "ほのお"
    },
    "あくうせつだん": {
        "accuracy": 95,
        "category": "特殊",
        "power": 100,
        "type": "ドラゴン"
    },
    "あくのはどう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "あく"
    },
    "あてみなげ": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "かくとう"
    },
    "あなをほる": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "じめん"
    },
    "あばれる": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ノーマル"
    },
    "あやしいかぜ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ゴースト"
    },
    "あわ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "みず"
    },
    "あんこくきょうだ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "あく"
    },
    "いあいぎり": {
        "accuracy": 95,
        "category": "物理",
        "power": 50,
        "type": "ノーマル"
    },
    "いかり": {
        "accuracy": 100,
        "category": "物理",
        "power": 20,
        "type": "ノーマル"
    },
    "いきいきバブル": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "みず"
    },
    "いじげんホール": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "いじげんラッシュ": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "あく"
    },
    "いっちょうあがり": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ドラゴン"
    },
    "いてつくしせん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "エスパー"
    },
    "いにしえのうた": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "ノーマル"
    },
    "いびき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "ノーマル"
    },
    "いわおとし": {
        "accuracy": 90,
        "category": "物理",
        "power": 50,
        "type": "いわ"
    },
    "いわくだき": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "かくとう"
    },
    "いわなだれ": {
        "accuracy": 90,
        "category": "物理",
        "power": 75,
        "type": "いわ"
    },
    "うずしお": {
        "accuracy": 85,
        "category": "特殊",
        "power": 35,
        "type": "みず"
    },
    "うたかたのアリア": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "みず",
        "is_sound": True
    },
    "うちおとす": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "いわ"
    },
    "うっぷんばらし": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "あく"
    },
    "うらみつらみ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "ゴースト"
    },
    "えだづき": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "くさ"
    },
    "おいうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "あく"
    },
    "おうふくビンタ": {
        "accuracy": 85,
        "category": "物理",
        "power": 15,
        "type": "ノーマル"
    },
    "おしゃべり": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "ひこう"
    },
    "おどろかす": {
        "accuracy": 100,
        "category": "物理",
        "power": 30,
        "type": "ゴースト"
    },
    "おはかまいり": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ゴースト"
    },
    "かいりき": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ノーマル"
    },
    "かえんぐるま": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ほのお"
    },
    "かえんだん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ほのお"
    },
    "かえんほうしゃ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "ほのお"
    },
    "かえんボール": {
        "accuracy": 90,
        "category": "物理",
        "power": 120,
        "type": "ほのお"
    },
    "かかとおとし": {
        "accuracy": 90,
        "category": "物理",
        "power": 120,
        "type": "かくとう"
    },
    "かげうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ゴースト"
    },
    "かげぬい": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ゴースト"
    },
    "かぜおこし": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "ひこう"
    },
    "かたきうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "かふんだんご": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "むし"
    },
    "かまいたち": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ノーマル"
    },
    "かみくだく": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "あく",
        "is_bite": True,
        "is_contact": True
    },
    "かみつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "あく",
        "is_bite": True
    },
    "かみなり": {
        "accuracy": 70,
        "category": "特殊",
        "power": 110,
        "type": "でんき"
    },
    "かみなりあらし": {
        "accuracy": 80,
        "category": "特殊",
        "power": 100,
        "type": "でんき"
    },
    "かみなりのキバ": {
        "accuracy": 95,
        "category": "物理",
        "power": 65,
        "type": "でんき",
        "is_bite": True
    },
    "かみなりパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "でんき",
        "is_punch": True,
        "is_contact": True
    },
    "からげんき": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "からてチョップ": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "かくとう"
    },
    "からではさむ": {
        "accuracy": 85,
        "category": "物理",
        "power": 35,
        "type": "みず"
    },
    "からみつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "ノーマル"
    },
    "かわらわり": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "かくとう"
    },
    "がんせきふうじ": {
        "accuracy": 95,
        "category": "物理",
        "power": 60,
        "type": "いわ"
    },
    "がんせきほう": {
        "accuracy": 90,
        "category": "物理",
        "power": 150,
        "type": "いわ"
    },
    "がんせきアックス": {
        "accuracy": 90,
        "category": "物理",
        "power": 65,
        "type": "いわ"
    },
    "きあいだま": {
        "accuracy": 70,
        "category": "特殊",
        "power": 120,
        "type": "かくとう"
    },
    "きあいパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 150,
        "type": "かくとう",
        "is_punch": True
    },
    "きつけ": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "きまぐレーザー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ドラゴン"
    },
    "きゅうけつ": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "むし"
    },
    "きょけんとつげき": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ドラゴン"
    },
    "きょじゅうざん": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "はがね",
        "is_slice": True,
        "is_contact": True
    },
    "きょじゅうだん": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "はがね"
    },
    "きらきらストーム": {
        "accuracy": 85,
        "category": "特殊",
        "power": 120,
        "type": "フェアリー"
    },
    "きりさく": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "ぎんいろのかぜ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "むし"
    },
    "くさのちかい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "くさ"
    },
    "くさわけ": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "くさ"
    },
    "くちばしキャノン": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "ひこう"
    },
    "くらいつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "あく"
    },
    "げきりん": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ドラゴン",
        "is_contact": True
    },
    "げんしのちから": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "いわ"
    },
    "こうげきしれい": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "むし"
    },
    "こうそくスピン": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ノーマル"
    },
    "こおりのいぶき": {
        "accuracy": 90,
        "category": "特殊",
        "power": 60,
        "type": "こおり"
    },
    "こおりのつぶて": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "こおり"
    },
    "こおりのキバ": {
        "accuracy": 95,
        "category": "物理",
        "power": 65,
        "type": "こおり",
        "is_bite": True
    },
    "こがらしあらし": {
        "accuracy": 80,
        "category": "特殊",
        "power": 100,
        "type": "ひこう"
    },
    "こごえるかぜ": {
        "accuracy": 95,
        "category": "特殊",
        "power": 55,
        "type": "こおり"
    },
    "こごえるせかい": {
        "accuracy": 95,
        "category": "特殊",
        "power": 65,
        "type": "こおり"
    },
    "こちこちフロスト": {
        "accuracy": 90,
        "category": "特殊",
        "power": 100,
        "type": "こおり"
    },
    "こなゆき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "こおり"
    },
    "このは": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "くさ"
    },
    "ころがる": {
        "accuracy": 90,
        "category": "物理",
        "power": 30,
        "type": "いわ"
    },
    "こんげんのはどう": {
        "accuracy": 85,
        "category": "特殊",
        "power": 110,
        "type": "みず"
    },
    "さばきのつぶて": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ノーマル"
    },
    "さわぐ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "ノーマル"
    },
    "ざぶざぶサーフ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "みず"
    },
    "しおづけ": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "いわ"
    },
    "しおふき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 150,
        "type": "みず"
    },
    "しおみず": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "みず"
    },
    "したでなめる": {
        "accuracy": 100,
        "category": "物理",
        "power": 30,
        "type": "ゴースト"
    },
    "しちせいだっこんたい": {
        "accuracy": 100,
        "category": "物理",
        "power": 195,
        "type": "ゴースト"
    },
    "しっとのほのお": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "ほのお"
    },
    "しっぺがえし": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "あく"
    },
    "しねんのずつき": {
        "accuracy": 90,
        "category": "物理",
        "power": 80,
        "type": "エスパー"
    },
    "しめつける": {
        "accuracy": 85,
        "category": "物理",
        "power": 15,
        "type": "ノーマル"
    },
    "しんくうは": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "かくとう"
    },
    "しんそく": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ノーマル"
    },
    "しんぴのちから": {
        "accuracy": 90,
        "category": "特殊",
        "power": 70,
        "type": "エスパー"
    },
    "しんぴのつるぎ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 85,
        "type": "かくとう"
    },
    "じごくぐるま": {
        "accuracy": 80,
        "category": "物理",
        "power": 80,
        "type": "かくとう"
    },
    "じごくづき": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "あく"
    },
    "じしん": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "じめん"
    },
    "じだんだ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "じめん"
    },
    "じならし": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "じめん"
    },
    "じばく": {
        "accuracy": 100,
        "category": "物理",
        "power": 200,
        "type": "ノーマル"
    },
    "じゃどくのくさり": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "どく"
    },
    "じゃれつく": {
        "accuracy": 90,
        "category": "物理",
        "power": 90,
        "type": "フェアリー",
        "is_contact": True
    },
    "じんつうりき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "じんらい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "でんき"
    },
    "すいとる": {
        "accuracy": 100,
        "category": "特殊",
        "power": 20,
        "type": "くさ"
    },
    "すいりゅうれんだ": {
        "accuracy": 100,
        "category": "物理",
        "power": 25,
        "type": "みず"
    },
    "すくすくボンバー": {
        "accuracy": 90,
        "category": "物理",
        "power": 100,
        "type": "くさ"
    },
    "すてみタックル": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ノーマル"
    },
    "すなじごく": {
        "accuracy": 85,
        "category": "物理",
        "power": 35,
        "type": "じめん"
    },
    "ずつき": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "せいなるつるぎ": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "かくとう",
        "is_slice": True,
        "is_contact": True
    },
    "せいなるほのお": {
        "accuracy": 95,
        "category": "物理",
        "power": 100,
        "type": "ほのお"
    },
    "そらをとぶ": {
        "accuracy": 95,
        "category": "物理",
        "power": 90,
        "type": "ひこう"
    },
    "たいあたり": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "たきのぼり": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "みず"
    },
    "たたきつける": {
        "accuracy": 75,
        "category": "物理",
        "power": 80,
        "type": "ノーマル"
    },
    "たたりめ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "ゴースト"
    },
    "たつまき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "ドラゴン"
    },
    "たまなげ": {
        "accuracy": 85,
        "category": "物理",
        "power": 15,
        "type": "ノーマル"
    },
    "だいちのちから": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "じめん"
    },
    "だいちのはどう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "ノーマル"
    },
    "だいばくはつ": {
        "accuracy": 100,
        "category": "物理",
        "power": 250,
        "type": "ノーマル"
    },
    "だいふんげき": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ほのお"
    },
    "だいもんじ": {
        "accuracy": 85,
        "category": "特殊",
        "power": 110,
        "type": "ほのお"
    },
    "だくりゅう": {
        "accuracy": 85,
        "category": "特殊",
        "power": 90,
        "type": "みず"
    },
    "だましうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "あく"
    },
    "だんがいのつるぎ": {
        "accuracy": 85,
        "category": "物理",
        "power": 120,
        "type": "じめん"
    },
    "ついばむ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ひこう"
    },
    "つけあがる": {
        "accuracy": 100,
        "category": "物理",
        "power": 20,
        "type": "あく"
    },
    "つじぎり": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "あく",
        "is_slice": True,
        "is_contact": True
    },
    "つっぱり": {
        "accuracy": 100,
        "category": "物理",
        "power": 15,
        "type": "かくとう"
    },
    "つつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 35,
        "type": "ひこう"
    },
    "つのでつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "ノーマル"
    },
    "つばさでうつ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ひこう"
    },
    "つばめがえし": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ひこう"
    },
    "つららおとし": {
        "accuracy": 90,
        "category": "物理",
        "power": 85,
        "type": "こおり"
    },
    "つららばり": {
        "accuracy": 100,
        "category": "物理",
        "power": 25,
        "type": "こおり"
    },
    "つるのムチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 45,
        "type": "くさ"
    },
    "てかげん": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "てっていこうせん": {
        "accuracy": 95,
        "category": "特殊",
        "power": 140,
        "type": "はがね"
    },
    "てんこがすめつぼうのひかり": {
        "accuracy": 100,
        "category": "特殊",
        "power": 200,
        "type": "エスパー"
    },
    "であいがしら": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "むし"
    },
    "でんきショック": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "でんき"
    },
    "でんげきくちばし": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "でんき"
    },
    "でんげきは": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "でんき"
    },
    "でんこうせっか": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "でんこうそうげき": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "でんき"
    },
    "でんじほう": {
        "accuracy": 50,
        "category": "特殊",
        "power": 120,
        "type": "でんき"
    },
    "ときのほうこう": {
        "accuracy": 90,
        "category": "特殊",
        "power": 150,
        "type": "ドラゴン"
    },
    "とげキャノン": {
        "accuracy": 100,
        "category": "物理",
        "power": 20,
        "type": "ノーマル"
    },
    "とっしん": {
        "accuracy": 85,
        "category": "物理",
        "power": 90,
        "type": "ノーマル"
    },
    "とっておき": {
        "accuracy": 100,
        "category": "物理",
        "power": 140,
        "type": "ノーマル"
    },
    "とどめばり": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "むし"
    },
    "とびかかる": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "むし"
    },
    "とびげり": {
        "accuracy": 95,
        "category": "物理",
        "power": 100,
        "type": "かくとう"
    },
    "とびつく": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "むし"
    },
    "とびはねる": {
        "accuracy": 85,
        "category": "物理",
        "power": 85,
        "type": "ひこう"
    },
    "とびひざげり": {
        "accuracy": 90,
        "category": "物理",
        "power": 130,
        "type": "かくとう"
    },
    "ともえなげ": {
        "accuracy": 90,
        "category": "物理",
        "power": 60,
        "type": "かくとう"
    },
    "とんぼがえり": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "むし",
        "is_contact": True
    },
    "どくづき": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "どく"
    },
    "どくどくのキバ": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "どく"
    },
    "どくばり": {
        "accuracy": 100,
        "category": "物理",
        "power": 15,
        "type": "どく"
    },
    "どくばりセンボン": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "どく"
    },
    "どげざつき": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "あく"
    },
    "どばどばオーラ": {
        "accuracy": 95,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "どろかけ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 20,
        "type": "じめん"
    },
    "どろばくだん": {
        "accuracy": 85,
        "category": "特殊",
        "power": 65,
        "type": "じめん"
    },
    "どろぼう": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "あく"
    },
    "なしくずし": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "なみのり": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "みず"
    },
    "にどげり": {
        "accuracy": 100,
        "category": "物理",
        "power": 30,
        "type": "かくとう"
    },
    "ねこだまし": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "ねっさのあらし": {
        "accuracy": 80,
        "category": "特殊",
        "power": 100,
        "type": "じめん"
    },
    "ねっさのだいち": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "じめん"
    },
    "ねっとう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "みず"
    },
    "ねっぷう": {
        "accuracy": 90,
        "category": "特殊",
        "power": 95,
        "type": "ほのお"
    },
    "ねらいうち": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "みず"
    },
    "ねんりき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "エスパー"
    },
    "のしかかり": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "ノーマル"
    },
    "はいよるいちげき": {
        "accuracy": 90,
        "category": "物理",
        "power": 70,
        "type": "むし"
    },
    "はかいこうせん": {
        "accuracy": 90,
        "category": "特殊",
        "power": 150,
        "type": "ノーマル"
    },
    "はがねのつばさ": {
        "accuracy": 90,
        "category": "物理",
        "power": 70,
        "type": "はがね"
    },
    "はさむ": {
        "accuracy": 100,
        "category": "物理",
        "power": 55,
        "type": "ノーマル"
    },
    "はじけるほのお": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "ほのお"
    },
    "はたきおとす": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "あく",
        "is_contact": True
    },
    "はたく": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "はっけい": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "かくとう"
    },
    "はっぱカッター": {
        "accuracy": 95,
        "category": "物理",
        "power": 55,
        "type": "くさ"
    },
    "はどうだん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "かくとう"
    },
    "はなびらのまい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "くさ"
    },
    "はなふぶき": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "くさ"
    },
    "はめつのねがい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 140,
        "type": "はがね"
    },
    "はめつのひかり": {
        "accuracy": 90,
        "category": "特殊",
        "power": 140,
        "type": "フェアリー"
    },
    "はやてがえし": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "かくとう"
    },
    "はるのあらし": {
        "accuracy": 80,
        "category": "特殊",
        "power": 100,
        "type": "フェアリー"
    },
    "ばかぢから": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "かくとう"
    },
    "ばくおんぱ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 140,
        "type": "ノーマル",
        "is_sound": True
    },
    "ばくれつパンチ": {
        "accuracy": 50,
        "category": "物理",
        "power": 100,
        "type": "かくとう",
        "is_punch": True
    },
    "ばちばちアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "でんき"
    },
    "ひけん・ちえなみ": {
        "accuracy": 90,
        "category": "物理",
        "power": 65,
        "type": "あく",
        "is_slice": True
    },
    "ひっかく": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "ひっさつのピカチュート": {
        "accuracy": 100,
        "category": "物理",
        "power": 210,
        "type": "でんき"
    },
    "ひっさつまえば": {
        "accuracy": 90,
        "category": "物理",
        "power": 80,
        "type": "ノーマル"
    },
    "ひのこ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "ほのお"
    },
    "ひみつのちから": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "ひゃっきやこう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ゴースト"
    },
    "ひやみず": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "みず"
    },
    "ひょうざんおろし": {
        "accuracy": 85,
        "category": "物理",
        "power": 100,
        "type": "こおり"
    },
    "びりびりちくちく": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "でんき"
    },
    "びりびりエレキ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "でんき"
    },
    "ふいうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "あく"
    },
    "ふぶき": {
        "accuracy": 70,
        "category": "特殊",
        "power": 110,
        "type": "こおり"
    },
    "ふみつけ": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "ノーマル"
    },
    "ふわふわフォール": {
        "accuracy": 95,
        "category": "物理",
        "power": 90,
        "type": "ひこう"
    },
    "ふんえん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ほのお"
    },
    "ふんか": {
        "accuracy": 100,
        "category": "特殊",
        "power": 150,
        "type": "ほのお"
    },
    "ふんどのこぶし": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ゴースト"
    },
    "ぶきみなじゅもん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "ぶちかまし": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "じめん"
    },
    "ぶんまわす": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "あく"
    },
    "ほうでん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "でんき"
    },
    "ほうふく": {
        "accuracy": 100,
        "category": "物理",
        "power": 1,
        "type": "あく"
    },
    "ほしがる": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ノーマル"
    },
    "ほっぺすりすり": {
        "accuracy": 100,
        "category": "物理",
        "power": 20,
        "type": "でんき"
    },
    "ほのおのうず": {
        "accuracy": 85,
        "category": "特殊",
        "power": 35,
        "type": "ほのお"
    },
    "ほのおのちかい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ほのお"
    },
    "ほのおのまい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ほのお"
    },
    "ほのおのキバ": {
        "accuracy": 95,
        "category": "物理",
        "power": 65,
        "type": "ほのお",
        "is_bite": True
    },
    "ほのおのパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "ほのお",
        "is_punch": True,
        "is_contact": True
    },
    "ほのおのムチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ほのお"
    },
    "ほんきをだす　こうげき": {
        "accuracy": 100,
        "category": "物理",
        "power": 210,
        "type": "ノーマル"
    },
    "ぼうふう": {
        "accuracy": 70,
        "category": "特殊",
        "power": 110,
        "type": "ひこう"
    },
    "ぽかぼかフレンドタイム": {
        "accuracy": 100,
        "category": "物理",
        "power": 190,
        "type": "フェアリー"
    },
    "まきつく": {
        "accuracy": 90,
        "category": "物理",
        "power": 15,
        "type": "ノーマル"
    },
    "まとわりつく": {
        "accuracy": 100,
        "category": "特殊",
        "power": 20,
        "type": "むし"
    },
    "まわしげり": {
        "accuracy": 85,
        "category": "物理",
        "power": 60,
        "type": "かくとう"
    },
    "みずあめボム": {
        "accuracy": 85,
        "category": "特殊",
        "power": 60,
        "type": "くさ"
    },
    "みずしゅりけん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 15,
        "type": "みず"
    },
    "みずでっぽう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "みず"
    },
    "みずのちかい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "みず"
    },
    "みずのはどう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "みず"
    },
    "みだれづき": {
        "accuracy": 85,
        "category": "物理",
        "power": 15,
        "type": "ノーマル"
    },
    "みだれひっかき": {
        "accuracy": 80,
        "category": "物理",
        "power": 18,
        "type": "ノーマル"
    },
    "みねうち": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "みらいよち": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "エスパー"
    },
    "みわくのボイス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "フェアリー",
        "is_sound": True
    },
    "むしくい": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "むし"
    },
    "むしのさざめき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "むし",
        "is_sound": True
    },
    "むしのていこう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "むし"
    },
    "むねんのつるぎ": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "ほのお",
        "is_slice": True,
        "is_contact": True
    },
    "めざましビンタ": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "かくとう"
    },
    "めざめるダンス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "ノーマル"
    },
    "めざめるパワー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ノーマル"
    },
    "めらめらバーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ほのお"
    },
    "もえあがるいかり": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "あく"
    },
    "もえつきる": {
        "accuracy": 100,
        "category": "特殊",
        "power": 130,
        "type": "ほのお"
    },
    "もろはのずつき": {
        "accuracy": 80,
        "category": "物理",
        "power": 150,
        "type": "いわ"
    },
    "やきつくす": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ほのお"
    },
    "やけっぱち": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "ほのお"
    },
    "やまあらし": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "かくとう"
    },
    "ゆきなだれ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "こおり"
    },
    "ゆめくい": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "エスパー"
    },
    "ようかいえき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "どく"
    },
    "ようせいのかぜ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "フェアリー"
    },
    "らいげき": {
        "accuracy": 85,
        "category": "物理",
        "power": 130,
        "type": "でんき"
    },
    "らいめいげり": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "かくとう"
    },
    "りゅうせいぐん": {
        "accuracy": 90,
        "category": "特殊",
        "power": 130,
        "type": "ドラゴン"
    },
    "りゅうのいぶき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ドラゴン"
    },
    "りゅうのはどう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 85,
        "type": "ドラゴン"
    },
    "りんごさん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "くさ"
    },
    "りんしょう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ノーマル"
    },
    "れいとうパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "こおり",
        "is_punch": True,
        "is_contact": True
    },
    "れいとうビーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "こおり"
    },
    "れんごく": {
        "accuracy": 50,
        "category": "特殊",
        "power": 100,
        "type": "ほのお"
    },
    "れんぞくぎり": {
        "accuracy": 95,
        "category": "物理",
        "power": 40,
        "type": "むし"
    },
    "れんぞくパンチ": {
        "accuracy": 85,
        "category": "物理",
        "power": 18,
        "type": "ノーマル"
    },
    "わだつみのシンフォニア": {
        "accuracy": 100,
        "category": "特殊",
        "power": 195,
        "type": "みず"
    },
    "わるあがき": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ノーマル"
    },
    "わるわるゾーン": {
        "accuracy": 95,
        "category": "特殊",
        "power": 80,
        "type": "あく"
    },
    "アイアンテール": {
        "accuracy": 75,
        "category": "物理",
        "power": 100,
        "type": "はがね"
    },
    "アイアンヘッド": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "はがね",
        "is_contact": True
    },
    "アイアンローラー": {
        "accuracy": 100,
        "category": "物理",
        "power": 130,
        "type": "はがね"
    },
    "アイススピナー": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "こおり"
    },
    "アイスハンマー": {
        "accuracy": 90,
        "category": "物理",
        "power": 100,
        "type": "こおり",
        "is_punch": True
    },
    "アイスボール": {
        "accuracy": 90,
        "category": "物理",
        "power": 30,
        "type": "こおり"
    },
    "アクアカッター": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "みず",
        "is_slice": True,
        "is_contact": True
    },
    "アクアジェット": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "みず"
    },
    "アクアステップ": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "みず"
    },
    "アクアテール": {
        "accuracy": 90,
        "category": "物理",
        "power": 90,
        "type": "みず"
    },
    "アクアブレイク": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "みず",
        "is_contact": True
    },
    "アクセルブレイク": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "かくとう"
    },
    "アクセルロック": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "いわ"
    },
    "アクロバット": {
        "accuracy": 100,
        "category": "物理",
        "power": 55,
        "type": "ひこう"
    },
    "アシストパワー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 20,
        "type": "エスパー"
    },
    "アシッドボム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "どく"
    },
    "アストラルビット": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "ゴースト"
    },
    "アフロブレイク": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ノーマル"
    },
    "アンカーショット": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "はがね"
    },
    "アーマーキャノン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "ほのお"
    },
    "アームハンマー": {
        "accuracy": 90,
        "category": "物理",
        "power": 100,
        "type": "かくとう",
        "is_punch": True,
        "is_contact": True
    },
    "イカサマ": {
        "accuracy": 100,
        "category": "物理",
        "power": 95,
        "type": "あく"
    },
    "イナズマドライブ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "でんき"
    },
    "インファイト": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "かくとう",
        "is_punch": True,
        "is_contact": True
    },
    "ウェザーボール": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "ノーマル"
    },
    "ウェーブタックル": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "みず"
    },
    "ウッドハンマー": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "くさ"
    },
    "ウッドホーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "くさ"
    },
    "エアカッター": {
        "accuracy": 95,
        "category": "特殊",
        "power": 60,
        "type": "ひこう"
    },
    "エアスラッシュ": {
        "accuracy": 95,
        "category": "特殊",
        "power": 75,
        "type": "ひこう"
    },
    "エアロブラスト": {
        "accuracy": 95,
        "category": "特殊",
        "power": 100,
        "type": "ひこう"
    },
    "エコーボイス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "ノーマル"
    },
    "エナジーボール": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "くさ"
    },
    "エラがみ": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "みず",
        "is_bite": True,
        "is_contact": True
    },
    "エレキネット": {
        "accuracy": 95,
        "category": "特殊",
        "power": 55,
        "type": "でんき"
    },
    "エレクトロビーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 130,
        "type": "でんき"
    },
    "オクタンほう": {
        "accuracy": 85,
        "category": "特殊",
        "power": 65,
        "type": "みず"
    },
    "オリジンズスーパーノヴァ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 185,
        "type": "エスパー"
    },
    "オーバードライブ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "でんき",
        "is_sound": True
    },
    "オーバーヒート": {
        "accuracy": 90,
        "category": "特殊",
        "power": 130,
        "type": "ほのお"
    },
    "オーラぐるま": {
        "accuracy": 100,
        "category": "物理",
        "power": 110,
        "type": "でんき"
    },
    "オーラウイング": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "オーロラビーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "こおり"
    },
    "カタストロフィ": {
        "accuracy": 90,
        "category": "特殊",
        "power": 1,
        "type": "あく"
    },
    "ガリョウテンセイ": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ひこう"
    },
    "キラースピン": {
        "accuracy": 100,
        "category": "物理",
        "power": 30,
        "type": "どく"
    },
    "ギアソーサー": {
        "accuracy": 85,
        "category": "物理",
        "power": 50,
        "type": "はがね"
    },
    "ギガインパクト": {
        "accuracy": 90,
        "category": "物理",
        "power": 150,
        "type": "ノーマル"
    },
    "ギガドレイン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "くさ"
    },
    "クイックターン": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "みず"
    },
    "クラブハンマー": {
        "accuracy": 90,
        "category": "物理",
        "power": 100,
        "type": "みず"
    },
    "クリアスモッグ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "どく"
    },
    "クロスサンダー": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "でんき"
    },
    "クロスチョップ": {
        "accuracy": 80,
        "category": "物理",
        "power": 100,
        "type": "かくとう"
    },
    "クロスフレイム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ほのお"
    },
    "クロスポイズン": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "どく"
    },
    "クロロブラスト": {
        "accuracy": 95,
        "category": "特殊",
        "power": 150,
        "type": "くさ"
    },
    "グラススライダー": {
        "accuracy": 100,
        "category": "物理",
        "power": 55,
        "type": "くさ"
    },
    "グラスミキサー": {
        "accuracy": 90,
        "category": "特殊",
        "power": 65,
        "type": "くさ"
    },
    "グランドフォース": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "じめん"
    },
    "グロウパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "かくとう"
    },
    "ゲップ": {
        "accuracy": 90,
        "category": "特殊",
        "power": 120,
        "type": "どく"
    },
    "コアパニッシャー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ドラゴン"
    },
    "コメットパンチ": {
        "accuracy": 90,
        "category": "物理",
        "power": 90,
        "type": "はがね"
    },
    "コールドフレア": {
        "accuracy": 90,
        "category": "特殊",
        "power": 140,
        "type": "こおり"
    },
    "ゴッドバード": {
        "accuracy": 90,
        "category": "物理",
        "power": 140,
        "type": "ひこう"
    },
    "ゴーストダイブ": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "ゴースト"
    },
    "ゴールドラッシュ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "はがね"
    },
    "サイケこうせん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "エスパー"
    },
    "サイコカッター": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "エスパー",
        "is_slice": True
    },
    "サイコキネシス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "エスパー"
    },
    "サイコショック": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "サイコノイズ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "エスパー"
    },
    "サイコファング": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "エスパー",
        "is_bite": True,
        "is_contact": True
    },
    "サイコブレイク": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "エスパー"
    },
    "サイコブレイド ": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "エスパー"
    },
    "サイコブースト": {
        "accuracy": 90,
        "category": "特殊",
        "power": 140,
        "type": "エスパー"
    },
    "サウザンアロー": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "じめん"
    },
    "サウザンウェーブ": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "じめん"
    },
    "サンシャインスマッシャー": {
        "accuracy": 100,
        "category": "物理",
        "power": 200,
        "type": "はがね"
    },
    "サンダーダイブ": {
        "accuracy": 95,
        "category": "物理",
        "power": 100,
        "type": "でんき"
    },
    "サンダープリズン": {
        "accuracy": 90,
        "category": "特殊",
        "power": 80,
        "type": "でんき"
    },
    "シェルアームズ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "どく"
    },
    "シェルブレード": {
        "accuracy": 95,
        "category": "物理",
        "power": 75,
        "type": "みず"
    },
    "シグナルビーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "むし"
    },
    "シザークロス": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "むし"
    },
    "シャカシャカほう": {
        "accuracy": 90,
        "category": "特殊",
        "power": 80,
        "type": "くさ"
    },
    "シャドーアローズストライク": {
        "accuracy": 100,
        "category": "物理",
        "power": 180,
        "type": "ゴースト"
    },
    "シャドークロー": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ゴースト"
    },
    "シャドースチール": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "ゴースト"
    },
    "シャドーダイブ": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ゴースト"
    },
    "シャドーパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ゴースト"
    },
    "シャドーボール": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ゴースト"
    },
    "シャドーボーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "ゴースト"
    },
    "シャドーレイ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ゴースト"
    },
    "シンクロノイズ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "エスパー"
    },
    "シードフレア": {
        "accuracy": 85,
        "category": "特殊",
        "power": 120,
        "type": "くさ"
    },
    "ジェットパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "みず"
    },
    "スイープビンタ": {
        "accuracy": 85,
        "category": "物理",
        "power": 25,
        "type": "ノーマル"
    },
    "スカイアッパー": {
        "accuracy": 90,
        "category": "物理",
        "power": 85,
        "type": "かくとう"
    },
    "スケイルショット": {
        "accuracy": 90,
        "category": "物理",
        "power": 25,
        "type": "ドラゴン"
    },
    "スケイルノイズ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 110,
        "type": "ドラゴン",
        "is_sound": True
    },
    "スターアサルト": {
        "accuracy": 100,
        "category": "物理",
        "power": 150,
        "type": "かくとう"
    },
    "スチームバースト": {
        "accuracy": 95,
        "category": "特殊",
        "power": 110,
        "type": "みず"
    },
    "ストーンエッジ": {
        "accuracy": 80,
        "category": "物理",
        "power": 100,
        "type": "いわ"
    },
    "スパーク": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "でんき"
    },
    "スピードスター": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "ノーマル"
    },
    "スマートホーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "はがね"
    },
    "スモッグ": {
        "accuracy": 70,
        "category": "特殊",
        "power": 30,
        "type": "どく"
    },
    "ソウルクラッシュ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "フェアリー"
    },
    "ソーラービーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "くさ"
    },
    "ソーラーブレード": {
        "accuracy": 100,
        "category": "物理",
        "power": 125,
        "type": "くさ"
    },
    "タキオンカッター": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "はがね"
    },
    "タネばくだん": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "くさ"
    },
    "タネマシンガン": {
        "accuracy": 100,
        "category": "物理",
        "power": 25,
        "type": "くさ"
    },
    "タマゴばくだん": {
        "accuracy": 75,
        "category": "物理",
        "power": 100,
        "type": "ノーマル"
    },
    "ダイアイス": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "こおり"
    },
    "ダイアシッド": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "どく"
    },
    "ダイアタック": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "ノーマル"
    },
    "ダイアーク": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "あく"
    },
    "ダイアース": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "じめん"
    },
    "ダイサイコ": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "エスパー"
    },
    "ダイサンダー": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "でんき"
    },
    "ダイジェット": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "ひこう"
    },
    "ダイスチル": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "はがね"
    },
    "ダイストリーム": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "みず"
    },
    "ダイソウゲン": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "くさ"
    },
    "ダイドラグーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "ドラゴン"
    },
    "ダイナックル": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "かくとう"
    },
    "ダイバーン": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "ほのお"
    },
    "ダイビング": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "みず"
    },
    "ダイフェアリー": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "フェアリー"
    },
    "ダイホロウ": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "ゴースト"
    },
    "ダイマックスほう": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "ドラゴン"
    },
    "ダイヤストーム": {
        "accuracy": 95,
        "category": "物理",
        "power": 100,
        "type": "いわ"
    },
    "ダイロック": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "いわ"
    },
    "ダイワーム": {
        "accuracy": 100,
        "category": "物理",
        "power": 10,
        "type": "むし"
    },
    "ダストシュート": {
        "accuracy": 80,
        "category": "物理",
        "power": 120,
        "type": "どく"
    },
    "ダブルアタック": {
        "accuracy": 90,
        "category": "物理",
        "power": 35,
        "type": "ノーマル"
    },
    "ダブルウイング": {
        "accuracy": 90,
        "category": "物理",
        "power": 40,
        "type": "ひこう"
    },
    "ダブルチョップ": {
        "accuracy": 90,
        "category": "物理",
        "power": 40,
        "type": "ドラゴン"
    },
    "ダブルニードル": {
        "accuracy": 100,
        "category": "物理",
        "power": 25,
        "type": "むし"
    },
    "ダブルパンツァー": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "はがね"
    },
    "ダメおし": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "あく"
    },
    "ダークアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "あく"
    },
    "チャージビーム": {
        "accuracy": 90,
        "category": "特殊",
        "power": 50,
        "type": "でんき"
    },
    "チャームボイス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "フェアリー"
    },
    "ツインビーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "エスパー"
    },
    "ツタこんぼう": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "くさ"
    },
    "テクノバスター": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "ノーマル"
    },
    "テラクラスター": {
        "accuracy": 100,
        "category": "特殊",
        "power": 120,
        "type": "ノーマル"
    },
    "テラバースト": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ノーマル"
    },
    "デカハンマー": {
        "accuracy": 100,
        "category": "物理",
        "power": 160,
        "type": "はがね"
    },
    "デスウイング": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ひこう"
    },
    "トライアタック": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ノーマル"
    },
    "トラップシェル": {
        "accuracy": 100,
        "category": "特殊",
        "power": 150,
        "type": "ほのお"
    },
    "トラバサミ": {
        "accuracy": 100,
        "category": "物理",
        "power": 35,
        "type": "くさ"
    },
    "トリックフラワー": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "くさ",
        "is_slice": True
    },
    "トリプルアクセル": {
        "accuracy": 90,
        "category": "物理",
        "power": 20,
        "type": "こおり"
    },
    "トリプルキック": {
        "accuracy": 90,
        "category": "物理",
        "power": 10,
        "type": "かくとう"
    },
    "トリプルダイブ": {
        "accuracy": 95,
        "category": "物理",
        "power": 30,
        "type": "みず"
    },
    "トロピカルキック": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "くさ"
    },
    "ドゲザン": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "あく",
        "is_slice": True,
        "is_contact": True
    },
    "ドラゴンアロー": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ドラゴン"
    },
    "ドラゴンエナジー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 150,
        "type": "ドラゴン"
    },
    "ドラゴンクロー": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ドラゴン"
    },
    "ドラゴンダイブ": {
        "accuracy": 75,
        "category": "物理",
        "power": 100,
        "type": "ドラゴン",
        "is_contact": True
    },
    "ドラゴンテール": {
        "accuracy": 90,
        "category": "物理",
        "power": 60,
        "type": "ドラゴン"
    },
    "ドラゴンハンマー": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "ドラゴン"
    },
    "ドラムアタック": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "くさ"
    },
    "ドリルくちばし": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ひこう"
    },
    "ドリルライナー": {
        "accuracy": 95,
        "category": "物理",
        "power": 80,
        "type": "じめん"
    },
    "ドレインキッス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 50,
        "type": "フェアリー"
    },
    "ドレインパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 75,
        "type": "かくとう",
        "is_punch": True,
        "is_contact": True
    },
    "ナイトバースト": {
        "accuracy": 95,
        "category": "特殊",
        "power": 85,
        "type": "あく"
    },
    "ニトロチャージ": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "ほのお"
    },
    "ニードルアーム": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "くさ"
    },
    "ネコにこばん": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "ノーマル"
    },
    "ネズミざん": {
        "accuracy": 90,
        "category": "物理",
        "power": 20,
        "type": "ノーマル"
    },
    "ハイドロカノン": {
        "accuracy": 90,
        "category": "特殊",
        "power": 150,
        "type": "みず"
    },
    "ハイドロスチーム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "みず"
    },
    "ハイドロポンプ": {
        "accuracy": 80,
        "category": "特殊",
        "power": 110,
        "type": "みず"
    },
    "ハイパーダーククラッシャー": {
        "accuracy": 100,
        "category": "物理",
        "power": 180,
        "type": "あく"
    },
    "ハイパードリル": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "ノーマル"
    },
    "ハイパーボイス": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "ノーマル",
        "is_sound": True
    },
    "ハートスタンプ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "エスパー"
    },
    "ハードプラント": {
        "accuracy": 90,
        "category": "特殊",
        "power": 150,
        "type": "くさ"
    },
    "ハードローラー": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "むし"
    },
    "バブルこうせん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "みず"
    },
    "バリアーラッシュ": {
        "accuracy": 90,
        "category": "物理",
        "power": 70,
        "type": "エスパー"
    },
    "バレットパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "はがね",
        "is_punch": True,
        "is_contact": True
    },
    "バークアウト": {
        "accuracy": 95,
        "category": "特殊",
        "power": 55,
        "type": "あく"
    },
    "バーンアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "ほのお"
    },
    "パラボラチャージ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "でんき"
    },
    "パワフルエッジ": {
        "accuracy": 100,
        "category": "物理",
        "power": 95,
        "type": "いわ"
    },
    "パワーウィップ": {
        "accuracy": 85,
        "category": "物理",
        "power": 120,
        "type": "くさ"
    },
    "パワージェム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "いわ"
    },
    "ビックリヘッド": {
        "accuracy": 100,
        "category": "特殊",
        "power": 150,
        "type": "ほのお"
    },
    "ピヨピヨパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 70,
        "type": "ノーマル"
    },
    "ファイトアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "かくとう"
    },
    "フェイタルクロー": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "どく"
    },
    "フェイント": {
        "accuracy": 100,
        "category": "物理",
        "power": 30,
        "type": "ノーマル"
    },
    "フォトンゲイザー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "エスパー"
    },
    "フライングプレス": {
        "accuracy": 95,
        "category": "物理",
        "power": 100,
        "type": "かくとう"
    },
    "フリーズドライ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "こおり"
    },
    "フリーズボルト": {
        "accuracy": 90,
        "category": "物理",
        "power": 140,
        "type": "こおり"
    },
    "フリーフォール": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ひこう"
    },
    "フルールカノン": {
        "accuracy": 90,
        "category": "特殊",
        "power": 130,
        "type": "フェアリー"
    },
    "フレアソング": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "ほのお",
        "is_sound": True
    },
    "フレアドライブ": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ほのお",
        "is_contact": True
    },
    "ブラストバーン": {
        "accuracy": 90,
        "category": "特殊",
        "power": 150,
        "type": "ほのお"
    },
    "ブラッドムーン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 140,
        "type": "ノーマル"
    },
    "ブリザードランス": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "こおり"
    },
    "ブレイククロー": {
        "accuracy": 95,
        "category": "物理",
        "power": 75,
        "type": "ノーマル"
    },
    "ブレイジングソウルビート": {
        "accuracy": 100,
        "category": "特殊",
        "power": 185,
        "type": "ドラゴン"
    },
    "ブレイズキック": {
        "accuracy": 90,
        "category": "物理",
        "power": 85,
        "type": "ほのお"
    },
    "ブレイブバード": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ひこう"
    },
    "プラズマフィスト": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "でんき"
    },
    "プリズムレーザー": {
        "accuracy": 100,
        "category": "特殊",
        "power": 160,
        "type": "エスパー"
    },
    "ヘドロこうげき": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "どく"
    },
    "ヘドロばくだん": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "どく"
    },
    "ヘドロウェーブ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 95,
        "type": "どく"
    },
    "ベノムショック": {
        "accuracy": 100,
        "category": "特殊",
        "power": 65,
        "type": "どく"
    },
    "ホイールスピン": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "はがね"
    },
    "ホネこんぼう": {
        "accuracy": 85,
        "category": "物理",
        "power": 65,
        "type": "じめん"
    },
    "ホネブーメラン": {
        "accuracy": 90,
        "category": "物理",
        "power": 50,
        "type": "じめん"
    },
    "ボディプレス": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "かくとう"
    },
    "ボルテッカー": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "でんき"
    },
    "ボルトチェンジ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "でんき"
    },
    "ボーンラッシュ": {
        "accuracy": 90,
        "category": "物理",
        "power": 25,
        "type": "じめん"
    },
    "ポイズンアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "どく"
    },
    "ポイズンテール": {
        "accuracy": 100,
        "category": "物理",
        "power": 50,
        "type": "どく"
    },
    "ポルターガイスト": {
        "accuracy": 90,
        "category": "物理",
        "power": 110,
        "type": "ゴースト"
    },
    "マグネットボム": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "はがね"
    },
    "マグマストーム": {
        "accuracy": 75,
        "category": "特殊",
        "power": 100,
        "type": "ほのお"
    },
    "マジカルアクセル": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "フェアリー"
    },
    "マジカルシャイン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "フェアリー"
    },
    "マジカルフレイム": {
        "accuracy": 100,
        "category": "特殊",
        "power": 75,
        "type": "ほのお"
    },
    "マジカルリーフ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 60,
        "type": "くさ"
    },
    "マッドショット": {
        "accuracy": 95,
        "category": "特殊",
        "power": 55,
        "type": "じめん"
    },
    "マッハパンチ": {
        "accuracy": 100,
        "category": "物理",
        "power": 40,
        "type": "かくとう",
        "is_punch": True,
        "is_contact": True
    },
    "マルチアタック": {
        "accuracy": 100,
        "category": "物理",
        "power": 120,
        "type": "ノーマル"
    },
    "ミサイルばり": {
        "accuracy": 95,
        "category": "物理",
        "power": 25,
        "type": "むし"
    },
    "ミストバースト": {
        "accuracy": 100,
        "category": "特殊",
        "power": 100,
        "type": "フェアリー"
    },
    "ミストボール": {
        "accuracy": 100,
        "category": "特殊",
        "power": 95,
        "type": "エスパー"
    },
    "ミラーショット": {
        "accuracy": 85,
        "category": "特殊",
        "power": 65,
        "type": "はがね"
    },
    "ムゲンダイビーム": {
        "accuracy": 90,
        "category": "特殊",
        "power": 160,
        "type": "ドラゴン"
    },
    "ムーンフォース": {
        "accuracy": 100,
        "category": "特殊",
        "power": 95,
        "type": "フェアリー"
    },
    "ムーンライトブラスター": {
        "accuracy": 100,
        "category": "特殊",
        "power": 200,
        "type": "ゴースト"
    },
    "メガトンキック": {
        "accuracy": 75,
        "category": "物理",
        "power": 120,
        "type": "ノーマル"
    },
    "メガトンパンチ": {
        "accuracy": 85,
        "category": "物理",
        "power": 80,
        "type": "ノーマル"
    },
    "メガドレイン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 40,
        "type": "くさ"
    },
    "メガホーン": {
        "accuracy": 85,
        "category": "物理",
        "power": 120,
        "type": "むし"
    },
    "メタルクロー": {
        "accuracy": 95,
        "category": "物理",
        "power": 50,
        "type": "はがね"
    },
    "メテオドライブ": {
        "accuracy": 100,
        "category": "物理",
        "power": 100,
        "type": "はがね"
    },
    "メテオビーム": {
        "accuracy": 90,
        "category": "特殊",
        "power": 120,
        "type": "いわ"
    },
    "ライジングボルト": {
        "accuracy": 100,
        "category": "特殊",
        "power": 70,
        "type": "でんき"
    },
    "ライトニングサーフライド": {
        "accuracy": 100,
        "category": "特殊",
        "power": 175,
        "type": "でんき"
    },
    "ラジアルエッジストーム": {
        "accuracy": 100,
        "category": "物理",
        "power": 190,
        "type": "いわ"
    },
    "ラスターカノン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "はがね"
    },
    "ラスターパージ": {
        "accuracy": 100,
        "category": "特殊",
        "power": 95,
        "type": "エスパー"
    },
    "リベンジ": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "かくとう"
    },
    "リーフストーム": {
        "accuracy": 90,
        "category": "特殊",
        "power": 130,
        "type": "くさ"
    },
    "リーフブレード": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "くさ",
        "is_slice": True,
        "is_contact": True
    },
    "ルミナコリジョン": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "レイジングブル": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "ノーマル"
    },
    "ロケットずつき": {
        "accuracy": 100,
        "category": "物理",
        "power": 130,
        "type": "ノーマル"
    },
    "ロッククライム": {
        "accuracy": 85,
        "category": "物理",
        "power": 90,
        "type": "ノーマル"
    },
    "ロックブラスト": {
        "accuracy": 90,
        "category": "物理",
        "power": 25,
        "type": "いわ"
    },
    "ローキック": {
        "accuracy": 100,
        "category": "物理",
        "power": 65,
        "type": "かくとう"
    },
    "ワイドフォース": {
        "accuracy": 100,
        "category": "特殊",
        "power": 80,
        "type": "エスパー"
    },
    "ワイドブレイカー": {
        "accuracy": 100,
        "category": "物理",
        "power": 60,
        "type": "ドラゴン"
    },
    "ワイルドボルト": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "でんき"
    },
    "ワンダースチーム": {
        "accuracy": 95,
        "category": "特殊",
        "power": 90,
        "type": "フェアリー"
    },
    "１０まんばりき": {
        "accuracy": 95,
        "category": "物理",
        "power": 95,
        "type": "じめん"
    },
    "１０まんボルト": {
        "accuracy": 100,
        "category": "特殊",
        "power": 90,
        "type": "でんき"
    },
    "１０００まんボルト": {
        "accuracy": 100,
        "category": "特殊",
        "power": 195,
        "type": "でんき"
    },
    "３ぼんのや": {
        "accuracy": 100,
        "category": "物理",
        "power": 90,
        "type": "かくとう"
    },
    "ＤＤラリアット": {
        "accuracy": 100,
        "category": "物理",
        "power": 85,
        "type": "あく"
    },
    "Ｇのちから": {
        "accuracy": 100,
        "category": "物理",
        "power": 80,
        "type": "くさ"
    },
    "Ｖジェネレート": {
        "accuracy": 95,
        "category": "物理",
        "power": 180,
        "type": "ほのお"
    }
}

items = {
    "なし": {},
    "こだわりハチマキ": {
        "type": "stat_multi",
        "stat": "a",
        "val": 1.5
    },
    "こだわりメガネ": {
        "type": "stat_multi",
        "stat": "c",
        "val": 1.5
    },
    "とつげきチョッキ": {
        "type": "stat_multi",
        "stat": "d",
        "val": 1.5
    },
    "しんかのきせき": {
        "type": "stat_multi",
        "stat": [
            "b",
            "d"
        ],
        "val": 1.5
    },
    "いのちのたま": {
        "type": "dmg_multi",
        "val": 1.3
    },
    "たつじんのおび": {
        "type": "dmg_multi_se",
        "val": 1.2
    },
    "ちからのハチマキ": {
        "type": "dmg_multi_phys",
        "val": 1.1
    },
    "ものしりメガネ": {
        "type": "dmg_multi_spec",
        "val": 1.1
    },
    "パンチグローブ": {
        "type": "dmg_multi_punch",
        "val": 1.1
    },
    "ノーマルジュエル": {
        "type": "dmg_multi_type",
        "target_type": "ノーマル",
        "val": 1.3,
        "once": True
    },
    "タイプ強化アイテム": {
        "type": "dmg_multi_same_type",
        "val": 1.2
    },
    "半減のみ（弱点）": {
        "type": "def_dmg_multi_se",
        "val": 0.5
    }
}

abilities = [
    "なし",
    "ちからもち / ヨガパワー",
    "ファーコート",
    "こおりのりんぷん",
    "スナイパー",
    "おやこあい",
    "てきおうりょく",
    "かたいツメ",
    "パンクロック",
    "てつのこぶし",
    "きれあじ",
    "がんじょうあご",
    "トランジスタ",
    "りゅうのあぎと",
    "はがねのせいしん",
    "すいほう",
    "マルチスケイル / ファントムガード",
    "もふもふ",
    "フィルター / ハードロック / プリズムアーマー",
    "サンパワー",
    "すなのちから",
    "わざわいのつるぎ",
    "わざわいのたま",
    "わざわいのおふだ",
    "わざわいのうつわ",
    "こだいかっせい / クォークチャージ",
    "スカイスキン",
    "フェアリースキン",
    "フリーズスキン",
    "エレキスキン"
]

natures = {
    "いじっぱり (A↑ C↓)": {
        "up": "a",
        "down": "c"
    },
    "ひかえめ (C↑ A↓)": {
        "up": "c",
        "down": "a"
    },
    "ようき (S↑ C↓)": {
        "up": "s",
        "down": "c"
    },
    "おくびょう (S↑ A↓)": {
        "up": "s",
        "down": "a"
    },
    "わんぱく (B↑ C↓)": {
        "up": "b",
        "down": "c"
    },
    "しんちょう (D↑ C↓)": {
        "up": "d",
        "down": "c"
    },
    "まじめ (補正なし)": {
        "up": None,
        "down": None
    }
}



type_chart = {   'あく': {   'あく': 0.5,
              'いわ': 1.0,
              'かくとう': 0.5,
              'くさ': 1.0,
              'こおり': 1.0,
              'じめん': 1.0,
              'でんき': 1.0,
              'どく': 1.0,
              'はがね': 1.0,
              'ひこう': 1.0,
              'ほのお': 1.0,
              'みず': 1.0,
              'むし': 1.0,
              'エスパー': 2.0,
              'ゴースト': 2.0,
              'ドラゴン': 1.0,
              'ノーマル': 1.0,
              'フェアリー': 0.5},
    'いわ': {   'あく': 1.0,
              'いわ': 1.0,
              'かくとう': 0.5,
              'くさ': 1.0,
              'こおり': 2.0,
              'じめん': 0.5,
              'でんき': 1.0,
              'どく': 1.0,
              'はがね': 0.5,
              'ひこう': 2.0,
              'ほのお': 2.0,
              'みず': 1.0,
              'むし': 2.0,
              'エスパー': 1.0,
              'ゴースト': 1.0,
              'ドラゴン': 1.0,
              'ノーマル': 1.0,
              'フェアリー': 1.0},
    'かくとう': {   'あく': 2.0,
                'いわ': 2.0,
                'かくとう': 1.0,
                'くさ': 1.0,
                'こおり': 2.0,
                'じめん': 1.0,
                'でんき': 1.0,
                'どく': 0.5,
                'はがね': 2.0,
                'ひこう': 0.5,
                'ほのお': 1.0,
                'みず': 1.0,
                'むし': 0.5,
                'エスパー': 0.5,
                'ゴースト': 0.0,
                'ドラゴン': 1.0,
                'ノーマル': 2.0,
                'フェアリー': 0.5},
    'くさ': {   'あく': 1.0,
              'いわ': 2.0,
              'かくとう': 1.0,
              'くさ': 0.5,
              'こおり': 1.0,
              'じめん': 2.0,
              'でんき': 1.0,
              'どく': 0.5,
              'はがね': 0.5,
              'ひこう': 0.5,
              'ほのお': 0.5,
              'みず': 2.0,
              'むし': 0.5,
              'エスパー': 1.0,
              'ゴースト': 1.0,
              'ドラゴン': 0.5,
              'ノーマル': 1.0,
              'フェアリー': 1.0},
    'こおり': {   'あく': 1.0,
               'いわ': 1.0,
               'かくとう': 1.0,
               'くさ': 2.0,
               'こおり': 0.5,
               'じめん': 2.0,
               'でんき': 1.0,
               'どく': 1.0,
               'はがね': 0.5,
               'ひこう': 2.0,
               'ほのお': 0.5,
               'みず': 0.5,
               'むし': 1.0,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 2.0,
               'ノーマル': 1.0,
               'フェアリー': 1.0},
    'じめん': {   'あく': 1.0,
               'いわ': 2.0,
               'かくとう': 1.0,
               'くさ': 0.5,
               'こおり': 1.0,
               'じめん': 1.0,
               'でんき': 2.0,
               'どく': 2.0,
               'はがね': 2.0,
               'ひこう': 0.0,
               'ほのお': 2.0,
               'みず': 1.0,
               'むし': 0.5,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 1.0,
               'ノーマル': 1.0,
               'フェアリー': 1.0},
    'でんき': {   'あく': 1.0,
               'いわ': 1.0,
               'かくとう': 1.0,
               'くさ': 0.5,
               'こおり': 1.0,
               'じめん': 0.0,
               'でんき': 0.5,
               'どく': 1.0,
               'はがね': 1.0,
               'ひこう': 2.0,
               'ほのお': 1.0,
               'みず': 2.0,
               'むし': 1.0,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 0.5,
               'ノーマル': 1.0,
               'フェアリー': 1.0},
    'どく': {   'あく': 1.0,
              'いわ': 0.5,
              'かくとう': 1.0,
              'くさ': 2.0,
              'こおり': 1.0,
              'じめん': 0.5,
              'でんき': 1.0,
              'どく': 0.5,
              'はがね': 0.0,
              'ひこう': 1.0,
              'ほのお': 1.0,
              'みず': 1.0,
              'むし': 1.0,
              'エスパー': 1.0,
              'ゴースト': 0.5,
              'ドラゴン': 1.0,
              'ノーマル': 1.0,
              'フェアリー': 2.0},
    'はがね': {   'あく': 1.0,
               'いわ': 2.0,
               'かくとう': 1.0,
               'くさ': 1.0,
               'こおり': 2.0,
               'じめん': 1.0,
               'でんき': 0.5,
               'どく': 1.0,
               'はがね': 0.5,
               'ひこう': 1.0,
               'ほのお': 0.5,
               'みず': 0.5,
               'むし': 1.0,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 1.0,
               'ノーマル': 1.0,
               'フェアリー': 2.0},
    'ひこう': {   'あく': 1.0,
               'いわ': 0.5,
               'かくとう': 2.0,
               'くさ': 2.0,
               'こおり': 1.0,
               'じめん': 1.0,
               'でんき': 0.5,
               'どく': 1.0,
               'はがね': 0.5,
               'ひこう': 1.0,
               'ほのお': 1.0,
               'みず': 1.0,
               'むし': 2.0,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 1.0,
               'ノーマル': 1.0,
               'フェアリー': 1.0},
    'ほのお': {   'あく': 1.0,
               'いわ': 0.5,
               'かくとう': 1.0,
               'くさ': 2.0,
               'こおり': 2.0,
               'じめん': 1.0,
               'でんき': 1.0,
               'どく': 1.0,
               'はがね': 2.0,
               'ひこう': 1.0,
               'ほのお': 0.5,
               'みず': 0.5,
               'むし': 2.0,
               'エスパー': 1.0,
               'ゴースト': 1.0,
               'ドラゴン': 0.5,
               'ノーマル': 1.0,
               'フェアリー': 1.0},
    'みず': {   'あく': 1.0,
              'いわ': 2.0,
              'かくとう': 1.0,
              'くさ': 0.5,
              'こおり': 1.0,
              'じめん': 2.0,
              'でんき': 1.0,
              'どく': 1.0,
              'はがね': 1.0,
              'ひこう': 1.0,
              'ほのお': 2.0,
              'みず': 0.5,
              'むし': 1.0,
              'エスパー': 1.0,
              'ゴースト': 1.0,
              'ドラゴン': 0.5,
              'ノーマル': 1.0,
              'フェアリー': 1.0},
    'むし': {   'あく': 2.0,
              'いわ': 1.0,
              'かくとう': 0.5,
              'くさ': 2.0,
              'こおり': 1.0,
              'じめん': 1.0,
              'でんき': 1.0,
              'どく': 0.5,
              'はがね': 0.5,
              'ひこう': 0.5,
              'ほのお': 0.5,
              'みず': 1.0,
              'むし': 1.0,
              'エスパー': 2.0,
              'ゴースト': 0.5,
              'ドラゴン': 1.0,
              'ノーマル': 1.0,
              'フェアリー': 0.5},
    'エスパー': {   'あく': 0.0,
                'いわ': 1.0,
                'かくとう': 2.0,
                'くさ': 1.0,
                'こおり': 1.0,
                'じめん': 1.0,
                'でんき': 1.0,
                'どく': 2.0,
                'はがね': 0.5,
                'ひこう': 1.0,
                'ほのお': 1.0,
                'みず': 1.0,
                'むし': 1.0,
                'エスパー': 0.5,
                'ゴースト': 1.0,
                'ドラゴン': 1.0,
                'ノーマル': 1.0,
                'フェアリー': 1.0},
    'ゴースト': {   'あく': 0.5,
                'いわ': 1.0,
                'かくとう': 1.0,
                'くさ': 1.0,
                'こおり': 1.0,
                'じめん': 1.0,
                'でんき': 1.0,
                'どく': 1.0,
                'はがね': 1.0,
                'ひこう': 1.0,
                'ほのお': 1.0,
                'みず': 1.0,
                'むし': 1.0,
                'エスパー': 2.0,
                'ゴースト': 2.0,
                'ドラゴン': 1.0,
                'ノーマル': 0.0,
                'フェアリー': 1.0},
    'ドラゴン': {   'あく': 1.0,
                'いわ': 1.0,
                'かくとう': 1.0,
                'くさ': 1.0,
                'こおり': 1.0,
                'じめん': 1.0,
                'でんき': 1.0,
                'どく': 1.0,
                'はがね': 0.5,
                'ひこう': 1.0,
                'ほのお': 1.0,
                'みず': 1.0,
                'むし': 1.0,
                'エスパー': 1.0,
                'ゴースト': 1.0,
                'ドラゴン': 2.0,
                'ノーマル': 1.0,
                'フェアリー': 0.0},
    'ノーマル': {   'あく': 1.0,
                'いわ': 0.5,
                'かくとう': 1.0,
                'くさ': 1.0,
                'こおり': 1.0,
                'じめん': 1.0,
                'でんき': 1.0,
                'どく': 1.0,
                'はがね': 0.5,
                'ひこう': 1.0,
                'ほのお': 1.0,
                'みず': 1.0,
                'むし': 1.0,
                'エスパー': 1.0,
                'ゴースト': 0.0,
                'ドラゴン': 1.0,
                'ノーマル': 1.0,
                'フェアリー': 1.0},
    'フェアリー': {   'あく': 2.0,
                 'いわ': 1.0,
                 'かくとう': 2.0,
                 'くさ': 1.0,
                 'こおり': 1.0,
                 'じめん': 1.0,
                 'でんき': 1.0,
                 'どく': 0.5,
                 'はがね': 0.5,
                 'ひこう': 1.0,
                 'ほのお': 0.5,
                 'みず': 1.0,
                 'むし': 1.0,
                 'エスパー': 1.0,
                 'ゴースト': 1.0,
                 'ドラゴン': 2.0,
                 'ノーマル': 1.0,
                 'フェアリー': 1.0}}

def get_type_multiplier(attack_type, defender_types):
    multiplier = 1.0
    for def_type in defender_types:
        if attack_type in type_chart and def_type in type_chart[attack_type]:
            multiplier *= type_chart[attack_type][def_type]
    return multiplier

# Megas appended from dynamic fetch
pokemons["メガフシギバナ"] = {"id": 10033, "types": ['くさ', 'どく'], "base_stats": {"h": 80, "a": 100, "b": 123, "c": 122, "d": 120, "s": 80}}
pokemons["メガリザードンX"] = {"id": 10034, "types": ['ほのお', 'ドラゴン'], "base_stats": {"h": 78, "a": 130, "b": 111, "c": 130, "d": 85, "s": 100}}
pokemons["メガリザードンY"] = {"id": 10035, "types": ['ほのお', 'ひこう'], "base_stats": {"h": 78, "a": 104, "b": 78, "c": 159, "d": 115, "s": 100}}
pokemons["メガカメックス"] = {"id": 10036, "types": ['みず'], "base_stats": {"h": 79, "a": 103, "b": 120, "c": 135, "d": 115, "s": 78}}
pokemons["メガフーディン"] = {"id": 10037, "types": ['エスパー'], "base_stats": {"h": 55, "a": 50, "b": 65, "c": 175, "d": 105, "s": 150}}
pokemons["メガゲンガー"] = {"id": 10038, "types": ['ゴースト', 'どく'], "base_stats": {"h": 60, "a": 65, "b": 80, "c": 170, "d": 95, "s": 130}}
pokemons["メガガルーラ"] = {"id": 10039, "types": ['ノーマル'], "base_stats": {"h": 105, "a": 125, "b": 100, "c": 60, "d": 100, "s": 100}}
pokemons["メガカイロス"] = {"id": 10040, "types": ['むし', 'ひこう'], "base_stats": {"h": 65, "a": 155, "b": 120, "c": 65, "d": 90, "s": 105}}
pokemons["メガギャラドス"] = {"id": 10041, "types": ['みず', 'あく'], "base_stats": {"h": 95, "a": 155, "b": 109, "c": 70, "d": 130, "s": 81}}
pokemons["メガプテラ"] = {"id": 10042, "types": ['いわ', 'ひこう'], "base_stats": {"h": 80, "a": 135, "b": 85, "c": 70, "d": 95, "s": 150}}
pokemons["メガミュウツーX"] = {"id": 10043, "types": ['エスパー', 'かくとう'], "base_stats": {"h": 106, "a": 190, "b": 100, "c": 154, "d": 100, "s": 130}}
pokemons["メガミュウツーY"] = {"id": 10044, "types": ['エスパー'], "base_stats": {"h": 106, "a": 150, "b": 70, "c": 194, "d": 120, "s": 140}}
pokemons["メガデンリュウ"] = {"id": 10045, "types": ['でんき', 'ドラゴン'], "base_stats": {"h": 90, "a": 95, "b": 105, "c": 165, "d": 110, "s": 45}}
pokemons["メガハッサム"] = {"id": 10046, "types": ['むし', 'はがね'], "base_stats": {"h": 70, "a": 150, "b": 140, "c": 65, "d": 100, "s": 75}}
pokemons["メガヘラクロス"] = {"id": 10047, "types": ['むし', 'かくとう'], "base_stats": {"h": 80, "a": 185, "b": 115, "c": 40, "d": 105, "s": 75}}
pokemons["メガヘルガー"] = {"id": 10048, "types": ['あく', 'ほのお'], "base_stats": {"h": 75, "a": 90, "b": 90, "c": 140, "d": 90, "s": 115}}
pokemons["メガバンギラス"] = {"id": 10049, "types": ['いわ', 'あく'], "base_stats": {"h": 100, "a": 164, "b": 150, "c": 95, "d": 120, "s": 71}}
pokemons["メガバシャーモ"] = {"id": 10050, "types": ['ほのお', 'かくとう'], "base_stats": {"h": 80, "a": 160, "b": 80, "c": 130, "d": 80, "s": 100}}
pokemons["メガサーナイト"] = {"id": 10051, "types": ['エスパー', 'フェアリー'], "base_stats": {"h": 68, "a": 85, "b": 65, "c": 165, "d": 135, "s": 100}}
pokemons["メガクチート"] = {"id": 10052, "types": ['はがね', 'フェアリー'], "base_stats": {"h": 50, "a": 105, "b": 125, "c": 55, "d": 95, "s": 50}}
pokemons["メガボスゴドラ"] = {"id": 10053, "types": ['はがね'], "base_stats": {"h": 70, "a": 140, "b": 230, "c": 60, "d": 80, "s": 50}}
pokemons["メガチャーレム"] = {"id": 10054, "types": ['かくとう', 'エスパー'], "base_stats": {"h": 60, "a": 100, "b": 85, "c": 80, "d": 85, "s": 100}}
pokemons["メガライボルト"] = {"id": 10055, "types": ['でんき'], "base_stats": {"h": 70, "a": 75, "b": 80, "c": 135, "d": 80, "s": 135}}
pokemons["メガジュペッタ"] = {"id": 10056, "types": ['ゴースト'], "base_stats": {"h": 64, "a": 165, "b": 75, "c": 93, "d": 83, "s": 75}}
pokemons["メガアブソル"] = {"id": 10057, "types": ['あく'], "base_stats": {"h": 65, "a": 150, "b": 60, "c": 115, "d": 60, "s": 115}}
pokemons["メガガブリアス"] = {"id": 10058, "types": ['ドラゴン', 'じめん'], "base_stats": {"h": 108, "a": 170, "b": 115, "c": 120, "d": 95, "s": 92}}
pokemons["メガルカリオ"] = {"id": 10059, "types": ['かくとう', 'はがね'], "base_stats": {"h": 70, "a": 145, "b": 88, "c": 140, "d": 70, "s": 112}}
pokemons["メガユキノオー"] = {"id": 10060, "types": ['くさ', 'こおり'], "base_stats": {"h": 90, "a": 132, "b": 105, "c": 132, "d": 105, "s": 30}}
pokemons["メガラティアス"] = {"id": 10062, "types": ['ドラゴン', 'エスパー'], "base_stats": {"h": 80, "a": 100, "b": 120, "c": 140, "d": 150, "s": 110}}
pokemons["メガラティオス"] = {"id": 10063, "types": ['ドラゴン', 'エスパー'], "base_stats": {"h": 80, "a": 130, "b": 100, "c": 160, "d": 120, "s": 110}}
pokemons["メガラグラージ"] = {"id": 10064, "types": ['みず', 'じめん'], "base_stats": {"h": 100, "a": 150, "b": 110, "c": 95, "d": 110, "s": 70}}
pokemons["メガジュカイン"] = {"id": 10065, "types": ['くさ', 'ドラゴン'], "base_stats": {"h": 70, "a": 110, "b": 75, "c": 145, "d": 85, "s": 145}}
pokemons["メガヤミラミ"] = {"id": 10066, "types": ['あく', 'ゴースト'], "base_stats": {"h": 50, "a": 85, "b": 125, "c": 85, "d": 115, "s": 20}}
pokemons["メガチルタリス"] = {"id": 10067, "types": ['ドラゴン', 'フェアリー'], "base_stats": {"h": 75, "a": 110, "b": 110, "c": 110, "d": 105, "s": 80}}
pokemons["メガエルレイド"] = {"id": 10068, "types": ['エスパー', 'かくとう'], "base_stats": {"h": 68, "a": 165, "b": 95, "c": 65, "d": 115, "s": 110}}
pokemons["メガタブンネ"] = {"id": 10069, "types": ['ノーマル', 'フェアリー'], "base_stats": {"h": 103, "a": 60, "b": 126, "c": 80, "d": 126, "s": 50}}
pokemons["メガサメハダー"] = {"id": 10070, "types": ['みず', 'あく'], "base_stats": {"h": 70, "a": 140, "b": 70, "c": 110, "d": 65, "s": 105}}
pokemons["メガヤドラン"] = {"id": 10071, "types": ['みず', 'エスパー'], "base_stats": {"h": 95, "a": 75, "b": 180, "c": 130, "d": 80, "s": 30}}
pokemons["メガハガネール"] = {"id": 10072, "types": ['はがね', 'じめん'], "base_stats": {"h": 75, "a": 125, "b": 230, "c": 55, "d": 95, "s": 30}}
pokemons["メガピジョット"] = {"id": 10073, "types": ['ノーマル', 'ひこう'], "base_stats": {"h": 83, "a": 80, "b": 80, "c": 135, "d": 80, "s": 121}}
pokemons["メガオニゴーリ"] = {"id": 10074, "types": ['こおり'], "base_stats": {"h": 80, "a": 120, "b": 80, "c": 120, "d": 80, "s": 100}}
pokemons["メガディアンシー"] = {"id": 10075, "types": ['いわ', 'フェアリー'], "base_stats": {"h": 50, "a": 160, "b": 110, "c": 160, "d": 110, "s": 110}}
pokemons["メガメタグロス"] = {"id": 10076, "types": ['はがね', 'エスパー'], "base_stats": {"h": 80, "a": 145, "b": 150, "c": 105, "d": 110, "s": 110}}
pokemons["メガレックウザ"] = {"id": 10079, "types": ['ドラゴン', 'ひこう'], "base_stats": {"h": 105, "a": 180, "b": 100, "c": 180, "d": 100, "s": 115}}
pokemons["メガバクーダ"] = {"id": 10087, "types": ['ほのお', 'じめん'], "base_stats": {"h": 70, "a": 120, "b": 100, "c": 145, "d": 105, "s": 20}}
pokemons["メガミミロップ"] = {"id": 10088, "types": ['ノーマル', 'かくとう'], "base_stats": {"h": 65, "a": 136, "b": 94, "c": 54, "d": 96, "s": 135}}
pokemons["メガボーマンダ"] = {"id": 10089, "types": ['ドラゴン', 'ひこう'], "base_stats": {"h": 95, "a": 145, "b": 130, "c": 120, "d": 90, "s": 120}}
pokemons["メガスピアー"] = {"id": 10090, "types": ['むし', 'どく'], "base_stats": {"h": 65, "a": 150, "b": 40, "c": 15, "d": 80, "s": 145}}

# Custom Megas
pokemons["メガフラエッテ"] = {'id': 671, 'types': ['フェアリー'], 'base_stats': {'h': 74, 'a': 85, 'b': 87, 'c': 155, 'd': 148, 's': 102}}
pokemons["メガマフォクシー"] = {'id': 655, 'types': ['ほのお', 'エスパー'], 'base_stats': {'h': 75, 'a': 69, 'b': 72, 'c': 154, 'd': 130, 's': 134}}
pokemons["メガゲッコウガ"] = {'id': 658, 'types': ['みず', 'あく'], 'base_stats': {'h': 72, 'a': 125, 'b': 77, 'c': 133, 'd': 81, 's': 142}}
pokemons["メガブリガロン"] = {'id': 652, 'types': ['くさ', 'かくとう'], 'base_stats': {'h': 88, 'a': 157, 'b': 162, 'c': 74, 'd': 95, 's': 54}}
pokemons["メガメガニウム"] = {'id': 154, 'types': ['くさ', 'フェアリー'], 'base_stats': {'h': 80, 'a': 82, 'b': 140, 'c': 123, 'd': 140, 's': 60}}
pokemons["メガオーダイル"] = {'id': 160, 'types': ['みず', 'あく'], 'base_stats': {'h': 85, 'a': 150, 'b': 120, 'c': 79, 'd': 103, 's': 93}}
pokemons["メガエンブオー"] = {'id': 500, 'types': ['ほのお', 'かくとう'], 'base_stats': {'h': 110, 'a': 163, 'b': 85, 'c': 130, 'd': 85, 's': 55}}
pokemons["メガスターミー"] = {'id': 121, 'types': ['みず', 'エスパー'], 'base_stats': {'h': 60, 'a': 75, 'b': 105, 'c': 140, 'd': 105, 's': 135}}
pokemons["メガピクシー"] = {'id': 36, 'types': ['フェアリー'], 'base_stats': {'h': 95, 'a': 70, 'b': 103, 'c': 125, 'd': 120, 's': 70}}
pokemons["メガカイリュー"] = {'id': 149, 'types': ['ドラゴン', 'ひこう'], 'base_stats': {'h': 91, 'a': 164, 'b': 115, 'c': 120, 'd': 110, 's': 100}}
pokemons["メガケケンカニ"] = {'id': 740, 'types': ['かくとう', 'こおり'], 'base_stats': {'h': 97, 'a': 172, 'b': 97, 'c': 62, 'd': 87, 's': 63}}
pokemons["メガキラフロル"] = {'id': 970, 'types': ['いわ', 'どく'], 'base_stats': {'h': 83, 'a': 55, 'b': 120, 'c': 170, 'd': 111, 's': 86}}
pokemons["メガユキメノコ"] = {'id': 478, 'types': ['こおり', 'ゴースト'], 'base_stats': {'h': 70, 'a': 80, 'b': 70, 'c': 120, 'd': 70, 's': 170}}
pokemons["メガルチャブル"] = {'id': 701, 'types': ['かくとう', 'ひこう'], 'base_stats': {'h': 78, 'a': 132, 'b': 95, 'c': 74, 'd': 83, 's': 138}}
pokemons["メガエアームド"] = {'id': 227, 'types': ['はがね', 'ひこう'], 'base_stats': {'h': 65, 'a': 110, 'b': 180, 'c': 40, 'd': 90, 's': 80}}
pokemons["メガチリーン"] = {'id': 358, 'types': ['エスパー', 'フェアリー'], 'base_stats': {'h': 75, 'a': 50, 'b': 110, 'c': 135, 'd': 120, 's': 65}}
pokemons["メガゴルーグ"] = {'id': 623, 'types': ['じめん', 'ゴースト'], 'base_stats': {'h': 89, 'a': 164, 'b': 100, 'c': 55, 'd': 100, 's': 75}}
pokemons["メガスコヴィラン"] = {'id': 952, 'types': ['くさ', 'ほのお'], 'base_stats': {'h': 65, 'a': 148, 'b': 85, 'c': 148, 'd': 85, 's': 85}}
pokemons["メガウツボット"] = {'id': 71, 'types': ['くさ', 'どく'], 'base_stats': {'h': 80, 'a': 145, 'b': 85, 'c': 130, 'd': 100, 's': 50}}
pokemons["メガシャンデラ"] = {'id': 609, 'types': ['ゴースト', 'ほのお'], 'base_stats': {'h': 60, 'a': 55, 'b': 110, 'c': 185, 'd': 110, 's': 100}}
pokemons["メガドリュウズ"] = {'id': 530, 'types': ['じめん', 'はがね'], 'base_stats': {'h': 110, 'a': 175, 'b': 80, 'c': 50, 'd': 85, 's': 108}}
pokemons["メガニャオニクス"] = {'id': 678, 'types': ['エスパー'], 'base_stats': {'h': 74, 'a': 48, 'b': 116, 'c': 123, 'd': 121, 's': 84}}
pokemons["メガジジーロン"] = {'id': 780, 'types': ['ノーマル', 'ドラゴン'], 'base_stats': {'h': 78, 'a': 60, 'b': 105, 'c': 175, 'd': 131, 's': 36}}

# Exact Official and Custom Megas from Yakkun
pokemons["メガフシギバナ"] = {"id": 10033, "types": ['くさ', 'どく'], "base_stats": {"h": 80, "a": 100, "b": 123, "c": 122, "d": 120, "s": 80}}

if "メガディアンシー" in pokemons: pokemons["メガディアンシー"]["id"] = 10075

if "メガレックウザ" in pokemons: pokemons["メガレックウザ"]["id"] = 10079

if "メガミミロップ" in pokemons: pokemons["メガミミロップ"]["id"] = 10088

if "メガエルレイド" in pokemons: pokemons["メガエルレイド"]["id"] = 10093

if "メガタブンネ" in pokemons: pokemons["メガタブンネ"]["id"] = 10091

if "メガゲッコウガ" in pokemons: pokemons["メガゲッコウガ"]["id"] = 10116

if "メガフラエッテ" in pokemons: pokemons["メガフラエッテ"]["id"] = 10061

if "メガジガルデ" in pokemons: pokemons["メガジガルデ"]["id"] = 10118

if "ゲンシグラードン" in pokemons: pokemons["ゲンシグラードン"]["id"] = 10077

if "ゲンシカイオーガ" in pokemons: pokemons["ゲンシカイオーガ"]["id"] = 10078


# Image URLs from Zukan
zukan_images = {
    "メガマフォクシー": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/7f044b4546e27d48a36be3c56040dcca.jpg",
    "メガゲッコウガ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/c6f9e6d31e75d1eecf95eb4c7f43be4a.jpg",
    "メガブリガロン": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/19b571579e68c85332f22a0dc274f909.jpg",
    "メガメガニウム": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/d020f585e743267c0ebd6c826ae66c68.jpg",
    "メガオーダイル": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/cab37167981e25a292031b95d15799df.jpg",
    "メガエンブオー": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/f9db19ff33d9f240a7e361692547e0e3.jpg",
    "メガスターミー": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/71d68e05492d76a2696bf2b00f26b08f.jpg",
    "メガピクシー": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/cbbd39ef24602b3d26c941af702f39c2.jpg",
    "メガカイリュー": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/c8861f429c21093ba9d965bd4e6c03f6.jpg",
    "メガケケンカニ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/dabdd0caa39a52fa46e0632e06c322a6.jpg",
    "メガキラフロル": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/1f62b7079721238c7876962e9b37d52c.jpg",
    "メガユキメノコ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/b5303306176c4f0b17c304da1ae76a5d.jpg",
    "メガルチャブル": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/1aa9357ec11a844551f2377449091eec.jpg",
    "メガエアームド": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/e1b74d9633ebe4dc4f4d025b1c775ad9b3cf7c83.jpg",
    "メガチリーン": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/4718bf819816a46dea35bfafce307d82.jpg",
    "メガゴルーグ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/57cb08985ee7e126f50f9dc095745184.jpg",
    "メガスコヴィラン": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/27f8a651adcca62adf8777ea6be7f0f1.jpg",
    "メガウツボット": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/4aff0d81dc773f18457e2f1e94bde5bf.jpg",
    "メガシャンデラ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/1bfa764fcb2cbede2db3cbb67b96c7db.jpg",
    "メガドリュウズ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/e21923c72b85e331db8486f49e6483ac.jpg",
    "メガニャオニクス": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/79ed8b43461eacf1874a3c985ede0ca74abd6a32.jpg",
    "メガニャオニクス♂": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/79ed8b43461eacf1874a3c985ede0ca74abd6a32.jpg",
    "メガニャオニクス♀": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/bd2992ddd6f8e5d50ec15349fe463b16.jpg",
    "メガジジーロン": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/37ce3d3ecc95a17216ecf6e53275e772.jpg",
    "メガカラマネロ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/e43980e950d223f2ea2286346d04957b.jpg",
    "メガガメノデス": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/18d25f3949da830c71bf9083de2ba6be.jpg",
    "メガドラミドロ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/bdf4436f910ef93094733c21442af5c9.jpg",
    "メガグソクムシャ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/16f745cce187a1517541865552fa05f4.jpg",
    "メガマギアナ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/63e720bed92192ff4900d215913f14ab.jpg",
    "メガゼラオラ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/41d84e1c606bd4beda4f420c2714a7c0.jpg",
    "メガタイレーツ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/017dfa713c70d62ffb12a2fdb5bb0c58.jpg",
    "メガシャリタツ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/6dac833dec7243d6957b210adea06ff6.jpg",
    "メガセグレイブ": "https://zukan.pokemon.co.jp/zukan-api/up/images/index/e4d91dd930fcb13df0515490793e4df0.jpg"
}

def get_type_multiplier(attack_type, defender_types):
    multiplier = 1.0
    for def_type in defender_types:
        if attack_type in type_chart and def_type in type_chart[attack_type]:
            multiplier *= type_chart[attack_type][def_type]
    return multiplier


move_flags = {
    "contact": ["フレアドライブ", "インファイト", "アクアブレイク", "かみくだく", "じしん", "じゃれつく", "つるぎのまい"],
    "punch": ["マッハパンチ", "バレットパンチ", "ドレインパンチ", "インファイト", "れいとうパンチ", "かみなりパンチ", "ほのおのパンチ", "アームハンマー", "ばくれつパンチ", "きあいパンチ", "アイスハンマー"],
    "bite": ["かみくだく", "こおりのキバ", "ほのおのキバ", "かみなりのキバ", "サイコファング", "エラがみ", "かみつく"],
    "slice": ["せいなるつるぎ", "リーフブレード", "サイコカッター", "つじぎり", "きょじゅうざん", "アクアカッター", "トリックフラワー", "むねんのつるぎ", "ドゲザン", "ひけん・ちえなみ"],
    "sound": ["ハイパーボイス", "ばくおんぱ", "むしのさざめき", "スケイルノイズ", "みわくのボイス", "フレアソング", "オーバードライブ", "うたかたのアリア"]
}
detailed_contact_moves = ["フレアドライブ", "インファイト", "アクアブレイク", "かみくだく", "じゃれつく", "げきりん", "ドラゴンダイブ", "アイアンヘッド", "はたきおとす", "とんぼがえり", "マッハパンチ", "バレットパンチ", "ドレインパンチ", "れいとうパンチ", "かみなりパンチ", "ほのおのパンチ", "アームハンマー", "サイコファング", "エラがみ", "せいなるつるぎ", "リーフブレード", "つじぎり", "きょじゅうざん", "アクアカッター", "むねんのつるぎ", "ドゲザン"]

for m_name in moves:
    if m_name in move_flags["punch"]: moves[m_name]["is_punch"] = True
    if m_name in move_flags["bite"]: moves[m_name]["is_bite"] = True
    if m_name in move_flags["slice"]: moves[m_name]["is_slice"] = True
    if m_name in move_flags["sound"]: moves[m_name]["is_sound"] = True
    if m_name in detailed_contact_moves: moves[m_name]["is_contact"] = True
